[
  {
    "path": "posts/2021-08-26-cleanup-vs-crime-mechanics/",
    "title": "Cleanup vs. Crime: Mechanics",
    "description": "Why did it work?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-10-30",
    "categories": [
      "Technical",
      "Cleanup vs. Crime",
      "Social Cohesion"
    ],
    "contents": "\n\nThe lowest and vilest alleys in London do not present a more dreadful record of sin than does the the smiling and beautiful countryside. - Sherlock Holmes, The Adventures of the Copper Beaches\n\nAfter all the randomization, cleaning and measuring, now comes the philosophical pondering. Why did we see the low rates of crime we did in the areas around the greened lots? This is not a question to which we can provide a definitive answer, at least not from this study. However, we should at least discuss some of the prevailing ideas in this space and consider which among them are most compelling.\nEyes on the Street\nThe authors offer a number of summary comments detailing the potential mechanisms that may explain the reductions in shootings. The first arose from their qualitative research — survey interviews — which suggested that the greened vacant lots encouraged nearby residents to be more likely to leave their houses to walk by or spend leisure time in the lots that were previously used for illicit activities like drug dealing (Moyer et al. 2019).\nThe decrease in crime then, under this premise, arose from the increased number of residents using the vacant lots as it provided an increased number of undesirable witnesses for those who might otherwise become involved in a shooting. The author’s cite this as a possible manifestation of routine activities theory, which posts that predatory crime is most likely to occur when a motivated offender, a desirable target, and a lack of effective guardians converge in time and place (Cohen and Felson 1979).\nThis is a powerful idea, and while the work cited was published in 1979, there was an even earlier argument for these ideas in the 60’s. In one of the seminal works of urban planning, “The Death and Life of Great American Cities,” Jane Jacobs lays out a similar, simple thesis for what makes city streets safe (Jacobs 1959):\n\n… [T]here must be eyes upon the street, eyes belonging to those we might call the natural proprietors of the street. The buildings on a street equipped to handle the strangers and to insure the safety of both residents and strangers must be oriented to the street. They cannot turn their backs or blank sides on it and leave it blind.\n\nPersonally, I find this idea so compelling because it is so simple. We are innately social creatures and care a lot about what others think about us.\nWe simply act differently when we think others may be watching, no matter our capacity for ill-intent. Still, there may be more at work here then simply increasing the number of eyes on the street.\nSocial Cohesion and Broken Windows\n\n\n\nFigure 1: Figure from Tomas Castelazo, CC BY-SA 3.0 https://creativecommons.org/licenses/by-sa/3.0, via Wikimedia Commons\n\n\n\nThere are two more sociological theories that may be at play here. The authors cite both collective efficacy theory as well as broken windows theory as being relevant in their final comments (Sampson, Raudenbush, and Earls 1997; Kelling and Wilson 1982). The first theory speaks directly to the idea of social cohesion highlighted in this blog’s introductory motivation: that members of a neighborhood community will attempt to self-regulate one another, separate of a more formal process, in order to avoid problems like those that may arise with the police, as well as encourage other behaviors that promote shared values. The authors in our paper argue that the cleaned up vacant lots may have promoted this sense of social cohesion, prompting a renewed willingness to act for the common good and normalizing a higher standard of behavior in the community.\nBuilding off this idea, the broken windows theory posits that a sense of disorder may promote further disorder — if one window is broken in a building, the rest will soon be broken. By restoring some sense of “order” to the built environment, the greened and mowed vacant lots reduced the inherent psychological feeling that crime was appropriate.\nWhich is it?\nAll of these ideas represent plausible mechanisms by which the greening and mowing intervention effects on gun violence may have occurred. We can’t really know which, or to what extent one theory may have had a larger role to play than the others from this analysis but future work that target these theories more specifically could. For example, one might be able to scrape comments and photos on social media sites like Nextdoor or Twitter that mention the vacant lots, and try to identify how the attitudes community members communicate about these spaces may comport more or less with the theories stated above. For my part, I think each of these theories probably plays some role, though I have to think that the eyes on the street may be the most impactful in discouraging misdeeds.\nLooking Ahead\nThis post represents the final writing I plan to do on this paper specifically, though I hope to reference it again in future work. Specifically, I hope to build on the ideas discussed here to examine different ways crime manifests in cities during times of duress — like, say a pandemic — as well as consider alternative methods for modeling crime. Regardless, it is my hope that having read some or all of this case study, you’ve come away with an appreciation for both the importance of the built environment as it affects one of the most important aspects of our lives — safety — as well as gained some understanding of the difficulties in how we measure and analyze these phenomena.\n\nThe pressure of public opinion can do in the town what the law cannot accomplish. There is no lane so vile that the scream of a tortured child, or the thud of a drunkard’s blow, does not beget sympathy and indignation among the neighbours, and then the whole machinery of justice is ever so close that a word of complaint can set it going, and there is but a step between the crime and the dock. But look at these lonely houses, each in its own fields, filled for the most part with poor ignorant folk who know little of the law. Think of the deeds of hellish cruelty, the hidden wickedness which may go on, year in, year out, in such places, and none the wiser.\" - Sherlock Holmes, The Adventures of the Copper Beaches []\n\n\n\n\nCohen, Lawrence E, and Marcus Felson. 1979. “Social Change and Crime Rate Trends: A Routine Activity Approach.” American Sociological Review, 588–608.\n\n\nJacobs, Jane. 1959. The Death and Life of Great American Cities. Vintage.\n\n\nKelling, George L., and James Q. Wilson. 1982. “Broken Windows: The Police and Neighborhood Safety.” The Atlantic, March.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\nSampson, Robert J, Stephen W Raudenbush, and Felton Earls. 1997. “Neighborhoods and Violent Crime: A Multilevel Study of Collective Efficacy.” Science 277 (5328): 918–24.\n\n\n\n\n",
    "preview": "posts/2021-08-26-cleanup-vs-crime-mechanics/Broken_window_large.jpeg",
    "last_modified": "2021-09-05T23:03:41-04:00",
    "input_file": "cleanup-vs-crime-mechanics.knit.md"
  },
  {
    "path": "posts/2021-08-23-cleanup-vs-crime-methods-of-analysis/",
    "title": "Cleanup vs. Crime: Methods of Analysis",
    "description": "From KDEs to Difference-in-Differences",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-09-23",
    "categories": [
      "Technical",
      "Cleanup vs. Crime",
      "Social Cohesion"
    ],
    "contents": "\nContext\nIn the previous post we discussed this fantastic article (Moyer et al. 2019) which studied how different cleaning “interventions” applied to vacant lots had the potential to affect the propensity for nearby violent shootings. In this post we’ll look at the specific measures and statistical methods they used to analyze their data in order to test this hypothesis and break down the methods’ various advantages and disadvantages.\nMethods\nData and Questions\nRecall from the paper that the authors had shooting data accessed from the Philadelphia Police Department, and vacant lot data - location, size, and randomized intervention, that they amassed as part of their project. I’ve already shown, visually, what the shooting data looked like in the first post. As for the vacant lot data, it probably looked something like what’s in Table 1.\n\n\nhtml {\n  font-family: -apple-system, BlinkMacSystemFont, 'Segoe UI', Roboto, Oxygen, Ubuntu, Cantarell, 'Helvetica Neue', 'Fira Sans', 'Droid Sans', Arial, sans-serif;\n}\n\n#ihmyplpesx .gt_table {\n  display: table;\n  border-collapse: collapse;\n  margin-left: auto;\n  margin-right: auto;\n  color: #333333;\n  font-size: 16px;\n  font-weight: normal;\n  font-style: normal;\n  background-color: #FFFFFF;\n  width: auto;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #A8A8A8;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #A8A8A8;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_heading {\n  background-color: #FFFFFF;\n  text-align: center;\n  border-bottom-color: #FFFFFF;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_title {\n  color: #333333;\n  font-size: 125%;\n  font-weight: initial;\n  padding-top: 4px;\n  padding-bottom: 4px;\n  border-bottom-color: #FFFFFF;\n  border-bottom-width: 0;\n}\n\n#ihmyplpesx .gt_subtitle {\n  color: #333333;\n  font-size: 85%;\n  font-weight: initial;\n  padding-top: 0;\n  padding-bottom: 4px;\n  border-top-color: #FFFFFF;\n  border-top-width: 0;\n}\n\n#ihmyplpesx .gt_bottom_border {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_col_headings {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_col_heading {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 6px;\n  padding-left: 5px;\n  padding-right: 5px;\n  overflow-x: hidden;\n}\n\n#ihmyplpesx .gt_column_spanner_outer {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: normal;\n  text-transform: inherit;\n  padding-top: 0;\n  padding-bottom: 0;\n  padding-left: 4px;\n  padding-right: 4px;\n}\n\n#ihmyplpesx .gt_column_spanner_outer:first-child {\n  padding-left: 0;\n}\n\n#ihmyplpesx .gt_column_spanner_outer:last-child {\n  padding-right: 0;\n}\n\n#ihmyplpesx .gt_column_spanner {\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: bottom;\n  padding-top: 5px;\n  padding-bottom: 6px;\n  overflow-x: hidden;\n  display: inline-block;\n  width: 100%;\n}\n\n#ihmyplpesx .gt_group_heading {\n  padding: 8px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#ihmyplpesx .gt_empty_group_heading {\n  padding: 0.5px;\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  vertical-align: middle;\n}\n\n#ihmyplpesx .gt_from_md > :first-child {\n  margin-top: 0;\n}\n\n#ihmyplpesx .gt_from_md > :last-child {\n  margin-bottom: 0;\n}\n\n#ihmyplpesx .gt_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  margin: 10px;\n  border-top-style: solid;\n  border-top-width: 1px;\n  border-top-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 1px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 1px;\n  border-right-color: #D3D3D3;\n  vertical-align: middle;\n  overflow-x: hidden;\n}\n\n#ihmyplpesx .gt_stub {\n  color: #333333;\n  background-color: #FFFFFF;\n  font-size: 100%;\n  font-weight: initial;\n  text-transform: inherit;\n  border-right-style: solid;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n  padding-left: 12px;\n}\n\n#ihmyplpesx .gt_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#ihmyplpesx .gt_first_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_grand_summary_row {\n  color: #333333;\n  background-color: #FFFFFF;\n  text-transform: inherit;\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n}\n\n#ihmyplpesx .gt_first_grand_summary_row {\n  padding-top: 8px;\n  padding-bottom: 8px;\n  padding-left: 5px;\n  padding-right: 5px;\n  border-top-style: double;\n  border-top-width: 6px;\n  border-top-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_striped {\n  background-color: rgba(128, 128, 128, 0.05);\n}\n\n#ihmyplpesx .gt_table_body {\n  border-top-style: solid;\n  border-top-width: 2px;\n  border-top-color: #D3D3D3;\n  border-bottom-style: solid;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_footnotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_footnote {\n  margin: 0px;\n  font-size: 90%;\n  padding: 4px;\n}\n\n#ihmyplpesx .gt_sourcenotes {\n  color: #333333;\n  background-color: #FFFFFF;\n  border-bottom-style: none;\n  border-bottom-width: 2px;\n  border-bottom-color: #D3D3D3;\n  border-left-style: none;\n  border-left-width: 2px;\n  border-left-color: #D3D3D3;\n  border-right-style: none;\n  border-right-width: 2px;\n  border-right-color: #D3D3D3;\n}\n\n#ihmyplpesx .gt_sourcenote {\n  font-size: 90%;\n  padding: 4px;\n}\n\n#ihmyplpesx .gt_left {\n  text-align: left;\n}\n\n#ihmyplpesx .gt_center {\n  text-align: center;\n}\n\n#ihmyplpesx .gt_right {\n  text-align: right;\n  font-variant-numeric: tabular-nums;\n}\n\n#ihmyplpesx .gt_font_normal {\n  font-weight: normal;\n}\n\n#ihmyplpesx .gt_font_bold {\n  font-weight: bold;\n}\n\n#ihmyplpesx .gt_font_italic {\n  font-style: italic;\n}\n\n#ihmyplpesx .gt_super {\n  font-size: 65%;\n}\n\n#ihmyplpesx .gt_footnote_marks {\n  font-style: italic;\n  font-weight: normal;\n  font-size: 65%;\n}\nTable 1: Hypothetical Vacant Lot Data\n  \n  Lot Cluster ID\n      Intervention\n      Latitude\n      Longitude\n    1\nGreening\n0\n02\nMowing\n0\n03\nGreening\n0\n04\nControl\n0\n05\nControl\n0\n0\n\nBut all this begs the question, if we have lots at one location, and shootings at another, how do we relate the two to each other? The authors propose two methods, the first involving a kernel density estimate and the second involving a count of the number of shootings inside a “Buffer” Zone around the vacant lot.\nKernel Density Estimates\nWhat’s a kernel density estimate(KDE)? Simply put, it is a fancy word for a fancy kind of average1. The author’s created a grid of points across the polygonal space defined by Philadelphia’s borders and at each grid point took a weighted average of the number of shootings during the time period, e.g. month, of interest. They chose a bandwidth of 500 meters, which essentially means that shootings within that distance were weighted more than those further away. We can’t know which exact kernel they used because they don’t state it explicitly, but of the many options they may have chosen the Gaussian kernel, as it is popular in these settings. For illustrative purposes, you can see it below with bandwidth \\(b\\) for location \\(\\mathbf{s}=(s_1,s_2)\\)2,\n\\[\n\\mathcal{K}_b(\\mathbf{s}_1,\\mathbf{s}_2) = \n\\exp(-\\frac{1}{2b^2}d(\\mathbf{s}_1,\\mathbf{s}_2)),\n\\] where \\(d(\\mathbf{s}_1,\\mathbf{s}_2)\\) is the distance between the two locations. The KDE,\\(\\hat{y}\\) at location \\(\\mathbf{s}\\) for a given time period (e.g. month) would then be defined as follows:\n\\[\n\\hat{y}(\\mathbf{s}) = \\frac{\\sum_{i=1}^{n}\\mathcal{K}_b(\\mathbf{s}, \n\\mathbf{s'})y_i(\\mathbf{s'})}{\\sum_{i=1}^{n}\\mathcal{K}_b(\\mathbf{s},\n\\mathbf{s}')}.\n\\]\nWhat this amounts to conceptually is an average number of shootings at each grid point, where those shootings at closer distances are weighted more and those shootings at further distances (especially those more than 500 m) are weighted exponentially less. The authors create their main figure in the paper from plotting the relative averages at each grid point across space. The lower values are assigned a more green color and the higher values are assigned a red color. See Figure 1 adapted here from their paper(Moyer et al. 2019).\n\n\n\nFigure 1: Kernel Density Estimate of shootings adapted from (Moyer et al. 2019).\n\n\n\nAs you can see, the kernel density estimate gives us this nice visualization and a decent conceptualization of the vacant lots that are most prone to having shootings nearby, but what are the disadvantages, if any?\nPros and Cons\nAs stated previously, the KDE has a number of advantages, including the ability to nicely visualize across continuous space, the relative “amount” of shootings at each location. However, it has a number of drawbacks too. The first, is that we don’t know if it’s a particularly good estimate. If you recall, the author’s chose a certain bandwidth of 500m, but wouldn’t 400m have been just as good? This is a well established problem in this space known as the modifiable areal unit problem (fotheringham1991modifiable?). Further, while the idea of a KDE of shootings can be nicely visualized, as in Figure 1, it can be difficult to communicate verbally to stakeholders:\n“Ah yes, you see when we cleaned up these vacant lots we found that the average number of shootings at the vacant lot decreased as measured by this kernel density estimate, which takes into account a weighted average of those shootings that are nearby. What do I mean by nearby and how did I choose the weights? Well the weights and proximity are defined according to this kernel and bandwidth measure we chose….”\nYou get the picture. It would be much easier to say, did the average number of shootings at location “x” go down or not? However, this can be much harder to model, so the author’s, understandably, went with something more feasible.\n\\[ \nY_{it} := \\text{ KDE at lot } i\\text{, in study month } t \\\\\n\\]\nBuffer Counts\nThe second measure the author’s use to try and assign a specific number of shootings to a vacant lot is known as a “buffer count” or “buffer zone.” Put simply, the author’s looked at the center of each vacant lot, drew a circle 300 meters around that point, and counted all the shootings that fell into that circle, during a given month and assigned that value to the vacant lot as it’s count of shootings, \\(Y_{it}'\\). See Figure 2 for a visualization of this idea. The authors then went on to check for “spill-over” effects through the use of a second, 600m buffer around the first.\n\n\n\nFigure 2: Visualization of Hypothetical Buffer with 300 m radius in Upper Kensington. Star represents location of hypothetical vacant lot.\n\n\n\nPros and Cons\nThe buffer count has a very appealing interpretation, it’s simply the number of shootings (or whatever you’re counting) within a certain distance of the location of interest. This is much easier to explain to stakeholders, and others who may be interested in this work, but not interested in learning about kernels and bandwidths. It can also be seen as a kind of kernel density estimate, except now we’re taking an unweighted, unnormalized average3. However, similar to the kernel density estimate, it suffers from having to choose some ad hoc distance, 300 (or 600 for spillover) meters in this case, as the “correct” distance within which to count shootings. This remains a major drawback.\n\nThere have been developments in the statistics literature to try and address these that we’ll discuss in detail at another point in time. See (Baek et al. 2016),(Peterson, Hirsch, and Sanchez 2021), and (Peterson, Sanchez-Vaznaugh, and Sanchez 2021) if you’d like to learn more now.\n\\[\nY_{it}' = \\text{# of shootings within 300m of vacant lot } i \\text{ during month } t \n\\]\nDifference in Differences\nNow that we have our two outcome measures constructed from the shooting data and vacant lot locations, we can turn to modeling the potential effects of the vacant lot cleanup intervention. The author’s estimate a “Difference-in-Differences”(DnD) of the expected number of shootings at the lots that receive either the “greening” or “mowing” intervention. This is a very specific estimate that we’ll elaborate on in more detail in the causal inference post, but for now it suffices to say they’re comparing the same vacant lots before and after receiving the interventions, as opposed to comparing those lots that received interventions and the control. There may or may not be good reasons for not estimating this latter contrast but we’ll save that discussion for the causal-inference post. For now, let’s break down this big equation from the initial post and try to understand how they calculate the difference-in-difference estimate for the greening intervention;\n\\[\\begin{equation}\n\\begin{aligned}\nY_{it} &= \\beta_0 + \\beta_1 \\text{Greening}_i + \\beta_2\\text{Mowing}_i\n+ \\beta_3\\text{Post}_t + \\beta_4\\text{AllTreated}_i  \\\\\n&+ \\beta_5 \\text{Greening}_i \\times \\text{Post}_t + \n\\beta_6\\text{Mowing}_i \\times \\text{Post}_t  \\\\\n&+ \\beta_7\\text{Greening}_i\\times \\text{AllTreated}_t + \n\\beta_8\\text{Mowing}_i \\times \\text{AllTreated}_t \\\\\n&+ \\alpha_{m(t)} + \\delta_{s(i)} + \\xi_{c(i)} + \\epsilon_{it}.\n\\end{aligned}\n\\tag{1}\n\\end{equation}\\]\n\nThis equation uses the notion of indicator functions. That is, Greening\\(_i\\) is either a 0 or 1 for lot \\(i\\). 1 indicates the lot received the greening intervention and 0 indicates it did not. Post\\(_t\\) is the same where a 1 indicates the measurement was recorded after the intervention was administered.\nFrom (1), we can see that the expected number of shootings for a greening lot prior and subsequent to the intervention is represented by \\(\\beta_0 + \\beta_1\\), and \\(\\beta_0 + \\beta_1 + \\beta_5\\), respectively. If we want to know the difference then, in the expected number of shootings for the same vacant lots assigned to the greening intervention before and after the trial, we simply take the difference between these two equations which gives us \\(\\beta_5\\). Our estimate of this quantity, \\(\\hat{\\beta}_5\\), is the estimated effect of the greening intervention. Similarly, \\(\\beta_6\\) is the estimated effect of the mowing intervention.\nOf course, in statistics it isn’t sufficient to just calculate a point estimate, like \\(\\hat{\\beta}_5\\), and call it a day. We need to provide some measure of our uncertainty of that estimate as well, to establish whether this result provides enough evidence to be considered credible, or whether the estimated effect is just due to measurement error or random variation. An important part of estimating that uncertainty is taking into account sources of correlation in the measurements. The authors do this by way of incorporating mixed effects. See my post on spatial models or (Fitzmaurice et al. 2008) for a more general introduction on this topic, as we’ll focus only on those aspects relevant to this application in the following section.\nMixed Effects Regression\nAt the very end of (1) you can see four terms reproduced below for easier focus:\n\\[\nY_{it} = ... + \\alpha_{m(t)} + \\delta_{s(i)} + \\xi_{c(i)} + \\epsilon_{it}.\n\\]\nEach of these terms account for a different source of correlation between the different vacant lots. The sources of variation and the corresponding parameter are as follows:\nTemporal correlation\nvacant lots have similar numbers of shootings according to which seasonal month of the year the measurement is taken: \\(\\alpha_{m(t)}\\)\n\nSpatial correlation\nvacant lots that are closer to each other will have more similar numbers of shootings than those that are far away : \\(\\delta_{s(i)}\\)\n\nCluster correlation\nvacant lots in the same cluster will have similar numbers of shootings: \\(\\xi_{c(i)}\\)\n\nThe final term \\(\\epsilon_{it}\\) represents measurement error that applies equally to all vacant lots, regardless of space, time, or cluster.\nThere is a lot that could be said about these mixed effects terms. However, it suffices to say that the author’s correctly include these terms to assure that the resulting confidence intervals they calculate for their estimates of interest, \\(\\hat{\\beta_5}\\) and \\(\\hat{\\beta_6}\\) take into account the variability within seasons, space and cluster.\nConclusion\nIn this post we’ve examined how the author’s use of KDEs, buffer counts, DnD estimators and mixed effects regression came together to try and provide a reliable estimate of the effects of the greening and mowing vacant lot interventions on shooting crimes. We’ve also seen some of the advantages and disadvantages each of these approaches may involve. Many of these will continue to be of importance as our attention now turns to the causal inference assumptions underlying the statistical methods and estimation procedures discussed here that, if correct, extend the results from this experiment to a more widely generalizable result.\n\n\n\nBaek, Jonggyu, Brisa N Sánchez, Veronica J Berrocal, and Emma V Sanchez-Vaznaugh. 2016. “Distributed Lag Models: Examining Associations Between the Built Environment and Health.” Epidemiology (Cambridge, Mass.) 27 (1): 116.\n\n\nFitzmaurice, Garrett, Marie Davidian, Geert Verbeke, and Geert Molenberghs. 2008. Longitudinal Data Analysis. CRC press.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\nPeterson, Adam, Jana Hirsch, and Brisa Sanchez. 2021. “Spatial Temporal Aggregated Predictors to Examine Built Environment Health Effects.” http://arxiv.org/abs/2105.10565.\n\n\nPeterson, Adam, Emma Sanchez-Vaznaugh, and Brisa Sanchez. 2021. “Heterogeneous Effects in the Built Environment.” http://arxiv.org/abs/2107.05805.\n\n\nThis describes most of the work done in Statistics.↩︎\nWhere \\(s_1,s_2\\) are e.g. latitude and longitude↩︎\nalso called a sum↩︎\n",
    "preview": "posts/2021-08-23-cleanup-vs-crime-methods-of-analysis/cleanup-vs-crime-methods-of-analysis_files/figure-html5/buffervis-1.png",
    "last_modified": "2021-09-04T13:05:15-04:00",
    "input_file": {},
    "preview_width": 2688,
    "preview_height": 1536
  },
  {
    "path": "posts/2021-08-07-cleanup-vs-crime/",
    "title": "Cleanup vs. Crime: A Case Study in 4 parts",
    "description": "A simple concept and a decent result.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-09-18",
    "categories": [
      "Big Picture",
      "Cleanup vs. Crime",
      "Social Cohesion"
    ],
    "contents": "\nI’m a big fan of this paper looking at how cleaning up vacant lots has the potential to affect crime(Moyer et al. 2019). There’s a lot to love here, and I’m hoping to use this paper as an excuse to explore several different ideas relevant to both understanding the built environment and statistical methods more generally. In this post we’ll focus on a high-level understanding of the paper while future posts will focus on (1) the measures of gun violence and statistical models used, (2) the assumptions and approach that go into the causal inference associated with this trial and finally (3), I’ll devote a post to the conceptual models at play here. Why would cleaning up a vacant lot affect nearby gun violence, or other measures of community health?\nI’ll go on to show alternative methods that could be used to analyze these data and the advantages they may have over the current author’s approach. I’ll leave that, however, for a different series of posts. Hopefully this brief outline has you excited for what’s to come, but for now, let’s dive into the paper!\n\nFor related papers see here and here.\nBackground\n\n\n\nFigure 1: Graphic demonstration of the different cleaning interventions. Figure from ‘Citywide cluster randomized trial to restore blighted vacant land…’ (Branas et al. 2018)\n\n\n\nThe authors’ objective in this work is to determine whether cleaning up a series of vacant lots in the areas where, unfortunately, many shootings regularly occur, could lead to a reduced rate of gun violence.\nIn order to test this hypothesis, the authors randomly assign 1 of three “interventions” to each of 110 geographically close clusters of vacant lots — 541 lots in total — spread across Philadelphia between April and June of 2013.\nThe first intervention called “greening” involved “removing trash and debris, grading the land, planting new grass and a small number of trees to create a parklike setting, installing low wooden perimeter fences, and regularly maintaining the lot.” (Moyer et al. 2019). You can see a demonstration of this idea in Figure 1.\nThe second intervention labeled “mowing” made the vacant lot not so much park-like as just generally maintained. The description states it as “mowing existing grass and weeds, removing trash and debris, and regularly maintaining the lot.” (Moyer et al. 2019).\nThe third and final “intervention” was simply the control group, where no action was taken on the vacant lot whatsoever.\nThe author’s used the Philadelphia Department of Police data of reported shootings not involving police officers from years 2011-2015 as their outcome of interest. You can see a sample of these data from 2015 in the neighborhood of Upper Kensington in Figure 2.\n\n\n\n\n\n\nFigure 2: Map of No-Officer Involved Shootings in Upper Kensington, Philadelphia during 2015. Red point indicates the occurrence of one shooting.\n\n\n\nMethods\nThe author’s used two different measures of the number of shootings each month in and around vacant lots to determine whether their interventions were effective: a kernel density estimate and two — differently sized — buffer counts. The author’s fit two models of a similar form, estimating the difference in the kernel density estimate and rate, respectively as a function of whether the observed lot density estimate or buffer count had received one of the two interventions during June 2013 - April, 2015.\nThey also adjusted for correlation across time, space and within clusters. The kernel density estimate model is shown below, but we’ll leave a more thorough examination of it and the buffer models for a later post.\n\\[ \nY_{it} := \\text{# Shootings / km}^2 \\text{at lot cluster } i\\text{, month } t \\\\\n\\] \\[\n\\begin{aligned}\nY_{it} &= \\beta_0 + \\beta_1 \\text{Greening}_i + \\beta_2\\text{Mowing}_i\n+ \\beta_3\\text{Post}_t + \\beta_4\\text{AllTreated}_i  \\\\\n&+ \\beta_5 \\text{Greening}_i \\times \\text{Post}_t + \n\\beta_6\\text{Mowing}_i \\times \\text{Post}_t  \\\\\n&+ \\beta_7\\text{Greening}_i\\times \\text{AllTreated}_t + \n\\beta_8\\text{Mowing}_i \\times \\text{AllTreated}_t \\\\\n&+ \\alpha_{m(t)} + \\delta_{s(i)} + \\xi_{c(i)} + \\epsilon_{it}\n\\end{aligned}\n\\]\n\nWhy did the author’s fit these different models? And what is going on in that equation? We’ll discuss this more in the post focused on the methods of analysis\nResults\nConverting their estimates to percent change in the number of expected shootings, the author’s determined that the monthly shootings per square kilometer (density estimate model) decreased by 6.8 % (95% Confidence Interval: -10.6%,-2.7%) for those lots in the greening intervention compared to the pre-intervention baseline and -9.2% (-13.2%,-4.8%) compared to baseline for those lots in the mowing intervention. The author’s estimated a similar significant result for the greening intervention for their buffer analysis and a non-significant change from the mowing intervention from their buffer analysis. The author’s sought to check for “spillover effects” from their interventions using the second, larger buffer model and found no significant difference for those areas adjacent to the greening intervention and a significant decrease in those areas adjacent to the mowing intervention. The author’s state that “these results suggest spillover benefits of vacant lot remediation, rather than displacement.” Meaning that they took this result to be evidence that the interventions didn’t simply push shootings to be one or two blocks away from where the clean-up occurred.\n\nA non-significant result here means that the author’s did not think there was sufficient evidence to conclude that the estimated change was not zero. See this example for more.\nConclusion\nSo … that’s neat! What’s the take home message? If you clean up that dirty parking lot near where you live, you’ll disincentive crime? Well, maybe. As with all human endeavors, nothing is perfect. In this case things aren’t always simple either. In the posts to come we’ll talk more about the problems this analysis has, despite the author’s best efforts, as well as why this result is still so encouraging in spite of those problems. One overarching theme to keep in mind, is that this is a fairly cheap endeavor, just cleaning up some vacant lots, with a potentially huge payoff — saving human lives! This represents both the simplicity and the power that I hope to show is a regular theme in building better built environments.\nAcknowledgements\nThanks to Robert Svoboda for reading and offering comments on this article.\n\n\n\nBranas, Charles C., Eugenia South, Michelle C. Kondo, Bernadette C. Hohl, Philippe Bourgois, Douglas J. Wiebe, and John M. MacDonald. 2018. “Citywide Cluster Randomized Trial to Restore Blighted Vacant Land and Its Effects on Violence, Crime, and Fear.” Proceedings of the National Academy of Sciences 115 (12): 2946–51. https://doi.org/10.1073/pnas.1718503115.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\n\n\n",
    "preview": "posts/2021-08-07-cleanup-vs-crime/F1.jpg",
    "last_modified": "2021-09-05T22:23:40-04:00",
    "input_file": "cleanup-vs-crime.knit.md"
  },
  {
    "path": "posts/2021-08-08-causal-inference-in-the-built-environment/",
    "title": "Causal Inference in the Built Environment",
    "description": "How can we know how to best change our environment?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-09-11",
    "categories": [
      "Big Picture"
    ],
    "contents": "\nIf we change the zoning on a region of land from being used exclusively for single family houses to mixed-use apartments and retail, will this increase the number of cars on the nearby road? If an individual moves to an apartment where they have a greater number of grocery store options to choose from, will they weigh less in 2 months than if they stayed at their current location? These are the kinds of causal questions asked by those interested in understanding the built environment. I’ve written on this subject more broadly elsewhere, but want to return to it now in a setting where the complexities of working with built environment data can be more explicitly highlighted. Note that if you’re not familiar with causal inference concepts already you may need to read the previous post series linked and/or check out one of the numerous references I suggest here.\n1. Lack of Randomization\nThere are a number of obstacles that built environment data typically involve when an investigator sets out to study causal relationship. The first is that, typically, it is impossible to randomize the exposure — e.g. grocery stores — of interest. Whereas vaccines, drugs, and even some government programs can be randomly assigned to individuals, it isn’t possible to randomly assign a park to a neighborhood or a certain kind of business to a specific storefront. These kinds of decisions are extremely expensive and will often involve a substantial amount of political decision making, rendering any attempt to introduce randomness a doomed prospect from the start. As the reader may be aware, randomization is key to ensuring that the units of analysis - individuals, streets, etc. - are comparable. That is, there is no reason to think a priori that those who have been treated or exposed are any different from those in the control.\n\nIf you want to see one interesting case where an environmental exposure is randomized … and the subsequent difficulty they had — see here. This paper will be discussed soon!\nThis is obviously not the case in the built environment. We observe differences in the underlying populations associated with certain built environment exposures constantly. Dense, walk-able neighborhoods, tend to be much more expensive than their suburban counterparts. Wealth is correlated with education, and so one might expect a wide range of different health outcomes between those in dense walk-able neighborhoods for example and their more rural counterparts that are not due to the built environment at all, but rather the wealth and/or education with which they are correlated. Adjusting for these factors in order to create as comparable a comparison as possible is crucial, if one is to trust the resulting causal estimate.\n\n\n\nFigure 1: Distribution of Median Income Across Allegheny County, PA Census Tracts.\n\n\n\n2. Interference\nEven if one were able to randomize some treatment to a built environment feature1 (BEF), one then has to consider the effects of interference. Interference is the name given to the phenomenon when an intervention or treatment on one entity affects the outcome of another. A violation of the commonly held Stable Unit Treatment Value Assumption or SUTVA, interference rears its heads often in the built environment when the treatment or intervention - the new upzoned region - affects not only the number of cars on the street immediately in front of it but also proximate streets, all under observation. Decomposing these effects across related units typically requires assumptions and/or prior understanding of the system under study. As such, interference can represent a major obstacle to making progress in this space.\n\n\n\nFigure 2: Observed 15 minute traffic rate on selected street blocks in Rittenhouse, Philadelphia from 2015-2020. Traffic rate is proportional to point size.\n\n\n\n3. Homogeneity, Additivity and More\nStill more problems await! In trying to understand how certain built environment features may affect human health or other aspects of the built environment, we’ll likely have to make even further assumptions. In our example with grocery stores, we’ll likely need to make some assumption that say, Kroger and Meier are equivalent grocery stores. This could be more justified than saying that the local farmer’s market could also merit the label of a “grocery store.” Assuming homogeneity in this manner greatly simplifies our modeling, but also runs us into conflicting with an assumption of consistency at the heart of causal inference.\nAdditivity is another such assumption that simplifies the mathematical tools required to estimate the causal estimand2 of interest. However, just as with assuming homogeneity, the simplicity that additivity enables in our mathematical modeling may not be justified by our principled understanding of the causal system under study.\nEven now, after listing all these challenges I don’t want to leave you with the impression that we’ve covered all the obstacles. Others may still rear their head!\n\nAssuming additivity can turn the model \\(Y = f(x_{1},x_{2},...,x_{k})\\) into \\(Y = \\sum_k f(x_{k})\\) which is considerably easier to estimate.\n\n\n\nFigure 3: Differences in hypothetical exposures for additive vs. non-additive models.\n\n\n\nSolutions\nAt this point, it may seem as though there is no way we can ever hope to understand the built environment amidst all the many non-randomized, correlated and interfering forces at work. Fear not, there are still some things we can do. Though we’ll likely never have the same level of confidence in our results as we would in a randomized control trial, we can try to incorporate more information through regression, narrow our focus with difference in difference estimators, model the interference associated with interventions, and allow for heterogeneous treatment effects in our model estimates. All this and more will be discussed as a part of blog posts to come but if you’re interested in learning more of the theory behind these ideas, I’d suggest you check out the statistics references linked to on this site’s reference page. Specifically the book by Hernan and Robins entitled “Causal Inference - What if?”, Angrist and Pitschke’s work, “Mastering Metrics”, “Counterfactuals and Causal Inference” by Stephen Morgan and Christopher Winshop and “Regression and Other Stories” by Gelman, Hill and Vehtari (Hernán and Robins 2010; Gelman, Hill, and Vehtari 2020; Angrist and Pischke 2014; Morgan and Winship 2015).\nAcknowledgements\nThanks to Robert Svoboda for reading and offering comments on this article.\n\n\n\nAngrist, Joshua D, and Jörn-Steffen Pischke. 2014. Mastering’metrics: The Path from Cause to Effect. Princeton university press.\n\n\nGelman, Andrew, Jennifer Hill, and Aki Vehtari. 2020. Regression and Other Stories. Cambridge University Press.\n\n\nHernán, Miguel A, and James M Robins. 2010. “Causal Inference.” CRC Boca Raton, FL.\n\n\nMorgan, Stephen L, and Christopher Winship. 2015. Counterfactuals and Causal Inference. Cambridge University Press.\n\n\nany amenity or structure in the built environment, e.g. sidewalk availability or, in this case, vacant lots↩︎\nan estimand is the thing one wishes to estimate.↩︎\n",
    "preview": "posts/2021-08-08-causal-inference-in-the-built-environment/causal-inference-in-the-built-environment_files/figure-html5/wealthvis-1.png",
    "last_modified": "2021-09-05T22:18:07-04:00",
    "input_file": "causal-inference-in-the-built-environment.knit.md",
    "preview_width": 2304,
    "preview_height": 1536
  },
  {
    "path": "posts/motivation/",
    "title": "Motivation",
    "description": "Urban spaces are more important than ever: Three reasons why and a highlight\nof what's to come.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-08-07",
    "categories": [
      "Big Picture"
    ],
    "contents": "\nOf all the things to talk about, why talk about the places where we live? Whether a city, town, suburb, or remote rural residence, the environments we live in define our lives. They constrain – or enable – the things we do, the people we see, the food we eat … you get the picture. But still – who cares? And why write about them right now?\nIn this post I’m going to try and convince you that, barring any commitments you may have made to a myopic nihilism, you care about the built environment, and urban spaces1 more generally, for at least 3 broad reasons, that will motivate much of the writing to follow. Here I’ll appeal to intuition, cite news articles, and be generally “un-academic” or imprecise, but this will likely change in subsequent posts. For now I hope to convince you, in broad strokes, that these environments are one of humanity’s most important inventions and that innovation in this space is especially important right now. Here’s why.\n#1. Social Cohesion: Can we get along?\nProtests. Riots. Mobs raging in the street. The past two years have shown us more than ever how we struggle to get along at a societal level. And that’s even before we start talking about the difficulties of getting along with family at Thanksgiving dinner or the comments on the latest NextDoor post.\nLike many things, it is easy to take for granted, but getting along with one another is important, not only to reinforce a feeling of safety in where one lives, but to also provide a sense of belonging and social community.\nIf any neighborhood, town or city is going to have real staying power it will be because people want to live there. How to accomplish this is another matter. Amidst all the social strife that exists in our modern age, how do we go about creating communities that flourish?\n#2. Efficiency: Cheaper, Faster, Farther\nHow can we do more with less? In an age of increasing income inequality and tight budgets, you’d think we would spend more time thinking about ways to stretch the money we have. Whether in terms of housing, transit, professional opportunities, or more, the increased density a city possesses should offer immense efficiency for its residents in how they spend their money. After all, this is one of the key reasons humans began gathering together in primitive towns all those many years ago. Easier to be near the specialized skills – healers, farmers, house builders, etc. Easier to get to work or play by way of well-established roads. And so on. Cities are fundamentally an economic bargain and you should be better off living in a city in terms of time and money spent than you would be elsewhere. How can cities help us to do more with less?\n#3. Climate Change: Life or Death\nFloods in China and Germany, wildfires, drought and heatwaves throughout the American mountain west. While I can remember a time when doubt about the perils of climate change was boasted with pride – not too long ago unfortunately – the evidence that the climate is changing and we are the cause only continues to climb with a increasing financial and human cost(Coninck 2018). But where do cities come into play?\nSPM.1: Figure 1 of the Summary for Policymakers of the IPCC’s Special Report on Global Warming of 1.5°C.Of the five biggest sources of greenhouse gas (GHG) emissions at least three can be reduced by improving urban spaces. I’ll give a brief example for each.\nElectricity:\nA typical suburban home has, on average, 9 rooms to light, heat and cool each day. In contrast, an old school row home will typically have 4-5 rooms, and a proportionately smaller electric GHG footprint as a result.\n\nTransportation:\nLiving closer to other people should mean you don’t have to drive as far to work, or that there’s easier options through biking and/or public transit instead.\n\nManufacturing:\nIf you’re living in a smaller space, you don’t need or want as much stuff. Far more importantly, you also don’t need to build as many roads, pipes, or other infrastructure because you’re getting more use out of the infrastructure you already have in place.\n\nAs we look to the future and marshall what hope we have to meet the challenge a changing climate presents, how can we leverage our cities to be more resilient and help us stave off the worst possibilities climate change may present to humanity?\nThe Reality\nIt’s easy to see in the U.S.2, whether through suburban sprawl, traffic jammed highways, increasing cost of living or crime and safety issues, our cities fail to live up to the full promise that urban spaces ought to offer. Identifying the nature of these failings explicitly, as well as the solutions that may address them, will form much of the substance of this blog.\n\n\n\nConinck, Heleen C de. 2018. “IPCC Sr15: Summary for Policymakers.” In IPCC Special Report Global Warming of 1.5 c. Intergovernmental Panel on Climate Change.\n\n\nurban spaces is a term I will use interchangeably with cities to refer to any space in which humans live within close proximity to one another. It is not intended to be used with great precision here.↩︎\nThe U.S. will be the primary, though not exclusive focus of this blog.↩︎\n",
    "preview": "posts/motivation/spm1.png",
    "last_modified": "2021-08-29T14:10:29-04:00",
    "input_file": {},
    "preview_width": 900,
    "preview_height": 600
  }
]
