[
  {
    "path": "posts/motivation/",
    "title": "Motivation",
    "description": "Urban spaces are more important than ever: Three reasons why and a highlight\nof what's to come.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-08-07",
    "categories": [
      "Big Picture"
    ],
    "contents": "\nOf all the things to talk about, why talk about the places where we live? Whether a city, town, suburb, or remote rural residence, the environments we live in define our lives. They constrain – or enable – the things we do, the people we see, the food we eat … you get the picture. But still – who cares? And why write about them right now?\nIn this post I’m going to try and convince you that, barring any commitments you may have made to a myopic nihilism, you care about the built environment, and urban spaces1 more generally, for at least 3 broad reasons, that will motivate many of the writings to follow. Here I’ll appeal to intuition, cite news articles, and be generally “un-academic” or imprecise, but this will likely change in subsequent posts. For now I hope to convince you, in broad strokes, that these environments are one of humanity’s most important inventions and that innovation in this space is especially important right now. Here’s why.\n#1. Social Cohesion: Can we get along?\nProtests. Riots. Mobs raging in the street. The past two years have shown us more than ever how we struggle to get along at a societal level. And that’s even before we start talking about the difficulties of getting along with family at Thanksgiving dinner or the comments on the latest NextDoor post.\nLike many things, it is easy to take for granted, but getting along with one another is important, not only to reinforce a feeling of safety in where one lives, but to also provide a sense of belonging and social community.\nIf any neighborhood, town or city is going to have real staying power it will be because people want to live there. Safety, belonging and community are each important ways to satisfy these universal human desires.\n#2. Efficiency: Cheaper, Faster, Farther\nHow can we do more with less? In an age of increasing income inequality and tight budgets, you’d think we would spend more time thinking about ways to stretch the money we have, to do more with what we currently have, or preferably even less. Efficiency is one of the key reasons humans began gathering together in primitive towns, all those many years ago. Easier to be near the specialized skills – healers, farmers, house builders, etc. Easier to get to work or play by way of well-established roads. Cities are fundamentally an economic bargain and you should be better off living in a city in terms of time and money spent than you would be elsewhere.\n#3. Climate Change: Life or Death\nFloods in China and Germany, wildfires, drought and heatwaves throughout the American mountain west. While I can remember a time when doubt about the perils of climate change was boasted with pride – not too long ago unfortunately – the evidence that the climate is changing and we are the cause only continues to climb with a increasing financial and human cost(Coninck 2018). But where do cities come into play?\nSPM.1: Figure 1 of the Summary for Policymakers of the IPCC’s Special Report on Global Warming of 1.5°C.Of the five biggest sources of greenhouse gas (GHG) emissions at least three can be reduced by improving urban spaces. I’ll give a brief example for each.\nElectricity:\nA typical suburban home has, on average, 9 rooms to light, heat and cool everyday. In contrast, an old school row home will typically have 4-5 rooms, and a proportionately smaller electric GHG footprint as a result.\n\nTransportation:\nLiving closer to other people should mean you don’t have to drive as far to work, or that there’s easier options through biking and/or public transit instead.\n\nManufacturing:\nIf you’re living in a smaller space, you don’t need or want as much stuff. Far more importantly, you also don’t need to build as many roads, pipes, or other infrastructure because you’re getting more use out of the infrastructure you have in place.\n\nThe Reality\nIt’s easy to see in the U.S., whether through suburban sprawl, traffic jammed highways, increasing cost of living or crime and safety issues, our cities fail to live up to the full promise that urban spaces ought to offer. Identifying the nature of these failings explicitly, as well as the solutions that may address them, will form much of the substance of this blog.\n\n\n\nConinck, Heleen C de. 2018. “IPCC Sr15: Summary for Policymakers.” In IPCC Special Report Global Warming of 1.5 c. Intergovernmental Panel on Climate Change.\n\n\nurban spaces is a term I will use interchangeably with cities to refer to any space in which humans live within close proximity to one another. It is not intended to be used with great precision here.↩︎\n",
    "preview": "posts/motivation/spm1.png",
    "last_modified": "2021-08-20T08:55:21-04:00",
    "input_file": {}
  }
]
