[
  {
    "path": "posts/2021-08-07-the-death-and-life-of-great-cities/",
    "title": "The Death and Life of Great American Cities",
    "description": "A review and commentary on Jane Jacob's seminal work",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2023-10-22",
    "categories": [
      "Book Review"
    ],
    "contents": "\nYet Another Book Review\nThis review comes on the heels of a book club I recently hosted discussing Jane\nJacobs’ seminal work,\n“The Death and Life of Great American Cities”,\npublished in 1961. While it’s been over 60 years since Jacobs’ published this\nbook, the themes it discusses are as relevant as ever.\nJacobs was a writer and editor for the\nThe Architectural Forum. While not\nformally trained, she was able to learn about architectural design,\nzoning codes, and city governance living with her son and architect\nhusband in West Manhattan’s Greenwich Village. She also gained “hands on”\nexperience with city advocacy in advocating principles she saw as at risk\namidst the wave federal infrastructure spending that transpired following\nthe end of World War II.\n\n\n\nFigure 1: Greenwich Village By Felix Stahlberg, CC BY 2.0, Figure from wikimedia\n\n\n\nAltogether, these experiences gave Jacobs expert insight into both the\naesthetic and functional design choices that make a city beautiful and\nfunctional as well as those that can lead to its ruin. In this book, she\nargues for what she thinks makes for a city’s success or failure across several\ndimensions. To focus my review of “Death and Life”, I’ll limit my comments to\nthe following:\nThe historical context in which Jacobs is writing.\nDiversity of uses and Jacobs’ four conditions for successful cities.\nJacobs’ focus on cities as an environment for children and families.\nCar Infrastructure and its damages to the urban environment.\nGovernment Planning Districts - how to best manage and govern city functions.\nThe kind of problem a city is - how to study cities.\nFinally I want to mention that one of my favorite YouTube channels, City Beautiful,\nrecently published a\nvideo\non the historic conflict between Jacobs and the city planner, Robert Moses.\nI strongly encourage you check it out!\nHistorical Context\n\n\n\nFigure 2: Downtown Pittsburgh 1954 Before Federal Highway Construction and Urban renewal. Figure from iqc\n\n\n\nLet’s first set the stage of what the United States looked like in the time\nleading up to and following Jacobs’ publication of her book in 1961. Following\nthe Great Depression in the 1930’s, the Federal Government made various efforts\nto stimulate the economy and provide more housing: The National Housing Act of 1934,\nHousing Act of 1937 and the\nFederal Housing Act of 1949,\nto name a few.\nIn the 1950’s the United States continued to expand federal investment in\nnew ways. In 1956, Dwight Eisenhower signed the\nFederal Aid Highway Act,\nwhich created the interstate highway system and triggered an immense\nreshaping of the American landscape. A few short years after Jacobs would\npublish her book, Lyndon Johnson would help create the\nDepartment of Housing\nand Urban Development in 1965 to further institutionalize federal investment in\npublic housing projects. All of this new infrastructure and policy – whether it\nbe rules set to procure a mortgage by\nFannie Mae through the\nFederal Housing Administration\nor highway construction splitting cities – collide with the\nsocial issues of the time. Jacobs’ was no stranger to the forces of systemic\nracism and segregation that plagued mid-century America and she places her\ncity and general “good city principles” front-and-center in the fight against\nthese societal evils.\n\n“Sidewalk public contact and sidewalk public safety, taken together, bear directly on our country’s most serious social problem - segregation and racial discrimination.”\n\nMuch of Jacobs’ book is written to push back at the city administrators and\nplanners who are redesigning the urban environments for more homogenous or\nsegregated populations and uses. One of her more notable\nachievements\nin resisting this tide of redevelopment was saving Greenwich Village from\ndestruction for a new highway project by organizing a rigorous protest against\nthe neighborhood’s demolition. Depending on your perspective, the wealth and\nprosperity of Manhattan’s west village is either a glowing testament to her\nwisdom or an ironic criticism of her work. Both perspectives are worth keeping\nin mind as we consider the principles she discusses.\n\n\n\nFigure 3: Downtown Pittsburgh 1954 After Federal Highway Construction and Urban renewal. Figure from iqc.\n\n\n\n\nYou can see more photos of what American cities looked like before and after\nfederal infrastructure at the\nInstitute for Quality Communities site from\nthe University of Oklahoma.\nA City Generates Diversity\nThe foundation of Jacobs’ view on cities is that they enable and generate a\ndiversity of uses. She considers this not only the great strength of a city\nneighborhood but a requirement for it to be considered healthy and successful.\nShe places this first in her conditions for a city district or neighborhood\nmust have in order to be considered healthy and successful and all other\nconditions build off of it:\n\nThe district, and indeed, as many of its internal parts as possible, must serve\nmore than one primary function; preferably more than two.\nMost blocks must be short; that is, streets and opportunities to turn corners\nmust be frequent.\nThe district must mingle buildings that vary in age and condition, including a\ngood proportion of old ones so that they vary in the economic yield they must\nproduce. This mingling must be fairly close-grained.\nThere must be a sufficiently dense concentration of people, for whatever\npurposes they may be there. This includes dense concentrations in the case of\npeople who are there because of residence.\n\nLet’s work through each of these in turn. (1) For Jacobs, a city neighborhood\nmust provide a variety of shops, businesses, residences and/or amenities –\ncollectively known as “uses” – and consequently a variety of buildings\nand people that use them. (2) Short blocks make the neighborhood more successful\nin that it allows residents and visitors to reach their destination more quickly\nby minimizing the amount of long blocks they must walk. Short blocks also enable\nmore diversity by increasing the “surface area” or retail floor space available\nto businesses to rent. (3) A variety of building ages allows for businesses and\nindividuals of varying economic means to coexist, as older buildings are\ntypically cheaper to rent than newer buildings, another important dimension of\ndiversity Jacobs is looking to promote. Finally, (4) dense concentrations of\npeople are required both to support the district “uses” as customers and\npossibly as residents.\nJacobs’ reasons for requiring these conditions for diversity extend even\nfurther. Economically, of course, (1) and (4) mean more individuals are in the\ndistrict to visit and patron the shops, museums or other “uses” there at\ndifferent times of day for different reasons. In her mind, this is the “life”\nof the city. There are less obvious economic benefits as well. Ample housing –\nrelated to (3) – allows individuals to live close to their work and to\nthe shops where they need to go to get items for daily living. In terms of\nsecurity, Jacobs argues that the resulting greater number of individuals, (4)\n– there at different times of day due to the diversity of shops – means that\nmany “eyes on the street” will frustrate anyone intent on committing misdeeds.\n\nLong time readers familiar with my previous\npost\nevaluating the vacant lot interventions in Philadelphia will remember this\nargument.\nFinally, though there are certainly other benefits as well, Jacobs argues that\na diversity of uses, which then draws a diversity of patrons, will also result\nin a diversity of contact between individuals living or visiting the\nneighborhood. It is this diversity of contact that she cites as a necessary,\nthough certainly not sufficient, condition for overcoming racism and the ugly\nwounds of segregation. This topic arises predominantly in her discussion on\ncities as an environment for children and families more generally.\n\n\n\nFigure 4: Consider the contrast between Jacobs diverse cities and the homogenous suburbs which became popular in post WWII America. Image is titled ‘Chicago suburbs from the air’ by Scorpions and Centaurs, CC BY-NC-SA 2.0.\n\n\n\nCities as an Environment for Families and Children\nJacobs adamantly argues that while streets and sidewalks are an important means\nfor pedestrians to make their way through a city, they are important for reasons\nbeyond this as well. She sees them as one of the fundamental tools in\nproviding the safety and security that is key to any city neighborhood’s\nsuccess.\n\n\n\nFigure 5: photo from NYC’s Street Lab PLAY NYC program\n\n\n\nJacobs highlights the ability of a good sidewalk - sidewalks that are wide,\nwell maintained and consequently, more likely to be well used - to serve as an\neffective place for children to play. While I suspect this claim would raise a\nfew eyebrows in the US where most families are accustomed to having their\nchildren play in their front or back yards, this certainly makes sense from\nthe perspective of a city-dweller without that luxury. Jacobs states that\nhaving her young son play on the sidewalk never caused her alarm as she and\nthe many members of her local neighborhood were always close by to ensure he\nwas kept out of harms way.\nIts worth elaborating on this last point for a moment. Most parents know the\nold adage “it takes a village to raise a child” and will agree that neighbors\nand other community members play an important part in looking out for\nmore vulnerable community members. What may be overlooked, when considering\nhow this principle manifests, is just how many community members are at work in\nprotecting the public space.\n\n“The strangers on Hudson street, the allies whose eyes help us natives keep the peace of the street, are so many that they always seem to be different people from one day to the next. That does not matter…When Jimmy Rogan fell through a plate-glass window (he was separating some scuffling friends) and almost lost his arm, a stranger in an Old T-Shirt emerged from the Ideal [a local] bar, swiftly applied an expert tourniquet and, according to the hospital staff, saved Jimmy’s life… The hospital was called in this way: a woman sitting on the steps next to the accident ran over to the bus stop, wordlessly snatched the dime from a stranger who was waiting with his fifteen cent fare ready and raced into the Ideal’s phone booth. The stranger raced after her to offer the nickel too.”\n\nNo less than three strangers and one local neighborhood business served\na critical role in this local neighborhood boy’s life. It sounds as though\nmost did not know this boy, or at least not on a first name basis. All of this\nhappens among the larger scene playing out day-to-day of city life in this\nneighborhood, bringing strangers into contact with other strangers through the\nshared public space of city life:\n\n“The stretch of Hudson Street where I live is each day the scene of an intricate sidewalk ballet. I make my own first entrance into it a little after eight when I put out my garbage can…\n\n\nMr Halpert unlocking the laundry’s handcart from its mooring to a cellar door, Joe Cornacchia’s son-in-law stacking out the empty crates from the delicatessen, the barber bringing out his sidewalk folding chair, Mr. Goldstein arranging the coils of wire which proclaim the hardware store is open, the wife of the tenement’s superintendent depositing her chunky three-year-old with a toy mandolin on the stoop, the vantage point from which he is learning English his mother cannot speak. Now the primary children, heading for St. Luke’s, dribble through the south; the children from St. Veronica’s cross, heading to the west, and the children from P.S 41, heading toward the east. Two new entrances are made from the wings: well-dressed and even elegant women and men with briefcases emerge from doorways and side streets. Most of these are heading for the bus and subways, but some hover on the curbs, stopping taxis which have miraculously appeared at the right moment, for the taxis are part of a wider morning ritual: having dropped passengers from midtown in the downtown financial district, they are now bringing downtowners up to midtown. Simultaneously, numbers of women in house dresses have emerged and as they crisscross with one another they pause for quick conversations that sound with laughter or joint indignation, never, it seems, anything in between. It is time for me to hurry to work too, and I exchange my ritual farewell with Mr. Lofaro, the short, thick bodied, white-aproned fruit man who stands outside his doorway a little up the street, his arms folded, his feet planted, looking solid as the earth itself. We nod; we each glance quickly up and down the street, then look back at each other and smile. We have done this many a morning for more than ten years, and we both know what it means: all is well.”\n\nIt is this community that Jacobs sought to protect from destruction by\nhighway construction, road widening and urban renewal and it is the same life\nshe seeks to foster in places where it has not yet taken root.\nThe Difficulty of Car Infrastructure\n\n“Today, everyone who values cities is disturbed by automobiles.”\n\nOne of the more destructive forces Jacobs identifies as at-odds with the\nhealthy cultivation of city life that she paints above is that of car\ninfrastructure and its infectious spread.\n\n“Traffic arteries, along with parking lots, gas stations and drive-ins, are powerful and insistent instruments of city destruction. To accommodate them, city streets are broken down into loose sprawls, incoherent and vacuous for anyone afoot… City character is blurred until every place becomes more like every other place.”\n\nSomething I greatly appreciate about Jacobs is that while recognizing all this\ndamage that automobile infrastructure causes, immediately after she lists these\ndamages she also recognizes that “We blame automobiles for too much.” This\nnuance is important. As she states, there were traffic jams and poor\nassimilation of horses into city streets, too, and it would seem our\nlarger problem is simply not recognizing how to use the tools we have available\nto us most effectively,\n\n“We went awry by replacing, in effect, each horse on the crowded city street with half-a-dozen or so mechanized vehicles, instead of using each mechanized vehicle to replace half a dozen or so horses. The mechanical vehicles in their overabundance, work slothfully and idle much.\n\nI think recognizing this balance is huge. Indeed, Jacobs goes on to recognize\nthat trucks have fulfilled the promise that should be hoped for from mechanical\nvehicles; it isn’t easy to imagine how we could transport bulky or heavy items\naround a city without such tools. Yet because of the prevalence of private\npassenger vehicles, the efficacy of trucks or buses is not what it could be.\nIt is this unfortunate choice to prioritize infrastructure building for\nautomobiles at the scale of individual use that has led to incredible\ninefficiencies, waste and expense. As Jacobs writes in her book on the planning\nof Fort Worth, TX (emphasis below is mine):\n\n“Erosion of cities by automobiles is thus an example of what’s known as ‘positive feedback’… something like the grip of a habit-forming addiction.\n\n\nA striking statement of the positive-feedback loop was worked out by Victor Gruen in 1955 in connection with his Fort Worth Plan. Gruen, in order to understand the size of problem he had in hand, began by calculating the potential business that For Worth’s currently underdeveloped and stagnating–but traffic-jammed–downtown ought to be doing by 1970, based on its projected population and trading area. He then translated this quantity of economic activity into numbers of users, including workers, shoppers and visitors for other purposes. Then using the ratio of vehicles per downtown users current in Fort Worth, he translated the putative future users into numbers of vehicles. He then calculated how much street space would be required to accommodate the numbers of these vehicles apt to be on the streets at any one time.\n\n\nHe got an outlandish figure of … sixteen million square feet, not including parking. This in comparison with the five million square feet of roadbed the underdeveloped downtown now possesses.\n\n\nBut the instant Gruen had calculated his sixteen million square feet, the figure was already out of date and much too small. To obtain that much roadbed space, the downtown would have to spread out physically to an enormous extent. A given quantity of economic uses would thereby be spread relatively thin. To use its different elements, people would have to depend much less on walking and much more on driving. This would further increase the need for still more street space or else there would be terrible congestion. Differing uses, necessarily strung out in such relatively loose fashion would be so far from one another that it would become necessary to duplicate parking spaces themselves, because uses bringing people at different hours would not be sufficiently compact for much staggered use of the same accommodations. This would mean spreading the downtown even thinner, in turn requiring still more use of cars, traveling greater absolute distances internally.”\n\n\n\n\nFigure 6: Katy Texas Highway From Aliciak3yz, CC BY-SA 4.0 https://creativecommons.org/licenses/by-sa/4.0, via Wikimedia Commons\n\n\n\nAs Jacobs identifies, this is not only concerning from the more\nemotional perspective of seeing a place with a sense of community destroyed by\nasphalt and cars, it is not economically sustainable. She quotes\nHarrison Salisbury here:\n\n“The drawback is that as more and more space is allotted to the automobile, the goose that lays the golden egg is strangled. Enormous areas go from the tax rolls and are rendered unsuitable for productive economic purposes. The community’s ability to foot the multiplying costs of freeway dwindles.”\n\nAt this point, more than 60 years after Jacobs published this book, it is\namazing to see the clairvoyance with which Jacobs wrote this chapter, as we\nhave more than ample evidence to see everything she’s written, and more, come\ntrue. Whether its the thousands of lives\nlost each year to traffic related incidents, the added housing cost from\nparking mandates,\nincreased maintenance\ncosts associated with ever widening roadways – that\ndon’t solve traffic congestion – the enormous health and environmental costs\nassociated with car use, or the decline in\nsocial capital, we now know, in somber and disturbing\ndetail, the disastrous design choice that has been made by making the private\nautomobile the primary means of transportation in the United States.\nUnfortunately, Jacobs has no magic solution to this problem any more than we do at present day. She describes the problem like so:\n\n“Yet although erosion [the process of car infrastructure destroying good city infrastructure] solves nothing, and creates great inefficiency, there is never a good or obvious point at which to swear off; for as the process proceeds, from its small and apparently innocuous beginnings, it becomes harder to halt or reverse it and seemingly, at least, more impractical to do so.”\n\nThis is uncomfortably true. While city mayors have made\ngreat progress in\nrecent years in dedicating more infrastructure to alternative modes of\ntransit—and there is now a\nwave\nof cities taking steps to make it easier to build housing by, for example,\nremoving or reducing parking mandates—there is no question that we are still\nincalculably far from achieving the kind of healthy relationship with automobiles\nthat Jacobs imagines in this chapter.\nCity Administration\nOne of the more important but, I would guess, more overlooked chapters in\n“The Death and Life” deals with the day-to-day details of governing a city.\nBoth the organizational structure as well as the operational details. Jacobs\nopens this chapter with the following sentiment:\n\n“A public hearing in a big city is apt to be a curious affair, simultaneously discouraging and heartening.”\n\nSpeaking as someone who has attended several public hearings, city meetings or\nother similar forums, I heartily agree. The relationship between city residents\nand the officials that represent them is very important but also very difficult\nto manage. There are many well-intentioned city officials who are doing their\nbest but city residents are often frustrated with the lack of insight they may\nhave into the specific problems they see as most important to their\nneighborhood. This is further hampered by difficulty in information-sharing\nbetween the city residents and officials. Jacobs focuses on this problem\nspecifically in regards to the structure of city administration itself.\nSpecifically, Jacobs takes issue with the fact that city administration is\narranged vertically – the parks department handles parks, housing authorities\nhave separate responsibilities for housing, etc. There is horizontal structure,\ntoo—there are different city precincts for which different government entities\n(typically police or ambulance units) will take responsibility.\nJacobs argues in her book for more horizontal level administration, so that a\nneighborhood-focused government is the fundamental unit of government\nadministration. Her aim in this is to ensure that the government is always\nmost responsive to the individuals who live in the city itself. To be sure,\nthis still requires a department that specializes in parks, planning, etc.,\nbut the focus of that department’s administration would arise from\nneighborhood-specific needs.\nJacobs spends some time talking about the importance in defining the right size\nof the neighborhood or district that would be administered. It has to be big\nenough to ensure it is worth administering, and to have enough clout to gain\nattention politically but not so big that it would be difficult to attend to\nneighborhood requests.\nIt is worth taking a moment to reflect on the fact that Jacobs discusses\norg structure in a book about cities, and that her devotion to making cities\nbetter requires this level of detail and change – an impressive commitment.\nWhile I can’t speak with any authority on varying types of city government\nadministration structure, her intuition here that the city should be highly\nfocused on its residents – and her pragmatic concerns regarding politics –\nresonates strongly with me. I don’t see how a city can improve if it does not\ntake the most widely shared concerns of its residents seriously.\n\n\n\nFigure 7: Org Chart of NYC government. Taken from NYC government site.\n\n\n\nThe Kind of Problem a City is\nThe last subject that Jacobs turns her attention to in this book is that of how to study and learn about cities. I remember discussing this topic with one of the book club members who was very frustrated with the fact that Jacobs wasn’t taking a very scientific approach. Interestingly, in the very last chapter of “Death and Life…” Jacobs explains why this is so, giving a very brief history of scientific progress discussing the complexity of the systems that science could explain, citing a report by Dr. Warren Weaver. I’ll provide a few excerpts here so you get the idea.\n\n“Dr. Weaver lists three stages of development in the history of scientific thought: (1) ability to deal with problems of simplicity; (2) ability to deal with problems of disorganized complexity; and (3) ability to deal with problems of organized complexity. Problems of simplicity are problems that contain two factors which are directly related to each other in their behavior – two variables – and these problems of simplicity … were the first kinds of problems that science learned to attack…\n\n\nConsider first a simple illustration in order to get the flavor of the idea. The classical dynamics of the nineteenth century was well suited for analyzing and predicting the motion of a single ivory ball as it moves about on a billiard table…One can but with a surprising increase in difficulty, analyze the motion of two or even three balls on a billiard table…. But as soon as one tries to analyze the motion of ten or fifteen balls on the table at once, as in pool, the problem becomes unmanageable.\n\n\nImagine however a large billiard table with millions of balls flying about on its surface…The great surprise is that the problem now becomes easier: the methods of statistical mechanics are now applicable. One cannot trace the detailed history of one special ball, to be sure; there can be answered with useful precision such important questions as: On the average how many balls per second hit a given stretch of rail? On the average how far does a ball move before it is hit by some other ball?…\n\n\nOne is tempted to oversimplify and say that scientific methodology went from one extreme to the other…and left untouched a great middle region. The importance of this middle region, moreover, does not depend primarily on the fact that the number of variables involved is moderate…Much more important than the mere number of variables is the fact that these variables are all interrelated. These problems… show the essential feature of organization. We will therefore refer to this group of problems as those of organized complexity.\n”\n\nJacobs’ point in all of this is that “The kind of problem cities are” is one of\norganized complexity: many interrelated variables that all change with one\nanother. She blames the kind of “low dimensional” –2-3 variables– thinking for\nthe approach that most planners take to solving city problems, and she’s not\nwrong. It’s now increasingly obvious that the traditional approach to, for\nexample, road and street planning, originated from this thinking with\ndisturbing results. If there is high traffic on a street, a traffic engineer\nwould take that as a sign that the street needs to be widened, to give more\nspace to automobiles so that the amount of traffic could be lowered. This two\ndimensional problem - city space and traffic - ignores the system level\nphenomenon known as\n“induced demand”, which means that\nthe traffic problem is\nnot solved at all.\nThis has led to increased road\nwidening, requiring billions of dollars in construction fees and little-to-no\nimprovement in improving traffic.\nI’m very sympathetic to the arguments Jacobs is making in this chapter, though\nI’m afraid we’ve not made as much progress in our scientific efforts to\nunderstand “organized complexity.” I’ve already\ndiscussed some of the principles involved in why studying cities is so difficult. After reading this book again,\nI’m thinking of how to best make rigorous scientific arguments about how a city\n“should be,” how to construct a rigorous defense of a position for some\nproposed configuration of city streets that takes into account its\nrelationship with the rest of the city, the politics of the time,\nanticipated growth, normative goals and so on.\n\n\n\nFigure 8: Graphic from the open source A/B Street project, which tries to find ways to improve traffic flow. This is a difficult problem space and one that isn’t easily solved.\n\n\n\n\nSee (Nagel, Beckman, and Barrett 1999) for one example of how modeling efforts still fail\nto generate insights for understanding traffic.\nA/B Street tries to provide\na similar project for the city of Seattle.\nIt is no trivial thing. If Jacobs’ work reminds us of anything though, it\nis of the first principles driving the normative goals – safe streets, diverse\nuses, efficiency in economy, etc. Any progress made in the space of furthering\ncities will have to hold these to heart in whatever direction their aims take\nthem.\nFinal Lessons\nWhen finishing this book, I tried to imagine what a modern day\n“Death and Life of Great American Cities” book would contain that would have\nmore to say on the progress we’ve made on adhering to or developing the\nprinciples laid out by Jacobs. A few books came to mind (\n1, 2,\n3,\n4,\n5) but\nnone of which had the same level of personal attachment that Jacobs has.\nI think that personal attachment is important. Cities have become a subject of\nprofessional study, but they’re important because they are where we live out\nthe majority of our lives. Jacobs’ book stands out all these years for many\nreasons, but the reason it sticks out to me most as I thought of where cities\nare right now and where they still need to go, is because of Jacobs’ personal\nperspective: a mom raising her family and defending her city, her home.\nAcknowledgements\nThanks to Paul Haluszczak for\nreading and offering comments on this post.\n\n\n\nNagel, Kai, Richard J Beckman, and Christopher L Barrett. 1999. “TRANSIMS for Urban Planning.” In 6th International Conference on Computers in Urban Planning and Urban Management, Venice, Italy. Citeseer.\n\n\n\n\n",
    "preview": "posts/2021-08-07-the-death-and-life-of-great-cities/Greenwich_Village.jpg",
    "last_modified": "2023-10-22T10:14:08-04:00",
    "input_file": "the-death-and-life-of-great-cities.knit.md"
  },
  {
    "path": "posts/2023-07-15-betterwaytozonereview/",
    "title": "A Better Way To Zone",
    "description": "One zone for this, one zone for that",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.com/"
      }
    ],
    "date": "2023-07-28",
    "categories": [
      "Book Review",
      "Zoning"
    ],
    "contents": "\n\n“This was the backbone of zoning: a division of the city into use zones and boxes into which buildings had to fit in order to avoid crowding their neighbors; to avoid creating public health, safety, or fire hazards; and to prevent land use combinations likely to create nuisances in the future.” (p.3 “A Better Way to Zone”)\n\nA Book Review\nI’ve decided to take a break from the usual statistics papers that I discuss on\nthis blog to provide a brief review of a book I\nrecently finished, “A Better Way to Zone: Ten Principles to Create More\nLivable Cities” by Donald Elliot. While zoning is not the sexiest of topics,\nthe influence zoning has on our built environment cannot be overstated. Indeed,\nmany of the serious societal problems we’re facing in the US today, from\nhomelessness and housing prices to our dependence on cars, can find some major\nroot in the local zoning code.\nWhile I’ve been fascinated with and studied the built environment for years,\nthis was my first major foray into a text that explicitly touched the zoning\ncode. As such, I can’t comment on how effectively Elliot offers his readers an\naccurate picture of the zoning landscape, but I can say that my general\nimpression of Elliot’s expertise and his writing was very positive. I came away\nfeeling much more educated about the history of zoning in the US that led to our\ncurrent problems.\nI can’t hope to cover everything Elliot does in his book, but I’m hoping to\nprovide a brief overview of what zoning is and why it matters, a few key\nprinciples Elliot prescribes for better zoning, as well as touch on why I\nfind this topic so exciting. You can also take a look at my\nnotes, for those interested in reading more.\n\n\n\nFigure 1: Zoning Map of Pittsburgh. Each color corresponds to a different zoning district. Data From wprdc.org\n\n\n\nZoning: What it is and What it isn’t\nThe logic behind zoning as a legal construct is the same as that quoted at the\nstart - place residences and/or businesses sufficiently apart from one another\nto prevent health and safety issues. Intuitively, this idea makes perfect sense.\nNobody wants to live near a factory billowing smoke, so carving out space on a\ncity map with one section for houses to be built, another for shops, and still\nanother for factories seems reasonable.\nThe first zoning law\nthat put these principles into practice in the US was\nwritten in New York and strongly influenced by the tenement acts, which\nestablished standards for room sizes, sanitation, and ventilation. A natural\nnext step from deciding people should have enough room within a building is\nto decide they should also have enough room between buildings, especially\ndifferent types of buildings.\nAnd so, zoning made distinctions between spaces for industrial buildings,\nlike factories, and residential or commercial buildings, like houses\nand shops. This kind of zoning is called “Euclidean Zoning,” named after a\ncourt case\nin Euclid, Ohio. Each zone that’s carved out for a specific use is\ncalled a zoning district. However, the notion of a zoning district quickly\nbecame abused. Categories started to proliferate faster than sensible rules\ncould restrain them:\n\n“[A] veterinarian wants to open up a clinic in a small-scale neighborhood\nbusiness zone but that is not a permitted use. The question has not come up\nbefore, and the city decides that it did not really intend to keep veterinarians\nout of neighborhood commercial areas. They are, after all, a neighborhood\nservice. The city proposes an amendment to add “veterinarian” as a permitted\nuse. The neighbors object and will support the zoning text change only if it is\nlimited to a 5,000 square-foot facility. “Done” says the city. Now the\nordinance has “veterinarian” and “veterinarian, under 5,000 sq. ft” in the\nlist of permitted uses. But the following year, when the scenario plays out\nagain across town, a different set of neighbors insists that there not be any\nanimals on the premises at night. That eliminates the risk of barking for the\nhouses across the alley. “Done,” says the city. Now we have “veterinarian, under\n5,000 sq. ft. no overnight boarding” in the list. Next, someone wants a\nbig facility and the neighbors are afraid of the noise and smell of the outdoor\ndog run, so “veterinarian, no outdoor enclosures” is added.” (p.44)\n\nObviously this all seems a bit silly, but as Elliot points out, this is not all\nthat hypothetical. City council members have a strong incentive to keep city\nresidents happy, so the urgent need to solve today’s problem often means\noverlooking the problems it will create tomorrow.\nIt is important to note that zoning codes describe a list of permitted uses\ntoday but are not in any way forward-looking. In contrast to this present-minded\nstate, there is also the concept of a “city plan” (or city planning), which\ntakes a forward-looking view to think about how specific areas of the city today\nmight be altered to fit a more unified vision of the city for tomorrow.\nYou’d think zoning and city plans might have a lot of overlap, but they tend to\nbe thought of separately. Elliot attributes this to the two separate and\ndisjointed publications by the Commerce Department, which introduced each of\nthese ideas separately without providing any kind of unifying framework. The\nlack of cohesion can lead to problems. As one might imagine, it would be worth\nhaving the city plan built into the zoning code itself, so that changes to the\nzoning code were consistent with the long term vision of the city. However,\nbecause these two models of what the city should be were historically maintained\nseparately, this did not always come to pass.\n\nThe two publications in question are the Standard Zoning Enabling Act of 1924\nand the Standard City Planning Enabling Act. You can learn more about these\nacts here\nPresent Day Consequences\nMuch of the book is spent exposing the flaws present in the typical kind of\nzoning codes practiced today in an effort to expose a key lesson on how zoning\ncould be improved moving forward. I’ll limit myself to just a few of these\nideas: Transportation Planning and Predictability vs. Flexibility.\nTransportation Planning\nI wanted to make sure to touch on transportation planning, given that it was\nthe subject of previous\nposts\non the blog. Elliot notes that historically,\nzoning didn’t even consider transportation planning as part of their purview.\nA zoning district merely described what was or was not allowed in a certain\nspace of the city. While this might include certain details that implicitly\ntouched on transportation, like a minimum parking requirement, it typically had\nno concern for how many cars could come to or from the site in question.\nThis quickly became a concern, especially in the era of the automobile.\nA new apartment or mixed-use development could include hundreds of apartments\nand several new stores and restaurants leading to potentially hundreds of\nnew cars on nearby roads. Could the street network handle that increased\nvolume? Yes? No? Maybe?\nAs Elliot notes in the book, modeling traffic is not a straightforward exercise\nand, as I’ll invite you to imagine, involves any myriad number of assumptions\nabout which mode of transit different residents or store customers will use,\nhow often they’ll use it, etc.\nStill, as Elliot notes, it is worth considering transportation planning and\nzoning hand-in-hand. It likely does not make sense to zone a parcel of land near\na one lane road for a mixed-use high density development like previously\nmentioned if it is understood that most residents will be car-dependent in the\ncity. Zoning and transportation planning go hand-in-hand and current and future\nplanners and city council members would do well to consider the interplay\nbetween the two.\nPredictability vs. Flexibility\nElliot repeatedly discusses the theme and balance of predictability vs.\nflexibility throughout his book. We’ve already hit on this idea with Elliot’s\nveterinarian example. Euclidean zoning implicitly strives to be predictable\nwithin each zoning district. Setting a zone district on the basis of uses\nsignals to both the developer and the consumer that there will be at least some\nlevel of uniform expectation within that zone - whether it be the type of\nbuilding built there, the setback off the street, or the maximum height of the\nbuilding. You can see this in the\nPittsburgh zoning code for example\n(Figure 2).\n\n\n\nFigure 2: Screenshot of one part ofPittsburgh Zoning code. Sourced from https://pittsburghpa.gov/dcp/zoning.\n\n\n\nIn the above table, each base zoning district – Residential, Mixed Use, etc.\n– has different Residential uses that are “Permitted by Right”, denoted by a P\nin the table, meaning that there are no additional requests that need to be made\nto the zoning board in order to build. Alternatively, some may require an\n“Administrator exception” – meaning that a staff member of the city may have to\nuse their judgment on whether or not the use is permitted, and so on. The\ngeneral theme here being that one can typically expect to see the types of uses\nthat are “Permitted by Right” in their respective zoning districts and so have\nsome measure of what to expect when they invest or purchase a property there.\nStill, the system allows for flexibility in allowing individuals to apply for\nexceptions to the code in order to try to build for uses that would otherwise\nnot be permitted.\nElliot hits on this theme in particular with a particular type of zoning device\ncalled the “Planned Developmental Unit” or PDU. A PDU is like a “custom deal”\nwhereby a developer works with a city to develop a zoning ordinance specifically\nfor the development that they’re planning. This represents the extreme\nside of flexibility and in principle, is intended to let a developer that’s\nlooking to be creative build something that still adds to the city’s urban\nfabric, even if it doesn’t abide by all the zoning ordinances. Elliot notes here\nthat this extra flexibility is great, but should be used sparingly, as it can\neasily overwhelm a, typically, low-staffed city planning department and prevent\ndevelopers from getting permits to build if used as standard practice.\nThere’s much more to say on other zoning and development tools that play a part\nin this balance between Predictability and Flexibility but I’ll finish this\nsection by saying that as a statistician with an interest in the built\nenvironment, learning more about zoning has been a ton of fun to think about,\nespecially as it relates to how one thinks about modeling different aspects of\nthe urban experience\nA Statistician’s Perspective on Zoning\nReading this book opened my eyes to the implicit model that we impose on our\ntowns and cities. Like Elliot points out in his book, its glaringly obvious\nthat we’re often woefully ignorant of the downstream consequences the zoning\nchoices we make have on our health, quality of life, and the economic vitality\nof the city. While research here will always be difficult developing conceptual\nand mathematical models that can motivate smarter and more efficient\ndevelopment patterns will be critical if we’re to rise to the challenge\nElliot’s book asks us to in creating “A Better Way to Zone”.\n\n\n\n",
    "preview": "posts/2023-07-15-betterwaytozonereview/distill-preview.png",
    "last_modified": "2023-07-28T07:34:39-04:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-12-19-propensity-to-cycle/",
    "title": "Propensity to Cycle",
    "description": "How can we plan the move from auto-centric to multi-modal centered transit?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2023-05-06",
    "categories": [
      "Bikes",
      "Technical"
    ],
    "contents": "\nPrevious posts in this series\nlooked at how the transition from cars to a more multi-modal transit system\n– focusing on bikes in particular – has taken off in the modern world.\nMotivated by issues as dramatic as climate change or as common as economics,\ncity governments have increasingly looked to bikes and transit for affordable\nand sustainable ways to facilitate their residents’ movement within and across\ncity boundaries. Yet even in the presence of such great challenges, it’s worth\nmaking well-informed decisions about how to invest in these new transit\nmodalities with the best resources available. In this post we look at one such\nmethod, The Propensity to Cycle Tool, through a\nsubstantive and technical lens (Lovelace et al. 2017).\nAbout the Propensity to Cycle Tool\nIn their October 2014 “Cycling Delivery Plan”, the United Kingdom’s (UK) Department for\nTransport set the goal of doubling the number of cycling trips in the country\nby 2025. Additionally, they made a stretch goal for England and Wales to match\nthe proportion of trips cycled in the Netherlands – over 25%! This foundational\nreimagining of how Brits get from A to B requires a wholesale reimagining of\ntransportation infrastructure. Indeed, the aforementioned plan aspired to\ndouble the funding for walking and cycling infrastructure in an effort to add\nteeth to their goal.\nSeveral strategic problems arise in determining where and how to allocate new\nfunds for the development of new bike infrastructure or promotion and education\nof bike use. Consequently, the Department for Transport allocated funds to\nresearch where and how Brits currently cycle across the island, so that future\ninvestments could take this information into account. In particular, they\nwanted to prioritize those areas where cycling could make the greatest gains in\nthe shortest time. This work, coordinated across several UK universities and the\nDepartment for Transport, culminated in the propensity to cycle tool (PCT).\nThe PCT was first launched in 2015 and is still being developed and used today\nto assist policymakers in their larger goal of facilitating cycling as a means\nof transit.\nDigging into how this tool works and the kinds of questions it strives to answer\ncan give other researchers and transportation workers across the world a chance\nto learn from their insights, improve on their methods and further the global\ncause of making it easier to get from A to B in a safe, efficient,\naffordable and sustainable manner!\nThe Data\nThere are several data sources fueling the PCT with the UK census first and\nforemost among them. The UK census, much like the US census, is conducted on a\nregular basis in order to determine the number of individuals living across the\ncountry so that government resources can be proportionally allocated. The PCT\nuses two particular questions asked on the 2011 UK census to determine where\nand by what mode of travel respondents traveled to their place of work:\n\n“In your main job, what is the address of your workplace?” (question 40)\n\nand\n\n“How do you usually travel to work? (Tick one box only, for the longest part, by distance, of your usual journey to work)” (question 41).\n\nThe answers to these questions allowed the researchers to estimate the likely\nroutes respondents would take to work and the corresponding hilliness and\ndistance of the route. Additional answers with information for other\ncharacteristics – e.g. sex – allowed the authors to better estimate how and\nwhere UK citizens might cycle to work varies across other dimensions.\nAdditional data was calculated using the routing algorithms provided by\ncyclestreets.net, which provides estimates of\n“fast” and “quiet” routes between origins and destinations. “Fast” routes refer\nto the most direct routes that might favor less comfortable streets for cycling\nlike major roadways. “Quiet” routes refer to the route that is most comfortable\nwith the lowest amount of car traffic, regardless of distance. Using this route\ndata also allowed the authors to calculate “hilliness” or elevation gradients\nfor specific routes and their distance.\n\nIf you’d like to see the other modes of transport listed in the census,\ncheck out this\narticle.\nPropensity to Cycle\nWhere and How Many?\nThe researchers look at the propensity to cycle in a number of ways. To begin\nwith, they use the raw counts and residential locations of the UK citizens\nto determine how many individuals cycle in a given Metropolitan Super Output\nArea (MSOA) – a geographic census designation analogous to a census block in\nthe US. This spatial aggregation allows policy makers to look across the UK or\nmore specific zones of interest and understand how many individuals are using\ntheir bikes to get to work. A spatial visualization of these\naggregations is the first thing visitors see on the\npct.bike website (Figure 1).\n\n\n\nFigure 1: Example Visualization from PCT website\n\n\n\nThe researchers next identify the conditions under which a UK citizen is more\nor less likely to cycle a given “trip” as a function of their sex, trip distance\nand trip “hilliness” or gradient.\nWhy and How?\nThe authors propose a series of models for estimating the propensity to cycle,\n\\(\\pi\\), as a function of route distance, \\(d\\), and\ngradient, \\(g\\), across various\nscenarios. These all start with the following form:\n\\[\n\\text{logit}(\\pi) = \\alpha + f(d) + h(g).\n\\]\nThe logistic regression\noutlined above allows the authors to identify to what\nextent distance and hilliness plays a role in determining whether an individual\ndecides to cycle to work or not. You can see the estimates of these functions\ntaken from the appendix of their paper in Figure 2.\n\n\n\nFigure 2: Probability of cycling as function of trip distance/gradient. Figure from (Lovelace et al. 2017)\n\n\n\nThese figures look much as one might expect. As the commute distance increases\nand/or the hilliness of the area increases, a UK citizen is less likely to bike\nto work at a quadratic rate. Estimating these distances is important because\nit can influence zoning, land use decisions and, of course, investment decisions\nin cycling infrastructure. For example, by understanding the distances to nearby\ncommercial centers, planners can ensure that residential areas are located at\ndistances that are optimal for bike use. This kind of modeling also serves as a\nstarting point for considering several scenarios under which the propensity to\ncycle might likely be observed to increase.\nScenarios\nThe PCT explicitly considers four separate scenarios in the tool’s initial\nversion:\nGovernment Target: cycling use doubles overall.\nGender Equality: cycling use is equivalent between men and women.\n“Go Dutch”: Cycling use is equivalent to the rates of cycle use in the Netherlands\nE-bikes: Cycling use is equivalent to that found in Switzerland and the Netherlands amongst e-bike users.\nEach of these try to provide some sense of how infrastructure might be\ndifferently used if cycling rates were different. For example, in their\ncase study examining cycling propensity in West Sussex, Professor Rachel Aldred looked at\nwhere the greatest potential for cycling infrastructure could be found under\nscenario 4 where both (1) the cultural and infrastructure barriers of cycling\nwere removed and (2) e-bikes were adopted in larger numbers. Figure\n3, below shows where the greatest mode shift from driving\nto e-biking would occur in this scenario at the MSOA level.\n\n\n\nFigure 3: Figure 7 from the PCT West Sussex Case Study\n\n\n\nOn a more granular level, using the cyclestreets routing algorithms, the PCT\nallows a street-by-street level analysis of which roadways are most likely to\nsee increased cycling use in these scenarios, providing an explicit target for\nwhere cycling infrastructure should be built. In the West Sussex case study,\nthis included the A259 roadway, also called Bognor Road (See Figure\n4), which\nthe PCT projects a nearly 10 fold increase in usage under the ebike scenario.\nHowever, this is where projections and reality collide. While the estimates may\nshow a ten fold increase, that projection includes certain assumptions about the\ninfrastructure that may not be true. As Aldred states in her report,\n\n“The A259 Bognor Road does already have a cycle path. As with many such paths quality is currently poor: for example, it is narrow (no overtaking, wide cycles, or commuting two abreast), only on one side of the road (crossing over part way along), and has problems at junctions (especially at roundabouts, but cyclists are also required to give way at side roads and lay-bys). While it does not have the capacity to handle the scenario increase in cycling it presents an opportunity to improve an existing facility, rather than build one entirely from scratch.”\n\n\n\n\nFigure 4: Bognor Road; Figure from West Sussex Case Study.\n\n\n\nIn order for Bognor Road to live up to or surpass its potential as projected by\nthe PCT, investments will need to be made to ensure that current roads have the\nappropriate infrastructure in place to support travelers as they shift modes of\ntransit from car to bike.\nStrengths, Limitations, Future Work\nThe PCT stands apart from most statistical tools I’ve worked with or developed.\nI’ve seen apps (examples:\n1,\n2) that take\nthe results of specific datasets, census output, or simulations and highlight\nthe relevant descriptive or inferential information in a flexible and appealing\nway. When the goal is prediction, some visualization of the competing candidate\nmodels’ performance or application of the model is shown in different settings.\nHowever, I’ve never seen a tool that explicitly predicts scenarios like the PCT\ndoes. I think this is both one of its strengths as well as one of its weaknesses.\nThe easy-to-use interface of the PCT makes it fun and easy to look at the\ndescriptive information on how Britons’ currently cycle to and from work.\nHowever, after clicking on the various scenarios and watching the colors of the\nmap dramatically change to reflect the projected up-tick in cycling, I think it\nis much harder to understand why the new numbers are what they are conceptually.\nThe counterfactual they’re trying to provide in these projections may not be the\nmost appropriate and the UI makes it easy to lose track of this amidst the\npretty colors.\nFor example, in the West Sussex case study, the authors use the coefficient\nestimates that describe the Dutch/Swiss e-bike propensity to cycle, applied\nacross the different distance and graident route information in W. Sussex, to\ncome up with the projected new propensity numbers in W. Sussex. These estimates\nare meant to represent the difference between Brits and their Dutch/Swiss\ncounterparts’ likelihood to bike to work as a function of both culture and\ne-bike’s advantages for longer or hillier trips. Here, “culture” is meant to\nrefer to, I think, non-infrastructure elements of Dutch/Swiss culture;\ngenerally speaking, they’re more inclined to think of a bike as an appropriate\nmeans of transport than a Brit. However, I don’t think this comparison strictly\nworks. It seems almost assuredly true that part of the cultural differences\nalso correspond to infrastructure differences that make biking more amenable in\nSwitzerland and the Netherlands than England & Wales.\nThe authors seem aware of this in that their discussion is focused on how to\ninvest in infrastructure so that cycling can gain greater support, but my\nconcern is there may still be relevant differences in even the infrastructure\nchanges proposed and those that are present from the Swiss scenario dataset\nthat can lead to biased estimates. They’re answering the question - “How would\na Swiss or Dutch person with an e-bike cycle on their infrastructure on West\nSussex routes? A better question might be,”How many UK citizens aren’t biking\nor walking on this road for reasons related to (1) biology, (2) social-culture\nor (3) built infrastructure?“. The distinction between the former and latter\nbeing that the latter seeks to adjust more explicitly for the unobserved\ndifferences between the two populations. This difference in what question is\nbeing asked and estimated is sufficiently nuanced that I don’t think users of\nthe PCT are given the time or space to think about these details, when a simple\nclick updates the map and shows a rainbow of new possibilities. See\n(1) in the Appendix for more.\n\nI’m trying to follow the advice of Hernan and Robins (Hernán and Robins 2010)\nhere, in envisioning the conceptual randomized trial we would like to have,\neven if it’s not feasible. It isn’t clear to me there’s a clear conception of\nwhat differences need to be explored here. I hope to dive deeper into the\nquestion and subsequent methodology I hint at here in a subsequent post.\nThis isn’t to say that the PCT project isn’t worthy of effort. My criticism is\nvery technical, intended to be constructive and in the spirit of further\nhighlighting the importance of the larger project the PCT supports and the\ngoals it seeks to further. To be sure, my own proposed question has its own\nchallenges that would likely involve higher costs than the project undertaken\nby the PCT project. Whats more, I’m inspired by the creativity the authors\ndemonstrate in bringing together so many different data sources to help\npolicymakers effectively plan and invest in cycling infrastructure! In\nconsidering the specific advice Professor Aldred gives in suggesting cycling\ninfrastructure improvements to the Bognor Road, I think that much of the\nfundamental advice would be the same, even if the projections were altered to\ntake into account the nuance I describe above. In future blog posts on this\ntopic, I hope to dive deeper into methods one could use to accomplish similar\ngoals, and how they might compare to the great work accomplished by the PCT\ndiscussed here.\nAppendix\n\\[\\begin{equation}\n\\begin{aligned}\n\\text{logit}(\\pi_1) &= f_4(d_{sussex}) + h_4(g_{sussex}) \\\\\n&\\text{vs.}\\\\\n\\text{logit}(\\pi_2) &= f(d) + h(g) + \\psi(\\text{culture}) + \\phi(\\text{biology}) +\n\\zeta(\\text{infra})\n\\end{aligned}\n\\tag{1}\n\\end{equation}\\]\nIn the equation above, \\(f_4(\\cdot), h_4(\\cdot)\\) are meant to refer to the\nfunctional estimates under scenario four, and \\(\\pi_1\\) the probability estimated\nas a result of these functions when applied to distances, \\(d_{sussex}\\), and\ngradients \\(g_{sussex}\\) from West Sussex. In contrast, I’m proposing there\nmay be a different estimate, \\(\\pi_2\\) more closely related to the projected\ncounterfactual of interest that would need to more explicitly account for the\neffects of culture, \\(\\psi(\\text{culture})\\), biology, \\(\\phi(\\text{biology})\\) and\ninfrastructure \\(\\zeta(\\text{infra})\\). I’m posing each of these as conceptual\nfunctions here without any explicit measurement as I acknowledge that measuring\nand modeling these, especially culture, is no small feat.\nAcknowledgements\nThanks to Paul Haluszczak and Robert Svoboda for reading and offering comments on this article.\n\n\n\nHernán, Miguel A, and James M Robins. 2010. “Causal Inference.” CRC Boca Raton, FL.\n\n\nLovelace, Robin, Anna Goodman, Rachel Aldred, Nikolai Berkoff, Ali Abbas, and James Woodcock. 2017. “The Propensity to Cycle Tool: An Open Source Online System for Sustainable Transport Planning.” Journal of Transport and Land Use 10 (1): 505–28.\n\n\n\n\n",
    "preview": "posts/2021-12-19-propensity-to-cycle/pct_viz.png",
    "last_modified": "2023-05-06T07:16:31-04:00",
    "input_file": {},
    "preview_width": 1552,
    "preview_height": 1134
  },
  {
    "path": "posts/2021-12-19-car-free-cities/",
    "title": "Car Free Cities",
    "description": "Can you imagine?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2022-06-12",
    "categories": [
      "Bikes",
      "Big Picture"
    ],
    "contents": "\nIn the previous post we examined\nwhy, fundamentally, bikes and multi-modal transit have several\nadvantages over cars in urban spaces with regards to traffic, economic\ncost, safety and more.\nWith this understanding, we turn our attention to the dramatic\nchanges several cities are making in order to exploit these advantages\nand provide their citizens with all the benefits a less auto-centric\ncity design can offer. We’ll start with the dramatic sweeping changes in\nEurope and work our way to the more moderate progress in the U.S.\nBefore we dive deeper into things, a quick word on references. This\npost draws from material produced by the “City Beautiful” and “Not Just Bikes” youtube\nchannels. I highly encourage you to check out their material as I’ve\nenjoyed learning from it.\nEurope\nOslo, Norway\nIn 2017 city leaders in Oslo, Norway announced they would block off\nlarge swaths of the city to private passenger vehicles(Beautiful 2020). Such demonstrative\nactions are rarely easy, even in a nation as committed to its\nenvironmental character as Norway — the country plans to be carbon\nneutral by 2030. In this case, both members of the public and business\nleaders needed convincing (Wolfe 2018). Thankfully, it would appear\nat least so far that their change of heart has been rewarded — not only\nhas pedestrian traffic increased in the commercial districts but Oslo\nwas also the only major city to report no pedestrian or cycling deaths\nduring 2019 (Peters 2019; Beautiful 2020)1 .\nCurrent research examining how mobility patterns have changed since\nthese measures were put in place show that in some neighborhoods, cars\nare used for only 1/6 trips and that those who do still drive do so\nmainly for job or health related reasons(Nenseth,\nEllis, and Dale 2021)\n\n\n\nFigure 1: Oslo, Norway. Photo by Bahnfrend - Own work, CC\nBY-SA 4.0, https://commons.wikimedia.org/w/index.php?curid=89736202\n\n\n\nWhile Oslo is clearly ahead of the game, other cities in Europe have\nalso made similar efforts: London, Hamburg, Madrid, Milan\nand Paris have each renewed efforts to prioritize cycling and pedestrian\nover cars in city centers (Wolfe 2018; Bikes 2021; Beautiful 2020; Nieuwenhuijsen\nand Khreis 2016). Perhaps, the city most eager to try and\novertake Oslo is Paris, whose city government set the ambitious goal of\nbecoming 100% cyclable by 2026.\nParis, France\nIn 2016, Mayor Anne Hidalgo oversaw the beginnings of a program\ncalled “Paris Respire” or Paris Breathes, which introduced various\nmeasures including banning cars from certain areas of Paris on the first\nSunday of the month and making public transport and city bicycles free\nfor the day. After the Covid 19 pandemic took off, Mayor Hidalgo’s\nadministration expanded bicycle lanes and has since made even further\nplans to reduce the number of parking spaces in the city, even going so\nfar as to revamp the famous Champs-Elysees into a more pedestrian and\ncycle friendly space (Reid 2020; Willsher 2021).\nIf that seems like a lot of change in a short amount of time, you’d\nbe right. Such rapid change is not without growing pains and (Bikes 2021) documents several issues\nwith the transition, ranging from unclear and inconsistent signage, to\ninfrastructure changes that are less than well thought out. It should be\nemphasized, however, that this is undoubtedly the right direction to\nmove a city in. In fact, by moving so quickly, Paris has given other\ncities across the world the opportunity to learn from their mistakes. As\nwe turn our attention to the auto-centric U.S. such lessons will be of\nthe utmost importance, in convincing U.S. drivers to turn off their cars\nand swing their legs over their bike seats or take a walk.\nUSA\nIn the United States, our ability to move towards car-free spaces has\nbeen slower. Where European cities have the advantages of several\ncenturies of infrastructure centered around humans walking to which\nbikes easily adapt, much of the U.S. was built after the advent of the\nautomobile. This led to development patterns that centered around the\nautomobile as the primary mode of transit. Still, there are many cities\nwhere substantial progress has been made investing in cycling\ninfrastructure, weakening the dependency on cars and the need for\ncar-dominant spaces. This progress has accelerated as the Covid-19\npandemic fundamentally alters the American relationship with the work\noffice. While there are many cities doing exciting work, we’ll focus on\ntwo cities: Austin, TX and Pittsburgh PA, who have both been investing\nabove and beyond other US cities.\nAustin, TX\nWhether gaining notoriety as a liberal enclave in a very red state or\ngrowing economically as the city continues to expand its residential\nfootprint, Austin, TX has gained a lot of attention over the past\nseveral years. Publishing several bike plans throughout the past 20\nyears, the city has made a goal of increasing the share of people\nwalking, biking or taking public transit to work to 50% in 2039. Passing\ntwo ballot measures since 2016 has shown Austin is putting its money\nwhere it’s mouth is—building real momentum to make cycling a much safer\nreality (2022).\n\n\n\nFurther progress in the city has arrived thanks to Austin’s frequent\nrepaving schedule, and their response to COVID-19. By repaving their\nroads every ten years, as opposed to every twenty like in many states,\nAustin has been able to bring bike infrastructure to the city faster.\nFurthermore, in response to the pandemic, Austin installed a protected\nintersection on Congress Avenue, one of Austin’s most iconic streets\nthat serves an important role in connecting Austin’s downtown to its\nriver walk and other amenities. Even further progress is hoped for with\na comprehensive plan re-imagining land use in Austin through the CodeNEXT\nplan. However, these ideas are still considered contentious and the plan\nis currently being held up by a lawsuit.\nStill, whether more fundamental change arrives sooner or later,\nAustin has made great strides in providing safer streets for it’s\ncyclists.\nPittsburgh, PA\nTurning our attention north, to the old steel city of Pittsburgh, we\nfind more good news. As one of five cities participating in the “Final\nMile” program (along with Austin), Pittsburgh has committed to investing\n$22 million to support bike investments. The proposed investments aim to\nconstruct 60 miles of new or upgraded bikeways, half of which would be\nprotected – an extremely important feature for attracting current and\nnew bike riders.\n\n\n\nThis investment brings Pittsburgh that much closer to it’s Bike+ goal\nof 123 miles of new on-street bike facilities2 by\n2030 and it’s number one goal of reducing the number of traffic\naccidents and fatalities to zero. While this doesn’t put Pittsburgh at\nthe front of the pack in terms Of new bike infrastructure, it certainly\nhelps the city keep pace as the cycling ridership in the grows\nrapidly.\n\n\n\nFrom Autos to Bikes and\nBeyond\nAs mentioned in (Freemark et al.\n2022), making these investments and transitions from an\nauto-centric infrastructure to a more multi-modal, bike friendly\ninfrastructure is not easy. City governments, citizen advocates and\nnon-profits all have to work together to bring about the kind of change\nthat is needed to make cycling a safer and realistic form of transit\nacross the city. In the next post, we’ll examine research that is trying\nto make this work easier, creating strategies to make it easier to\nidentify how and where to best invest in cycling infrastructure.\nAcknowledgements\nThanks to Paul\nHaluszczak and Robert Svoboda for\nreading and offering comments on this article.\n\n\n\n2022. Benchmarking Bike Networks. The American League of\nBicyclists.\n\n\nBeautiful, City. 2020. “Can We Make Cities Car Free?”\nYoutube. 2020. https://youtu.be/g9-9CxCxrVE.\n\n\nBikes, Not Just. 2021. “How to (Quickly) Build a Cycling City -\nParis.” Youtube. 2021. https://youtu.be/sI-1YNAmWlk.\n\n\nFreemark, Yonah, Yipeng Su, Wilton Oliver, and Olivia Fiol. 2022.\nMaking the Case for Improved Bicycling Infrastructure.\n\n\nNenseth, Vibeke, Ingunn Opheim Ellis, and Trine Dale. 2021. “Daily mobility and car use in the Old Oslo\ndistrict.” Transportokonomisk institutt. https://www.toi.no/publikasjoner/daglig-mobilitet-og-bilbruk-i-bydel-gamle-oslo-article37334-8.html.\n\n\nNieuwenhuijsen, Mark J, and Haneen Khreis. 2016. “Car Free Cities:\nPathway to Healthy Urban Living.” Environment\nInternational 94: 251–62.\n\n\nPeters, Adele. 2019. “What Happened When Oslo Decided to Make Its\nDowntown Basically Car-Free?” Fast Company. Fast\nCompany. https://www.fastcompany.com/90294948/what-happened-when-oslo-decided-to-make-its-downtown-basically-car-free.\n\n\nReid, Carlton. 2020. “Paris to Create 650 Kilometers of\nPost-Lockdown Cycleways.” Forbes. Forbes Magazine. https://www.forbes.com/sites/carltonreid/2020/04/22/paris-to-create-650-kilometers-of-pop-up-corona-cycleways-for-post-lockdown-travel/?sh=5037430454d4.\n\n\nWillsher, Kim. 2021. “Paris Agrees to Turn Champs-Élysées into\n’Extraordinary Garden’.” The Guardian. Guardian News;\nMedia. https://www.theguardian.com/world/2021/jan/10/paris-approves-plan-to-turn-champs-elysees-into-extraordinary-garden-anne-hidalgo.\n\n\nWolfe, Jonathan. 2018. “Oslo Puts up a Stop Sign.” The\nNew York Times. The New York Times. https://www.nytimes.com/2018/12/19/travel/oslo-restricts-cars-in-city-center.html.\n\n\nNote that these sources are reporting\ntime periods prior to the global Covid-19 pandemic.↩︎\nbike facilities is the catch-all term\nthat refers to all infrastructure aimed at making bicycling more\naccessible. See here for\nmore information.↩︎\n",
    "preview": "posts/2021-12-19-car-free-cities/oslo.jpg",
    "last_modified": "2022-06-12T10:36:18-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-09-bikes/",
    "title": "What's the Buzz around Bikes?",
    "description": "*Bring Bring*",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2022-02-20",
    "categories": [
      "Bikes",
      "Big Picture"
    ],
    "contents": "\n\nSimilar to the Cleanup vs. Crime case study, this post is the first\nin a series of several that examine the role of transit in the built\nenvironment and how many cities are transitioning from car-centric\ninfrastructure to a more multi-modal model.\n\nBike lanes, climbing lanes and sharrows,\noh my! The rise of commuting by bike has risen dramatically over the\npast two decades as everything from climate change and traffic jams to\nrising gas prices have sent cities looking for sustainable, efficient\nand cheap ways to let their residents travel (See Figure\n1). In fact, some cities are even trying to go “car\nfree”(Nieuwenhuijsen\nand Khreis 2016) – setting aside entire sections of the city\nwhere only pedestrians and cyclists can travel (exceptions are made for\nsupply, maintenance and emergency service vehicles).\nBut why bikes? They may have been fun to ride around with your\nfriends when you were growing up, but do they really offer a viable\nalternative to the crown jewel of american transit - the automobile?\nThis post will look at how biking, walking and public transit compare to\na car as a primary mode of transportation and highlight the cost, time\nand safety that using each entails.\n\n\n\nFigure 1: Commuting Statistics as shown in the NYC 2018 bike plan.\n\n\n\nEnvironments \\(\\rightarrow\\) Cost Time and Safety\nEveryday people need to go places—work, grocery stores, medical\noffices, and so on. 1 Before someone chooses how to go\nfrom A to B, the environment they live in will play a large role in\ndetermining their choice. How far will they have to travel? What routes\nand modes of transit available? What’s the likelihood of traffic? In\nanswering these questions, some environments will be more amenable to\ncertain types of transit than others.\nThe choices in zoning, street planning and more that define where\nresidents can live, businesses be built and the kinds of routes between\nthem, will lay the foundation for how residents move about their\nenvironments as a function of a trip’s (1) cost, (2) time and (3)\nsafety/comfort (Ben-Akiva et al.\n1985; projects\n2020). This post isn’t discussing land use and zoning\nhowever. As important as those concepts are, we’ll consider them\nseparately. For now, we’ll think of the environment, or trip distance,\nas “fixed”2 and focus only on the relative\nstrengths and weaknesses, as enumerated above, for each mode of transit\nin a typical urban environment.\n\n\n\nCost\nWhat follows may seem like common sense. However, sometimes even\ncommon sense bears repeating. If we were to consider the four modes of\ntransit that are most popular—walking, biking, driving in a personal car\nand taking public transit —we could broadly consider the cost of each to\nbe something like what we see in the table below.\n\n\nMode\n      Cost\n    Walking\nFreeBiking\nCheapPublic Transit\nAffordableDriving\nExpensive\n\nWalking is free of course, a typical commuting bike (not those fancy\ncarbon fiber bikes) costs a few hundred dollars, public transit fares\nare explicitly designed to be affordable, and driving, well, driving\ncosts a bit.\nThe upfront cost is usually in the thousands of (U.S.) dollars for a\nused car, and typically in the tens of thousands for a new car.\nFurthermore, most states in the U.S. will require individuals to\nregularly register their car, as well as have it inspected and insured.\nOn top of that, most car manufacturers recommend car owners\nmaintenance their vehicle twice a year or every 20,000 miles, whichever\ncomes first. The cost of gas, which one might buy more or less of\ndepending on the kind of car they have and how many miles they drive,\ntends to vary substantially depending on what state/country one lives in\nand what global economic forces are in play at the time. We haven’t even\ngotten to depreciation yet and there are still even more costs.\nBy taking up space for parking, dependency on cars can increase the cost\nof housing (Shoup 2021).\nAnd finally, cars’ use of fossil fuels contributes to global warming and\nalso plays a role in air pollution (Johansson et al. 2017).\n\nYou can find out more about cost depreciation associated with car\npurchases in this pbs educational video.\nWith all the money a car requires, it seems an obvious question to\nask why it is the dominant mode of transit in much of the modern world,\nand especially in the U.S.? Well to really do justice to that question\nand answer it in all its worth would take more time than this post can\nafford. We’ll explore some of the advantages a car has even with all its\nexpense in the sections that follow, but with this starting cost, it\nshouldn’t be hard to see why so many cities’ mayors turning to bikes and\nbeing rewarded\nfor doing so.\nTime\nGiven the high cost of car ownership, surely the car owner can rest\neasy knowing they’re opting for a more efficient and safer mode of\ntransit, right? It depends.\nWhile it is undeniably true that the longer the distance, the more\nfavorable the car becomes as a mode of transit (see Figure 2\nfrom (Lovelace et al.\n2017)), this isn’t usually the type of trip most often made\nday-to-day in urban (or even some suburban) environments.\n\n\n\nFigure 2: Figure from (Lovelace et al.\n2017) -see original caption in figure.\n\n\n\nFor trips such as these, car trips will take much longer, because\ntheir drivers will have to wait in traffic and, again, depending on the\nenvironment, look/pay for parking. In contrast, a bike rider will\ntypically not have to wait for any traffic3 and\nalmost never have to pay or wait for parking.\nOne key factor may be confounding our argument here. Cars have to\nwait in traffic because there are so many cars, whereas bikes don’t\nbecause there aren’t a proportional number of cyclists, right? Well,\neven if there were more cyclists, it’s not likely they’d have\nto wait too long in traffic. This is simply because of the efficiency in\nspace that a bike has compared to a vehicle. Where a bike takes up \\(\\approx\\) 5 feet lengthwise, and a\n“human-size” width (maybe a foot or two), a typical sedan will be about\n14 feet long and 5 feet wide4. If we compare area\nfootprints, that implies that a car takes up 7 times more space than a\ncyclist. This huge efficiency will mean a lot more cyclists can be put\non the road than cars and still achieve a level of decent transit\nthroughput.\n\nThis space efficiency carries through to parking as well which is the\nsource of many woes in urban development. These arguments can be defined\nmore precisely using arguments from calculus, considering the Change in\narea used / unit time of cars vs. bikes but I have opted for More,\nhopefully intuitive, arguments here.\n\n\n\nFigure 3: Car-bike size comparison. Photo from http://vk.com/letsbikeit\n\n\n\nSafety\nWhile this is the last topic, it is by far the most important! No one\nwould get in a car if they thought there were good odds of the trip\nending in disaster. And yet, automobile accident fatalities continue to\nnumber in the tens of thousands each year, with countless more causing\ninjury and property damage (“National Highway Traffic\nSafety Administration,” n.d.). Why is this? The simple\n(physics) fact is that cars have a lot of mass and when they hit\nsomething while moving at a decent speed, an appreciable amount of\ndeceleration occurs. Consulting our good old friend, Sir Isaac Newton’s\nsecond law, we can recall that:\n\\[\n\\text{Force} = \\text{Mass} \\times \\text{Acceleration}\n\\]\nLarge mass and large acceleration = large force \\(\\Rightarrow\\) higher probability of\ninjuries, death, and property damage upon collision\nIn contrast, a bike with a human on board has much less mass and\nsince bikes rarely go too fast, even in the age of e-bikes,\nthere’s not as severe a deceleration when hitting a stationary object.\nConsequently, a bike collision, sans car, does not produce as\nmuch force as their automobile counterparts. This isn’t to say that\nthere can’t be meaningful harm as a result of bike accidents, or that,\nin an environment where bikes are a predominant form of transit,\naccidents won’t happen. However, the physics are certainly more\nsupportive of bike transit producing safer trips — fundamentally — in\ncomparison to cars.\nGroceries, weather, and kids\nYes, well bikes may have these advantages but what about when you\nhave to haul a week’s worth of groceries home, take your kids to school,\nor get to work in bad weather? Just as adaptation measures were and are\ntaken to try and improve the feasibility of cars’ weakness — seat belts,\nanti-drunk driving campaigns, and so on — there are equivalent\nadaptation measures that are taken by those committed to commuting by\nbike. Cargo\nbikes, especially their electric variants, are one preferred\nstrategy for hauling goods and/or children to and fro, though there are\nalso some services offering grocery delivery by bike as well. Bad\nweather may be simply overcome by a mixture of proper clothing and\nequipment.\nHowever, bikes are still not and cannot be for everyone. Those who\nare unable to ride bikes, due to a lack of physical capacity for\ninstance, still need a service that can offer them a means of\ntransportation across a city and it is for this population,\nthat cars or preferably public transit should be offered. Yet their\npotential cost and efficiency advantages are such that a greater\ninvestment in bikes and bike infrastructure is well warranted.\nBikes, Buses and Beyond!\nWhile this post likely covers a lot of material that may feel like\ncommon knowledge, I’m hoping to use it as the foundation from which to\ncarry this topic further. What kind of efforts are being taken in the\nU.S. and across the globe as better support for bike, pedestrian and\npublic transit infrastructure? What statistical innovations can we\ndevelop to further these causes? More on these ideas in the posts to\nfollow!\n\n\n\nBen-Akiva, Moshe E, Steven R Lerman, Steven R Lerman, et al. 1985.\nDiscrete Choice Analysis: Theory and Application to Travel\nDemand. Vol. 9. MIT press.\n\n\nJohansson, Christer, Boel Lövenheim, Peter Schantz, Lina Wahlgren, Peter\nAlmström, Anders Markstedt, Magnus Strömgren, Bertil Forsberg, and Johan\nNilsson Sommar. 2017. “Impacts on Air Pollution and Health by\nChanging Commuting from Car to Bicycle.” Science of the Total\nEnvironment 584: 55–63.\n\n\nLovelace, Robin, Anna Goodman, Rachel Aldred, Nikolai Berkoff, Ali\nAbbas, and James Woodcock. 2017. “The Propensity to Cycle Tool: An\nOpen Source Online System for Sustainable Transport Planning.”\nJournal of Transport and Land Use 10 (1): 505–28.\n\n\n“National Highway Traffic Safety Administration.” n.d. https://www.nhtsa.gov/.\n\n\nNieuwenhuijsen, Mark J, and Haneen Khreis. 2016. “Car Free Cities:\nPathway to Healthy Urban Living.” Environment\nInternational 94: 251–62.\n\n\nprojects, Contributors to Wikimedia. 2020. “Fundamentals of\nTransportation.” Wikibooks, Open Books for an Open\nWorld. Wikimedia Foundation, Inc. https://en.wikibooks.org/wiki/Fundamentals_of_Transportation.\n\n\nShoup, Donald C. 2021. The High Cost of Free Parking.\nRoutledge.\n\n\n Okay, maybe not\nas much as they used to.↩︎\na statistical/mathematical term, meaning that we’re not\ninterested in exploring how this variable contributes to the\nrelationship of interest↩︎\nThis may depend on the presence of bike lanes, the bike\nriders comfort with passing cars, etc.↩︎\ntaken from nadaguides.com↩︎\n",
    "preview": "posts/2021-10-09-bikes/bikecommute.png",
    "last_modified": "2022-11-27T19:46:37-05:00",
    "input_file": {},
    "preview_width": 1168,
    "preview_height": 854
  },
  {
    "path": "posts/2021-11-17-an-introduction-to-car-and-besag-york-mollie-models/",
    "title": "From CAR to Besag, York & Mollie Models",
    "description": "Different approaches to modeling spatial areal networks within\nthe conditional autoregressive family and a novel application.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2022-01-16",
    "categories": [
      "Technical",
      "Cleanup vs. Crime"
    ],
    "contents": "\nConditional Auto Regressive or CAR models are one of the foundational tools for modeling areal level data. In this post we’ll examine some of the different variants of this model, the different strengths and weaknesses each possess and discuss how they can be used in modeling built environment data. This post is largely inspired by the case study by Mitzi et al. with less elaboration on technical details and a novel application to street crime data.\nThe first two sections focus on the technical details and history in the literature, while the third focuses on how this method can be applied and hints of how it might be used to inform urban policy making.\nThe CAR model\nThe CAR family accommodates spatial correlation between spatially adjacent observations through the incorporation of a spatial effect \\(b_i\\), whose covariance is a function of the spatial adjacency between observations. Specifically, for an areal observation \\(y_i\\), a linear model with covariate vector \\(\\mathbf{x}_{i}\\) and regression coefficients vector \\(\\mathbf{\\beta}\\), would incorporate CAR effects as follows:\n\nThe reader may recall this model family was first introduced in aprevious post on spatial models.\n\\[\\begin{equation}\n\\begin{aligned}\ny_i &=  \\mathbf{x}^{T}_i\\mathbf{\\beta} + b_i\\\\\n\\mathbf{b} &\\sim MVN(\\mathbf{0},\\Sigma)\\\\\n\\Sigma &= \\tau D(I-\\rho \\mathbf{A}),\n\\end{aligned}\n\\tag{1}\n\\end{equation}\\]\nwhere \\(\\Sigma\\), the covariance matrix for \\(\\mathbf{b}\\) are a function of scale \\(\\tau\\), difference matrix1 \\(D\\), adjacency matrix \\(\\mathbf{A}\\)2, and spatial correlation \\(\\rho\\). When \\(\\rho=1\\) the adjacent observations are understood to be completely correlated and when fixing this parameter as such the model is called the Intrinsic Conditional Autoregressive (ICAR) model.\nThere are various theoretical details that make using CAR and ICAR models problematic. To start, when considering the spatial parameter \\(\\rho\\) unknown, as in the CAR framework, the parameter does not offer an intuitive interpretation; values of \\(\\rho\\) that are not very close to 1 allow for almost no spatial correlation whatsoever and negative spatial correlation usually does not comport with a substantive understanding of the data. As for the ICAR model, by fixing \\(\\rho=1\\), the correlation between observations is understood to be completely driven by spatial association, which can be problematic in situations where there is non-spatial variability, or problems with over-dispersion, as is often in the case with spatial applications modeling counts using, e.g. a Poisson distribution. All of these issues prompted the development of a new approach by Besag, York and Mollie, that strives to take advantage of the inherent intuition behind the ICAR model but also overcome it’s weaknesses. It is to this new framework we now turn our attention, but if the reader is interested in learning more about the details underlying the CAR and ICAR models they should consult chapter 3 of (Banerjee, Carlin, and Gelfand 2003), (Morris et al. 2019) and the latter’s online case study.\nThe Besag York and Mollie Model\nThe original paper by Besag York and Mollie (BYM) proposed a model that incorporated the two sources of variability — site specific and spatial variability — previously addressed with one spatial effect term in ICAR models with two types of random effects: a site specific effect independent of spatial correlation, and a spatial effect complete with an ICAR variance structure (Besag, York, and Mollié 1991). The addition of this extra term caused new issues with identifiability and appropriate placement of priors which prompted further work by (Riebler et al. 2016) and others3 to further improve the parameterization introduced by BYM. By introducing a new constraint, shared scale \\(\\sigma\\) and correlation parameter \\(\\rho\\), their model improved identifiability and facilitated a more intuitive placement of priors on the hyper parameters. Denoting the scaled site-specific effect for the \\(i\\)th location as \\(\\psi_i\\) and the spatial effect as \\(\\phi_i\\) and their original variants as \\(\\psi_i^{*}\\),\\(\\phi_i^{*}\\), the new model specification is as follows:\n\\[\\begin{equation}\n\\begin{aligned}\ny_i &=  \\mathbf{x}_{i}\\mathbf{\\beta} + b_i\\\\\n\\mathbf{b}_i  &= \\psi_i + \\phi_i \\\\\n&= \\sigma(\\sqrt{1-\\rho}\\psi^{*}_i + \\sqrt{\\rho}\\phi_i^{*}) \\\\\n\\psi^{*} &\\sim N(0,\\mathbf{I})\\\\\n\\phi^{*} &\\sim N(0,\\Sigma^{\\star}) \\\\ \n\\Sigma^{\\star} &=  D(I-\\rho \\mathbf{A}).\n\\end{aligned}\n\\tag{2}\n\\end{equation}\\]\nNote that \\(\\Sigma^{\\star}\\) is now scaled and constrained so that \\(V[\\phi] \\approx 1\\). With all this machinery in place, the more application driven reader would be well warranted asking if now, we have a model that offers us a better chance of modeling spatially networked data. The short analysis in the following section aspires to show that we do.\nBYM Application to Crime and other City Street Events\nTurning our attention back to the class of crime data discussed in (Moyer et al. 2019) we look to see how we can improve the methods used in their work to better reflect the level at which more focused policy and community efforts can take effect: city streets.\nThe reader may recall that the authors used two approaches to estimate the effect of cleaned up vacant lots on the rate of violent shootings not involving police officers in Philadelphia. The first used a kernel density estimate of the shootings, while the second used a simple count within a given buffer — 300 and 600 meters — of the vacant lot. In this section I’d like to propose a method that will simplify the effort of “counting” where crimes occur, and enable a more intuitive modeling framework. Note that I do not (yet) involve the estimation of the effect of vacant lots on the incidence of crime, leaving that topic for a future post.\nMapping Crimes to Streets\nThe police reports documenting crime by the Philadelphia Police Department, contain a GPS coordinate as the location of the shooting, a single point in space and time, but individuals belonging to neighborhoods similarly understand the crime — and many other similar city events — to have occurred “on a street.” Thus the idea of mapping crimes from the single point location to the closest street by, e.g. euclidean distance4, and using the street as the spatial index where outcomes are measured follows naturally. This idea is illustrated in Figure 1, where shootings regularly occur on a city street or can be understood as occurring on a city street: if an event occurs inside a store whose address corresponds to a street, we would still colloquially understand the crime to have occurred “on the street,” even though the crime did not occur on the asphalt representing the literal physical street.\n\n\n\n\n\n\nFigure 1: Shootings in the Neighborhood of Upper Kensington during Calendar year 2015. City Street and Crime data are from opendataphilly.org.\n\n\n\nNot only does mapping crimes to streets offer an intuitive understanding for modeling city events, such as the shootings studied in (Moyer et al. 2019), the street network also allows us to borrow information across the different streets by street adjacency to model correlation through using, for example, the BYM parameterization of the ICAR prior. The previous modeling framework employed by (Moyer et al. 2019) used a neighborhood specific effect to try and capture this correlation, but by incorporating spatial structure we should be able to improve upon their efforts to more efficiently and accurately estimating the parameters of interest. Figure 2 gives an illustration of how one might visualize the network determined by city streets.\n\n\n\nFigure 2: Network visualization of the streets in Upper Kensington. Note that this is not the exact manner in which the network information is used in the Besag York and Mollie model, as the streets are in fact considered to be the nodes of the graph and the street intersections the edges, but the plot is illustrative of the general idea.\n\n\n\nZero Inflated Poisson BYM Model\nThe use of the BYM model is particularly important in modeling the count of shootings or other events on a particular street as we will need the extra flexibility provided by the random effect \\(\\psi_i\\), described above, to avoid problems with over-dispersion in modeling the counts as distributed from a poisson distribution. City events like shootings, accidents, etc. will typically by zero-inflated, as they do not — typically — occur at such a high frequency across every single street as to receive daily, monthly or possibly even an annual record. Thus, a zero point mass, or zero-inflated model, is critical to accurately modeling the underlying process from which the data are generated. I’ll present, fit and interpret a simple model to briefly illustrate the idea. Let \\(Y_{itm}\\) be the number of shootings observed at street \\(i\\), during calendar year \\(t\\) and month \\(m\\). Then let \\(\\pi\\) be the probability of an observation being drawn from the zero point mass. Using a similar notation as above for the BYM components, the model is as follows:\n\\[\\begin{equation}\n\\begin{aligned}\nY_{itm} \\sim \\ \\pi\\delta_{0}(\\cdot) +  \n(1-\\pi)\\text{Pois}(\\exp{(\\alpha + \\text{Year}_{t}\\times \\beta_t + \n\\gamma_m + b_i)}),\n\\end{aligned}\n\\tag{3}\n\\end{equation}\\]\nwhere \\(\\delta_{0}(\\cdot)\\) is the dirac delta function at zero, \\(\\alpha\\) is a global intercept, \\(\\beta_t\\) is the difference between year \\(t\\) and the reference year of 2019,\\(\\gamma_m\\) is a month specific effect, and \\(b_i\\) is the composite spatial and street specific effect as described in (2).\nWe can fit this model in the brms package after creating the spatial network and adjacency matrix,A, from functions in the sfnetworks,tidygraph and igraph R packages(van der Meer et al. 2021; Csardi and Nepusz 2006; Pedersen 2020). See the code in the repo to learn more.\n\n\nfit <- brm(shootings ~  Year + (1|Month) + car(A, gr = OBJECTID,type='bym2'),\n           data = mdf, \n           data2 = list(A = A),\n           family = zero_inflated_poisson(),\n           cores = 3,\n           chains = 3,\n           backend = \"cmdstanr\",\n           threads = threading(2),\n           iter = 2E3)\n\n\n\n\nIf you’re wondering about the brm function and all the options used here I recommend starting with this paper (Bürkner 2017) and then the vignette on zero-inflated distributions and within-chain parallelization to learn more.\nYou can see the estimated monthly shooting rates by year in Table 1 which are fairly similar and not of primary interest so I leave them in the details section below. Plotting the composite effects \\(b_i\\) in Figure 3 we’re able to observe how the rate of shootings varies spatially across the city streets after adjusting for the global and local temporal effects captured by the other parameters, \\(\\beta_t,\\gamma_m\\).\n\n\n\nFigure 3: Distribution of median monthly rate ratio deemed credible with 90% probability, as compared to a typical street, of shootings across city streets in Upper Kensington. Non credible effects are shown as 0.\n\n\n\nThe plot in 3 shows the median log rate ratio of shootings for each street in the Upper Kensington Neighborhood that is determined to be “credibly” non-zero. That is, with 90% probability the model estimates that the effect is greater than 0. We can interpret an example street estimate of 1.97 to indicate that that street has exp(1.97) \\(\\approx\\) 7 times more shootings than a typical street in Kensington (where \\(b_i = 0\\)), all else equal. Further, you should notice how this plot agrees with Figure 1 which is a nice reinforcement that the model is capturing the data correctly. There is much more that could be learned from this modeling framework. For example, the parameter \\(\\pi\\), could be made street specific, \\(\\pi_{i}\\), so as to identify what features of a street are most likely to be associated with a complete lack of shootings. At this point, hopefully one can start to imagine how this model might be used in the context of urban policy decision making. By identifying those streets that are most at risk, the strength of correlation at the spatial or street specific level, or even just being able to offer a more intuitive interpretation of how policy may affect resident’s lives in a context they can appreciate, there are lots of opportunities. For the sake of brevity, I’ll simply conclude with one final note, a reminder of what this model is and is not saying.\nThis model is merely descriptive — it is describing the variability of shootings across the Upper Kensington neighborhood streets from 2019-2021 — rather than offering us anything causal as (Moyer et al. 2019)’s work sought to do. This is however, as far as I can tell, the first application of the BYM framework to city street level events5. I hope to show in a future post and possibly a proper paper, how this modeling framework can be combined with other ideas, such as the spatial temporal aggregated predictors I developed alongside my coauthors in (Peterson 2020; Peterson, Hirsch, and Sanchez 2021) to improve the estimate of the vacant lot cleanup effect (Moyer et al. 2019) estimated in their work. Such efforts usually take a long time, but I will post more about that here as soon as any meaningful progress has been made.\n\n\nTable 1: Estimate of street level monthly shootings rate by year.\n  \n  Year\n      Median (5%,95%)\n    2019\n0.02 (0.02, 0.04)2020\n0.03 (0.02, 0.07)2021\n0.02 (0.01, 0.06)\n\n\n\n\n\n\n\nBanerjee, Sudipto, Bradley P Carlin, and Alan E Gelfand. 2003. Hierarchical Modeling and Analysis for Spatial Data. Chapman; Hall/CRC.\n\n\nBesag, Julian, Jeremy York, and Annie Mollié. 1991. “Bayesian Image Restoration, with Two Applications in Spatial Statistics.” Annals of the Institute of Statistical Mathematics 43 (1): 1–20.\n\n\nBürkner, Paul-Christian. 2017. “Brms: An r Package for Bayesian Multilevel Models Using Stan.” Journal of Statistical Software 80 (1): 1–28. https://doi.org/10.18637/jss.v080.i01.\n\n\nCsardi, Gabor, and Tamas Nepusz. 2006. “The Igraph Software Package for Complex Network Research.” InterJournal Complex Systems: 1695. https://igraph.org.\n\n\nMorris, Mitzi, Katherine Wheeler-Martin, Dan Simpson, Stephen J Mooney, Andrew Gelman, and Charles DiMaggio. 2019. “Bayesian Hierarchical Spatial Models: Implementing the Besag York Mollié Model in Stan.” Spatial and Spatio-Temporal Epidemiology 31: 100301.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\nPedersen, Thomas Lin. 2020. Tidygraph: A Tidy API for Graph Manipulation. https://CRAN.R-project.org/package=tidygraph.\n\n\nPeterson, Adam. 2020. Rsstap: Spline Spatial Temporal Aggregated Predictors in r.\n\n\nPeterson, Adam, Jana Hirsch, and Brisa Sanchez. 2021. “Spatial Temporal Aggregated Predictors to Examine Built Environment Health Effects.” arXiv Preprint arXiv:2105.10565.\n\n\nRiebler, Andrea, Sigrunn H Sørbye, Daniel Simpson, and Håvard Rue. 2016. “An Intuitive Bayesian Spatial Model for Disease Mapping That Accounts for Scaling.” Statistical Methods in Medical Research 25 (4): 1145–65.\n\n\nRose, Erica Billig, Kwonsang Lee, Jason A Roy, Dylan Small, Michelle E Ross, Ricardo Castillo-Neyra, and Michael Z Levy. 2018. “Risk Maps for Cities: Incorporating Streets into Geostatistical Models.” Spatial and Spatio-Temporal Epidemiology 27: 47–59.\n\n\nvan der Meer, Lucas, Lorena Abad, Andrea Gilardi, and Robin Lovelace. 2021. Sfnetworks: Tidy Geospatial Networks. https://CRAN.R-project.org/package=sfnetworks.\n\n\nwhere \\(D_{i,i}\\) is the number of spatially adjacent neighbors for area \\(i\\) and 0 everywhere else↩︎\nwhere \\(A_{i,j} = 1\\) indicates area \\(i\\) and \\(j\\) are spatially connected and 0 indicates they are not↩︎\n(Riebler et al. 2016) contains a nice summary of the work leading up to their model.↩︎\nOther distance measures could be used, but at the small distances we are considering the differences should be negligible.↩︎\n (Rose et al. 2018) attempted to do something similar using a Gaussian process↩︎\n",
    "preview": "posts/2021-11-17-an-introduction-to-car-and-besag-york-mollie-models/an-introduction-to-car-and-besag-york-mollie-models_files/figure-html5/networkvis-1.png",
    "last_modified": "2022-01-16T15:00:31-05:00",
    "input_file": {},
    "preview_width": 1248,
    "preview_height": 768
  },
  {
    "path": "posts/2021-12-19-cleanup-vs-crime-mechanics/",
    "title": "Cleanup vs. Crime: Mechanics",
    "description": "Why did it work?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-12-19",
    "categories": [
      "Cleanup vs. Crime",
      "Social Cohesion"
    ],
    "contents": "\n\nThe lowest and vilest alleys in London do not present a more dreadful record of sin than does the the smiling and beautiful countryside. - Sherlock Holmes, The Adventures of the Copper Beaches\n\nAfter all the randomization, cleaning and measuring, now comes the philosophical pondering. Why did we see the low rates of crime we did in the areas around the greened lots? This is not a question to which we can provide a definitive answer, at least not from this study alone. However, we can discuss some of the prevailing ideas in this space and consider which among them are most compelling.\nEyes on the Street\nThe authors offer a number of summary comments detailing the potential mechanisms that may explain the reductions in shootings. The first arose from their qualitative research — survey interviews — which suggested that the greened vacant lots encouraged nearby residents to be more likely to leave their houses to walk by or spend leisure time in the lots that were previously used for illicit activities like drug dealing (Moyer et al. 2019).\nThe decrease in crime then, under this premise, arose from the increased number of residents using the vacant lots as it provided an increased number of undesirable witnesses for those who might otherwise become involved in a shooting. The author’s cite this as a possible manifestation of routine activities theory, which posts that predatory crime is most likely to occur when a motivated offender, a desirable target, and a lack of effective guardians converge in time and place (Cohen and Felson 1979).\nThis is a powerful idea, and while the work cited was published in 1979, there was an even earlier argument for these ideas in the 60’s. In one of the seminal works of urban planning, “The Death and Life of Great American Cities,” Jane Jacobs lays out a similar, simple thesis for what makes city streets safe (Jacobs 1959):\n\n… [T]here must be eyes upon the street, eyes belonging to those we might call the natural proprietors of the street. The buildings on a street equipped to handle the strangers and to insure the safety of both residents and strangers must be oriented to the street. They cannot turn their backs or blank sides on it and leave it blind.\n\nPersonally, I find this idea so compelling because it is so simple. We are innately social creatures and care a lot about what others think about us. We simply act differently when we think others may be watching, no matter our capacity for ill-intent. Still, there may be more at work here then simply increasing the number of eyes on the street.\nSocial Cohesion and Broken Windows\n\n\n\nFigure 1: Figure from Tomas Castelazo, CC BY-SA 3.0 https://creativecommons.org/licenses/by-sa/3.0, via Wikimedia Commons\n\n\n\nThere are two more sociological theories that may be at play here. The authors cite both collective efficacy theory as well as broken windows theory as being relevant in their final comments (Sampson, Raudenbush, and Earls 1997; Kelling and Wilson 1982). The first theory speaks directly to the idea of social cohesion highlighted in this blog’s introductory motivation: that members of a neighborhood community will attempt to self-regulate one another, separate of a more formal process, in order to avoid problems like those that may arise with the police. Additionally, they’ll also act to encourage other behaviors that promote shared values. The authors in our paper argue that the cleaned up vacant lots may have promoted this sense of social cohesion, prompting a renewed willingness to act for the common good and normalizing a higher standard of behavior in the community.\nBuilding off this idea, the broken windows theory posits that a sense of disorder may promote further disorder — if one window is broken in a building, the rest will soon be broken. By restoring some sense of “order” to the built environment, the greened and mowed vacant lots reduced the inherent psychological feeling that crime was appropriate. It may be worth noting here, briefly, that what constitutes a sense of order broadly is not necessarily uniformly understood, but for our purposes we’ll consider “order” in this context to mean the vacant lots without trash or apparent lack of use.\nWhich is it?\nAll of these ideas represent plausible mechanisms by which the greening and mowing intervention effects on gun violence may have occurred. We can’t really know which, or to what extent one theory may have had a larger role to play than the others from this analysis but future work that target these theories more specifically could. For example, one might be able to scrape comments and photos on social media sites like Nextdoor or Twitter that mention the vacant lots, and try to identify how the attitudes community members communicate about these spaces may comport more or less with the theories stated above. For my part, I think each of these theories probably plays some role, though I have to think that the eyes on the street may be the most impactful in discouraging misdeeds.\nLooking Ahead\nThis post represents the final writing I plan to do on this paper specifically, though I hope to reference it again in future work. Specifically, I hope to build on the ideas discussed here to examine different ways crime manifests in cities during times of duress — like, say a pandemic — as well as consider alternative methods for modeling crime. Regardless, it is my hope that having read some or all of this case study, you’ve come away with an appreciation for both the importance of the built environment as it affects one of the most important aspects of our lives — safety — as well as gained some understanding of the difficulties in how we measure and analyze these phenomena.\n\nThe pressure of public opinion can do in the town what the law cannot accomplish. There is no lane so vile that the scream of a tortured child, or the thud of a drunkard’s blow, does not beget sympathy and indignation among the neighbours, and then the whole machinery of justice is ever so close that a word of complaint can set it going, and there is but a step between the crime and the dock. But look at these lonely houses, each in its own fields, filled for the most part with poor ignorant folk who know little of the law. Think of the deeds of hellish cruelty, the hidden wickedness which may go on, year in, year out, in such places, and none the wiser.\" - Sherlock Holmes, The Adventures of the Copper Beaches\n\nAcknowledgements\nThanks to Robert Svoboda for reading and offering comments on this article.\n\n\n\nCohen, Lawrence E, and Marcus Felson. 1979. “Social Change and Crime Rate Trends: A Routine Activity Approach.” American Sociological Review, 588–608.\n\n\nJacobs, Jane. 1959. The Death and Life of Great American Cities. Vintage.\n\n\nKelling, George L., and James Q. Wilson. 1982. “Broken Windows: The Police and Neighborhood Safety.” The Atlantic, March.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\nSampson, Robert J, Stephen W Raudenbush, and Felton Earls. 1997. “Neighborhoods and Violent Crime: A Multilevel Study of Collective Efficacy.” Science 277 (5328): 918–24.\n\n\n\n\n",
    "preview": "posts/2021-12-19-cleanup-vs-crime-mechanics/Broken_window_large.jpeg",
    "last_modified": "2022-05-07T13:06:00-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-11-28-cleanup-vs-crime-causal-inference/",
    "title": "Cleanup vs. Crime: Causal Inference",
    "description": "What kinds of causal claims are justified from an empirical analysis?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-11-28",
    "categories": [
      "Technical",
      "Cleanup vs. Crime",
      "Social Cohesion"
    ],
    "contents": "\n\n\n\nAfter we’ve calculated our buffer counts and fit our fancy mixed effects regression model what kind of claims can we make about the results?\nIn the paper we’ve been studying, the author’s estimate a decrease in the number of crimes around vacant lots randomly assigned the greening or mowing interventions, stating in their abstract:\n\nConclusion: Remediating vacant land with inexpensive, scalable methods, including greening or minimal mowing and trash cleanup, significantly reduced shootings that result in serious injury or death.\n\n\nPublic Health Implications: Cities should experiment with place-based interventions to develop effective firearm violence–reduction strategies.\n\nBoth these and other claims the authors might make require varying level of assumptions in order to be valid. In this post, we’ll walk through these claims step-by-step, identifying the tools the author’s did or did not use to try to fulfill each assumption.\nDescriptive Statistics vs. Causal Inference\nLet’s start with the easiest, most defensible claim the authors can make after finishing their analysis. I’ll limit these statements to just the greening intervention since that had the more robust results across the models.\n“The greening intervention was associated with a decrease in crimes in the area proximal to the vacant lots in our sample.”\nThere are two keywords that I’ve bolded in the above quote. The first — associated — is important because it implies that there is not necessarily a causal relationship between the greening intervention nearby crime. The second — sample — implies that the association may be limited to the sample and not generalizable to a larger population of vacant lots and shooting crimes generically found in the world at large.\nThese claims fall under the category of what statisticians might colloquially call “descriptive,” in that they are absolutely true in describing the sample as observed. Scientific research generally aims to establish more general truths that describe the causal relationships that determine the data we observe. In order to make the jump from describing our sample to describing the world, there are several assumptions we have to make, critical to our ability to draw a causal conclusion from our descriptive analysis.\nAssumptions Assumptions\nHere’s a stronger claim than the previous.\n“The decrease in crime observed was caused by the greening intervention in our sample.”\nIn order to make the jump in claim from association, or correlation, to causation the author’s need to defend their ability to have met the identifiability assumptions for a causal effect. I’ve discussed these ideas in greater depth here and here but for now we’ll focus on (1) the author’s strategy in using their second buffer model to check for spillover effects and how this relates to the notion of of interference, as well as (2) how the author’s use of randomization should provide them with some justification for arguing that the intervention assignment is independent of other potential confounding factors.\nSpillover and Interference\nIf a cluster of vacant lots were assigned to the greening intervention, how far would the decrease in crime associated with that intervention extend out in space? Is it possible that the effect could impinge upon another vacant lot?\n\nHere we’re considering the spatial scale of the intervention. Just as potentially important is the temporal scale, or that time at which the intervention has its greatest impact. See (Peterson, Hirsch, and Sanchez 2021) for more on this idea.\n\n\n\nFigure 1: Illustration of buffer zones around hypothetical vacant lot. First buffer in green is used to detect proximal increase/decrease in crime, while the second is used to check for spillover effects by considering the non-overlapping area between the two circles.\n\n\n\nFigure 1 illustrates the method the author’s used to check for “spill-over.” By looking both 300 and 600 meters around the vacant lots they sought to establish that the interventions did not simply move the shootings from closely to slightly further away, but actually did diminish the overall number of shootings. However! What the author’s failed to acknowledge and comment on in their paper, was the impact that this extended spatial impact — when one vacant lot’s effect may impinge upon another — may have upon their estimates of the intervention effect, as it demonstrates the capacity for these vacant lot interventions to interfere with one another. Recall that the author’s clustered vacant lots in order to try and limit the impact from spatial proximity, but this extended spatial effect shows the effect may go farther than previously anticipated. We’ll use this as a point of discussion in a future blog-post but for now we’ll simply consider it a question this result leaves us asking.\n\n\n\nFigure 2: Visualization of hypothetical vacant lots proximal to one another whose effects may interfere with one another despite clustering.\n\n\n\nRepeat Randomization\nAnother tool the author’s used was randomization: “A repeat randomization procedure ensured that the clusters were balanced on potential confounding variables including the total area and mean separating distance of the vacant lots, the resident population, and the number of Summary Reporting System Part I serious violent and property crimes, such as robbery and burglary.” (Moyer et al. 2019).\nThe authors use randomization to try and create exchangeability between the different intervention groups. That is that there is just as much likelihood of a crime occurring in the area proximal to a control vacant lot as it would in an area proximal to a vacant lot receiving one of the two interventions.\nThere are two things to note here, (i) the author’s are doing everything they can to try and ensure that these different vacant lot clusters are comparable across the different intervention groups and (ii), they seem to have trouble accomplishing this goal.\nAs they state in their results, “The greened lots tended to have a slightly higher average shooting rate in the baseline period (pre), which we accounted for in the regression estimates.” This imbalance1 between the different intervention groups, reflects a difficult truth in built environment research and the larger realm encompassing the social sciences more generally: it is really hard to make things that are fundamentally different comparable for the sake of analysis. This may be why the authors chose to conduct their analysis using the difference-in-difference estimators, as this is not the strongest, or “best” contrast that a scientist typically hopes to make in establishing a causal effect.\nTreatment Effects\nLet’s continue with our hierarchy of claims.\n“Applying greening interventions caused there to be a reduction in crime around vacant lots greater than one would observe otherwise.”\nThis is a very specific kind of claim that may be more familiar when considered in the context of a pharmaceutical clinical trial. If we were to randomly assign a treatment and placebo to a group of individuals who had some disease, we would be most interested in the difference of outcomes between the individuals who had the treatment and those who had the control. In statistics and causal inference this is called the Average Treatment Effect (ATE), and is the most frequent causal estimand of interest. If \\(A_i=1\\) indicates the \\(i\\)th subject, \\((i=1,...n)\\), in a clinical trial received the treatment and \\(A_{i'}=0\\) indicates the \\(i'\\)th subject received the placebo and we were measuring some outcome \\(Y^{(t)}_i\\) at time points \\(t = 0, 1\\), then we would define the ATE and estimated ATE as follows:\n\\[\\begin{equation}\n\\begin{aligned}\nATE &= E[Y^{1}|A=1] - E[Y^1|A=0] \\\\\n\\hat{ATE} &= \\frac{1}{n}\\sum_{i=1}^{n} Y_i^1A_i - \\frac{1}{n} \\sum_{i=1}^{n}Y_{i}^1(1-A_i)\n\\end{aligned}\n\\end{equation}\\]\nAnother causal estimand is the Average Treatment Effect on the Treated or ATET. This estimand is represented by the following expression, note the difference in the time points and treatment variables : \\[\n\\begin{aligned}\nATET &= E[Y^{1}|A=1] - E[Y^{0}|A=1].\\\\\n\\hat{ATET} &= \\frac{1}{n}\\sum_{i=1}^{n} Y_i^1A_i - Y_i^0A_i\n\\end{aligned}\n\\]\nConceptually the regression models the author’s used, discussed in the previous post, estimates this latter (ATET) entity, but in a slightly more complicated way. To make things simpler, this idea can be represented as the difference between the two points connected by the line in Figure 3 below.\n\n\n\nFigure 3: Visualization of Average Treatment Effect (ATE) and Average Treatment Effect on the Treated(ATET) below using the crime density estimates from (Moyer et al. 2019). Solid line is above the two points involved in the ATET and the dotted line is above the two points involved in calculating the ATE.\n\n\n\nBringing these ideas back to the claim at hand, the author’s did not aim to justify this statement. By using a difference-in-difference estimator they estimated the ATET, which was their “take-home” result.\nWhile this is still an interesting result, it does make a reader like me wonder why they went to the effort of randomizing interventions as they did, if they didn’t even use their control vacant lots in the contrast estimate of the intervention effect(s). My guess is that the result was not significantly different and they didn’t want this result complicating their story.\nHowever, before we get too dramatic, it is important to realize that the authors do have some justification for focusing on the ATET as they did. As mentioned above, the pre-intervention crime measures for the three different vacant lot groups were all different, suggesting these may not have been as comparable as they should have been from randomization. Given that, it seems that one of the best and most conservative things the authors could do, would be to focus on the ATET as they did. Still, it is not the best one might hope for when looking to advance the cause of “place-based interventions” as I and the authors both hope to do.\n\nNote that under an additional assumption, termed the parallel trend assumption, the ATET is equal to the ATE. This assumption is often made in natural experiments, where one cannot randomize a treatment and control group. However, it is not likely relevant here, as the author’s could explicitly compute the ATE.\nGeneralizability\n“Greening vacant lots will reduce in crime in the surrounding area generally and not just in Philadelphia”\nSeparate from the ideas of ATE’s, ATET’s and randomization is the question of generalizability. How much can we hope that the results found here will be reproduced in other cities around the globe? This likely depends on the mechanism by which violent crimes manifest, as well as how greening or mowing vacant lots plays into this mechanism. The authors speak to this idea in part in their discussion, and we’ll discuss this idea further in the subsequent post discussing the substantive reasoning at play in this study. For now it might suffice to say that the more similar a city is to Philadelphia the more likely one would be to feel justified in expecting these results to apply and vice versa.\nRecap and Conclusion\nLet’s review the different claims made and how they each measured up in our analysis.\n“The greening intervention was associated with a decrease in crimes in the area proximal to the vacant lots in our sample.”\nThis claim has the strongest level of evidence for it. In fact I’d say it is trivially true, barring any serious data collection or study design errors.\n“The decrease in crime observed was caused by the greening intervention in our sample.”\nThis claim is in line with the author’s conclusion in their abstract and is supported mainly by the ATET estimate. However, there is still the potential for interference — despite clustering – to attenuate this estimate or reformulate how the effect manifests.\n“Applying greening interventions caused there to be a reduction in crime around vacant lots greater than one would observe otherwise.”\nThe author’s can’t defend this claim. While they tried to make their intervention and control groups as comparable as possible through randomization, baseline crime measures between the groups were quite different, forcing the author’s to abandon any contrast estimate between groups and focus only on within group differences.\n“Greening vacant lots will reduce in crime in the surrounding area generally not just in Philadelphia”\nYes and no. Cities are highly variable and not at all homogeneous. The more similar a city is to Philadelphia, the more likely the results may apply. However, this is true for every built environment or place-based intervention, and shouldn’t be held against the author’s good-faith effort here. Despite the fact that the author’s can’t completely defend this claim, I agree with the statement they make in their abstract, under “Public Health Implications,” that other cities should adapt the techniques and lessons tried here. Given The cost/benefit ratio, there certainly seems enough evidence to try something, Given the potential payoff.\nOverall, in my judgement, this study is still quite strong, with only aspects of interference related to point 2. and lack of comparability related to points 3 and 4. holding them back from making all the claims that one could hope for from this work. In the next and final post of this case study, we’ll look through the mechanisms by which the decrease in crime may have occurred.\nAcknowledgements\nThanks to Robert Svoboda and Paul Haluszczak for reading and offering comments on this article.\n\n\n\nGelman, Andrew, Jennifer Hill, and Aki Vehtari. 2020. Regression and Other Stories. Cambridge University Press.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\nPeterson, Adam, Jana Hirsch, and Brisa Sanchez. 2021. “Spatial Temporal Aggregated Predictors to Examine Built Environment Health Effects.” arXiv Preprint arXiv:2105.10565.\n\n\nSee Chapter 20 Section 4 in (Gelman, Hill, and Vehtari 2020) for more on this topic.↩︎\n",
    "preview": "posts/2021-11-28-cleanup-vs-crime-causal-inference/cleanup-vs-crime-causal-inference_files/figure-html5/ATEvis-1.png",
    "last_modified": "2021-11-28T20:57:14-05:00",
    "input_file": {},
    "preview_width": 2688,
    "preview_height": 1536
  },
  {
    "path": "posts/2021-08-23-cleanup-vs-crime-methods-of-analysis/",
    "title": "Cleanup vs. Crime: Methods of Analysis",
    "description": "From KDEs to Difference-in-Differences",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-11-07",
    "categories": [
      "Technical",
      "Cleanup vs. Crime",
      "Social Cohesion"
    ],
    "contents": "\nIn the previous post we discussed this fantastic article, (Moyer et al. 2019), which studied how different cleaning “interventions” applied to vacant lots had the potential to affect the rate of nearby violent shootings. In this post we’ll look at the specific measures and statistical methods they used to analyze their data in order to test this hypothesis and break down the methods’ various advantages and disadvantages.\nMethods\nData and Questions\nRecall from the paper that the authors had shooting data accessed from the Philadelphia Police Department, and vacant lot data - location, size, and randomized intervention, that they amassed as part of their project. I’ve already shown, visually, what the shooting data looked like in the first post. The data structure for the vacant lot data probably looked something like what’s in Table 1.\n\n\nTable 1: Hypothetical Vacant Lot Data\n  \n  Lot Cluster ID\n      Intervention\n      Latitude\n      Longitude\n    1\nGreening\n0\n02\nMowing\n0\n03\nGreening\n0\n04\nControl\n0\n05\nControl\n0\n0\n\nBut all this begs the question, if we have lots at one location, and shootings at another, how do we relate the two to each other? The authors propose two methods, the first involving a kernel density estimate and the second involving a count of the number of shootings inside a “Buffer” Zone around the vacant lots.\nKernel Density Estimates\nWhat’s a kernel density estimate(KDE)? Simply put, it is a fancy word for a fancy kind of average1. The author’s created a grid of points across the polygonal space defined by Philadelphia’s borders and at each grid point took a weighted average of the number of shootings during the time period, e.g. month of interest. They chose a bandwidth of 500 meters, which essentially means that shootings within that distance were weighted more than those further away. We can’t know which kernel they used because they don’t state it explicitly, but of the many options they may have chosen the rectangular kernel, as they state many of their estimates in terms of Crimes per km\\(^{2}\\). The KDE,\\(Y_{it}\\) at an arbitrary location \\(\\mathbf{s}\\) for a given month would then combine all \\(i=1,...n\\) shooting samples as follows: \\[\nY_{it}(\\mathbf{s}) := \\frac{1}{(0.500)^2}\\sum_{i=1}^{n} I(\\mathbf{s}'_{it} \\in U),\n\\] where \\(I(\\mathbf{s}' \\in U)\\) is a function that returns a 1 if the location of shooting \\(i\\) is in the box \\(U\\) of coordinates defining a 500 m\\(^2\\) square around location \\(\\mathbf{s}'_{it}\\) during time period \\(t\\) and 0 otherwise.\nAgain, what this amounts to conceptually is an average number of shootings at each grid point, where those shootings at closer distances are weighted more and those shootings at further distances (those more than 500 m) are weighted zero. The authors create their main figure in the paper from plotting the relative averages at each grid point across space. The lower values are assigned a light green color and the higher values are assigned a red color. See Figure 1 from their paper, below where the shootings are calculated at at yearly rate.\n\n\n\nFigure 1: Kernel Density Estimate of shootings Figure from (Moyer et al. 2019).\n\n\n\nAs you can see, the kernel density estimate gives us this nice visualization and a decent conceptualization of the vacant lots that are most prone to having shootings nearby, but what are the disadvantages, if any?\nPros and Cons\nAs stated previously, the KDE has a number of advantages, including the ability to nicely visualize across continuous space, the relative “amount” of shootings at each location. However, it has a number of drawbacks too. The first, is that we don’t know if it’s a particularly good estimate. If you recall, the author’s chose a certain bandwidth of 500m, but wouldn’t 400m have been just as good? This is a well established problem in this space known as the modifiable areal unit problem (Fotheringham and Wong 1991) (MAUP), which formalizes the notion that different bandwidths or buffer choices correspond to different levels of exposure – exposure to cleaned vacant lots in this setting – and consequently different estimates of how exposure may affect the outcome.Further, while the idea of a KDE of shootings can be nicely visualized, as in Figure 1, it can be difficult to communicate verbally to stakeholders:\n“Ah yes, you see when we cleaned up these vacant lots we found that the average number of shootings at the vacant lot decreased as measured by this kernel density estimate, which takes into account a weighted average of those shootings that are nearby. What do I mean by nearby and how did I choose the weights? Well the weights and proximity are defined according to this kernel and bandwidth measure we chose….”\nYou get the picture. It would be much easier to say, did the average number of shootings at location “x” go down or not? However, this can be much harder to model, so the authors, understandably, went with the KDE. The outcome in their first model, \\(Y_{it}\\), was consequently defined as follows:\n\\[ \nY_{it} := \\text{ KDE at lot } i\\text{, in study month } t. \\\\\n\\]\nBuffer Counts\nThe second measure the author’s use to try and assign a specific number of shootings to a vacant lot is known as a “buffer count” or “buffer zone.” Put simply, the author’s looked at the center of each vacant lot, drew a circle 300 meters around that point, and counted all the shootings that fell into that circle, during a given month and assigned that value to the vacant lot as it’s count of shootings, \\(Y_{it}'\\). See Figure 2 for a visualization of this idea. The authors then went on to check for “spill-over” effects through the use of a second, 600m buffer around the first.\n\n\n\nFigure 2: Visualization of Hypothetical Buffer with 300 m radius in Upper Kensington. Star represents location of hypothetical vacant lot.\n\n\n\nPros and Cons\nThe buffer count has a very appealing interpretation as it is simply the number of shootings within a certain distance of the location of interest. This is much easier to explain to stakeholders, and others who may be interested in this work, but not interested in learning about kernels and bandwidths. It can also be seen as a kind of kernel density estimate, except now we’re taking an unweighted, unnormalized average2. However, similar to the kernel density estimate, it suffers from the MAUP by having to choose some ad hoc distance, 300 (or 600 for spillover) meters in this case, as the “correct” distance within which to count shootings. This remains a major drawback.\n\nThere have been developments in the statistics literature to try and address these issues that we’ll discuss in detail at another point in time. See (Baek et al. 2016),(Peterson, Hirsch, and Sanchez 2021), and (Peterson, Sanchez-Vaznaugh, and Sanchez 2021) if you’d like to learn more now.\n\\[\nY_{it}' = \\text{# of shootings within 300m of vacant lot } i \\text{ during month } t \n\\]\nDifference in Differences\nNow that we have our two outcome measures constructed from the shooting data and vacant lot locations, we can turn to modeling the potential effects of the vacant lot cleanup intervention. The author’s estimate a “Difference-in-Differences”(DnD) of the expected number of shootings at the lots that receive either the “greening” or “mowing” intervention. This is a very specific estimate that we’ll elaborate on in more detail in the causal inference post, but for now it suffices to say they’re comparing the same vacant lots before and after receiving the interventions, as opposed to comparing those lots that received interventions and the control.3 For now, let’s break down this big equation from the initial post and try to understand how they calculate the difference-in-difference estimate for the greening intervention4;\n\\[\\begin{equation}\n\\begin{aligned}\nY_{it} &= \\beta_0 + \\beta_1 \\text{Greening}_i + \\beta_2\\text{Mowing}_i\n+ \\beta_3\\text{Post}_t + \\beta_4\\text{AllTreated}_i  \\\\\n&+ \\beta_5 \\text{Greening}_i \\times \\text{Post}_t + \n\\beta_6\\text{Mowing}_i \\times \\text{Post}_t  \\\\\n&+ \\beta_7\\text{Greening}_i\\times \\text{AllTreated}_t + \n\\beta_8\\text{Mowing}_i \\times \\text{AllTreated}_t \\\\\n&+ \\alpha_{m(t)} + \\delta_{s(i)} + \\xi_{c(i)} + \\epsilon_{it},\n\\end{aligned}\n\\tag{1}\n\\end{equation}\\]\n\nThis equation uses the notion of indicator functions. That is, Greening\\(_i\\) is either a 0 or 1 for lot \\(i\\). 1 indicates the lot received the greening intervention and 0 indicates it did not. Post\\(_t\\) is the same where a 1 indicates the measurement was recorded after the intervention was administered and vice versa.\nFrom (1), we can see that the expected number of shootings for a greening lot prior and subsequent to the intervention is represented by \\(\\beta_0 + \\beta_1\\), and \\(\\beta_0 + \\beta_1 + \\beta_5\\), respectively. If we want to know the difference then, in the expected number of shootings for the same vacant lots assigned to the greening intervention before and after the trial, we simply take the difference between these two equations which gives us \\(\\beta_5\\). Our estimate of this quantity, \\(\\hat{\\beta}_5\\), is the estimated effect of the greening intervention. Similarly, \\(\\hat{\\beta_6}\\) is the estimated effect of the mowing intervention.\nOf course, in statistics it isn’t sufficient to just calculate a point estimate, like \\(\\hat{\\beta}_5\\), and call it a day. We need to provide some measure of our uncertainty of that estimate as well, to establish whether this result provides enough evidence to be considered credible, or whether the estimated effect is just due to measurement error or random variation. An important part of estimating that uncertainty is taking into account sources of correlation in the measurements. The authors do this by way of incorporating mixed effects. See (Fitzmaurice et al. 2008) for a more general introduction on this topic, as we’ll focus only on those aspects relevant to this application in the following section.\nMixed Effects Regression\nAt the very end of (1) you can see four terms reproduced below for easier focus:\n\\[\nY_{it} = ... + \\alpha_{m(t)} + \\delta_{s(i)} + \\xi_{c(i)} + \\epsilon_{it}.\n\\]\nEach of the first three of these terms account for a different source of correlation between the different vacant lots. The sources of variation and the corresponding parameter are as follows:\nTemporal correlation\nvacant lots have similar numbers of shootings according to which seasonal month of the year the measurement is taken: \\(\\alpha_{m(t)}\\)\n\nSpatial correlation\nvacant lots that are closer to each other will have more similar numbers of shootings than those that are far away : \\(\\delta_{s(i)}\\)\n\nCluster correlation\nvacant lots in the same cluster will have similar numbers of shootings: \\(\\xi_{c(i)}\\)\n\nThe final term \\(\\epsilon_{it}\\) represents measurement error that applies equally to all vacant lots, regardless of space, time, or cluster.\nThere is a lot that could be said about these mixed effects terms. However, it suffices to say that the author’s correctly include these terms to assure that the resulting confidence intervals they calculate for their estimates of interest, \\(\\hat{\\beta_5}\\) and \\(\\hat{\\beta_6}\\) take into account the variability within seasons, space and cluster.\nConclusion\nIn this post we’ve examined how the author’s use of KDEs, buffer counts, DnD estimators and mixed effects regression came together to try and provide a reliable estimate of the effects of the greening and mowing vacant lot interventions on shooting crimes. We’ve also seen some of the advantages and disadvantages each of these approaches may involve. Many of these will continue to be of importance as our attention now turns to the causal inference assumptions underlying the statistical methods and estimation procedures discussed here that, if correct, extend the results from this experiment to a more widely generalizable result.\nAcknowledgements\nThanks to Robert Svoboda and Paul Haluszczak for reading and offering comments on this article.\n\n\n\nBaek, Jonggyu, Brisa N Sánchez, Veronica J Berrocal, and Emma V Sanchez-Vaznaugh. 2016. “Distributed Lag Models: Examining Associations Between the Built Environment and Health.” Epidemiology (Cambridge, Mass.) 27 (1): 116.\n\n\nFitzmaurice, Garrett, Marie Davidian, Geert Verbeke, and Geert Molenberghs. 2008. Longitudinal Data Analysis. CRC press.\n\n\nFotheringham, A Stewart, and David WS Wong. 1991. “The Modifiable Areal Unit Problem in Multivariate Statistical Analysis.” Environment and Planning A 23 (7): 1025–44.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\nPeterson, Adam, Jana Hirsch, and Brisa Sanchez. 2021. “Spatial Temporal Aggregated Predictors to Examine Built Environment Health Effects.” http://arxiv.org/abs/2105.10565.\n\n\nPeterson, Adam, Emma Sanchez-Vaznaugh, and Brisa Sanchez. 2021. “Heterogeneous Effects in the Built Environment.” http://arxiv.org/abs/2107.05805.\n\n\nThis describes most of the work done in Statistics.↩︎\nalso called a sum↩︎\nThere may or may not be good reasons for not estimating this latter contrast but we’ll save that discussion for the causal-inference post.↩︎\nI omit the distributional assumptions on the random\neffects and epsilon term here for space. They are all distributed Normal with mean zero and unknown variance.↩︎\n",
    "preview": "posts/2021-08-23-cleanup-vs-crime-methods-of-analysis/cleanup-vs-crime-methods-of-analysis_files/figure-html5/buffervis-1.png",
    "last_modified": "2021-11-28T20:58:26-05:00",
    "input_file": {},
    "preview_width": 2688,
    "preview_height": 1536
  },
  {
    "path": "posts/2021-10-17-cleanup-vs-crime/",
    "title": "Cleanup vs. Crime: A Case Study in 4 Parts",
    "description": "A simple concept and a decent result.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-10-17",
    "categories": [
      "Big Picture",
      "Cleanup vs. Crime",
      "Social Cohesion"
    ],
    "contents": "\nI’m a big fan of this paper looking at how cleaning up vacant lots has the potential to affect crime(Moyer et al. 2019). There’s a lot to love here, and I’m hoping to use this paper as an excuse to explore several different ideas relevant to both understanding the built environment and statistical methods more generally. In this post we’ll focus on a high-level understanding of the paper while future posts will focus on (1) the measures of gun violence and statistical models used, (2) the assumptions and approach that go into the causal inference associated with this trial and finally (3), I’ll devote a post to the conceptual models at play here. Why would cleaning up a vacant lot affect nearby gun violence, or other measures of community health?\nI’ll go on to show alternative methods that could be used to analyze these data and the advantages they may have over the current author’s approach. I’ll leave that, however, for a different series of posts. Hopefully this brief outline has you excited for what’s to come, but for now, let’s dive into the paper!\n\nFor related papers see here and here. The latter paper refers to the same set of vacant lots and provides more details on the vacant lot greening strategy and neighborhoods involved in (Moyer et al. 2019).\nBackground\n\n\n\nFigure 1: Graphic demonstration of the different cleaning interventions. Figure from ‘Citywide cluster randomized trial to restore blighted vacant land…’ (Branas et al. 2018)\n\n\n\nThe authors’ objective in this work is to determine whether cleaning up a series of vacant lots in the areas where, unfortunately, many shootings regularly occur, could lead to a reduced rate of gun violence.\nIn order to test this hypothesis, the authors randomly assign 1 of three “interventions” to each of 110 geographically close clusters of vacant lots — 541 lots in total — spread across Philadelphia between April and June of 2013.\nThe first intervention called “greening,” involved “removing trash and debris, grading the land, planting new grass and a small number of trees to create a parklike setting, installing low wooden perimeter fences, and regularly maintaining the lot.” (Moyer et al. 2019). You can see a demonstration of this idea in Figure 1.\nThe second intervention labeled “mowing,” made the vacant lot not so much park-like as just generally maintained. The description states it as “mowing existing grass and weeds, removing trash and debris, and regularly maintaining the lot.” (Moyer et al. 2019).\nThe third and final “intervention” was simply the control group, where no action was taken on the vacant lot whatsoever.\nThe author’s used the Philadelphia Department of Police data of reported shootings not involving police officers from years 2011-2015 as their outcome of interest. You can see a sample of these data from 2015 in the neighborhood of Upper Kensington in Figure 2.\n\n\n\n\n\n\nFigure 2: Map of No-Officer Involved Shootings in Upper Kensington, Philadelphia during 2015. Red point indicates the occurrence of one shooting.\n\n\n\nMethods\nThe author’s used two different measures of the number of shootings each month in and around vacant lots to determine whether their interventions were effective: a kernel density estimate and two — differently sized — buffer counts. The author’s fit two models of a similar form, estimating the difference in the kernel density estimate and rate, respectively as a function of whether the observed lot density estimate or buffer count had received one of the two interventions during June 2013 - April, 2015.\nThey also adjusted for correlation across time, space and within clusters. The kernel density estimate model is shown below, but we’ll leave a more thorough examination of it and the buffer models for a later post.\n\\[ \nY_{it} := \\text{# Shootings / km}^2 \\text{at lot cluster } i\\text{, month } t \\\\\n\\] \\[\n\\begin{aligned}\nY_{it} &= \\beta_0 + \\beta_1 \\text{Greening}_i + \\beta_2\\text{Mowing}_i\n+ \\beta_3\\text{Post}_t + \\beta_4\\text{AllTreated}_i  \\\\\n&+ \\beta_5 \\text{Greening}_i \\times \\text{Post}_t + \n\\beta_6\\text{Mowing}_i \\times \\text{Post}_t  \\\\\n&+ \\beta_7\\text{Greening}_i\\times \\text{AllTreated}_t + \n\\beta_8\\text{Mowing}_i \\times \\text{AllTreated}_t \\\\\n&+ \\alpha_{m(t)} + \\delta_{s(i)} + \\xi_{c(i)} + \\epsilon_{it}\n\\end{aligned}\n\\]\n\nWhy did the author’s fit these different models? And what is going on in that equation? We’ll discuss this more in the post focused on the methods of analysis\nResults\nConverting their estimates to percent change in the number of expected shootings, the author’s determined that the monthly shootings per square kilometer (density estimate model) decreased by 6.8 % (95% Confidence Interval: -10.6%,-2.7%) for those lots in the greening intervention compared to the pre-intervention baseline and -9.2% (-13.2%,-4.8%) compared to baseline for those lots in the mowing intervention. The author’s estimated a similar significant result for the greening intervention for their buffer analysis and a non-significant change from the mowing intervention from their buffer analysis. The author’s sought to check for “spillover effects” from their interventions using the second, larger buffer model and found no significant difference for those areas adjacent to the greening intervention and a significant decrease in those areas adjacent to the mowing intervention. The author’s state that “these results suggest spillover benefits of vacant lot remediation, rather than displacement.” Meaning that they took this result to be evidence that the interventions didn’t simply push shootings to be one or two blocks away from where the clean-up occurred.\n\nA non-significant result here means that the author’s did not think there was sufficient evidence to conclude that the estimated change was not zero. See this example for more.\nConclusion\nSo … that’s neat! What’s the take home message? If you clean up that dirty parking lot near where you live, you’ll disincentive crime? Well, maybe. As with all human endeavors, nothing is perfect and rarely simple. In the posts to come we’ll talk more about the strengths and limitations of the author’s approach as well as why this result is still so encouraging in spite of those problems. One overarching theme to keep in mind, is that this is a fairly cheap endeavor, just cleaning up some vacant lots, with a potentially huge payoff — saving human lives! This represents both the simplicity and the power that I hope to show is a regular theme in building better built environments.\nUpdates\nI added further details on how Branas’ PNAS paper (Branas et al. 2018) is related to the Moyer paper (Moyer et al. 2019) of concern in this case study on 10/26/21.\n\n\n\nBranas, Charles C., Eugenia South, Michelle C. Kondo, Bernadette C. Hohl, Philippe Bourgois, Douglas J. Wiebe, and John M. MacDonald. 2018. “Citywide Cluster Randomized Trial to Restore Blighted Vacant Land and Its Effects on Violence, Crime, and Fear.” Proceedings of the National Academy of Sciences 115 (12): 2946–51. https://doi.org/10.1073/pnas.1718503115.\n\n\nMoyer, Ruth, John M MacDonald, Greg Ridgeway, and Charles C Branas. 2019. “Effect of Remediating Blighted Vacant Land on Shootings: A Citywide Cluster Randomized Trial.” American Journal of Public Health 109 (1): 140–44.\n\n\n\n\n",
    "preview": "posts/2021-10-17-cleanup-vs-crime/F1.jpg",
    "last_modified": "2021-10-26T21:34:00-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-10-10-Shadyside-Connector/",
    "title": "Shadyside Connector: Introduction",
    "description": "Street planning at the local level.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.com/"
      }
    ],
    "date": "2021-10-10",
    "categories": [
      "Big Picture"
    ],
    "contents": "\n\n\n\nI recently had the great joy of participating in the civil engagement process at the Shadyside Connector virtual meeting hosted by the City of Pittsburgh’s Department of Mobility and Infrastructure (DOMI). If you’re interested, the video of the night’s meeting can be found here along with slides and map of the street with the proposed changes for the first phase.\nThis meeting, and the project that is its focus, captures so many different aspects of what the planning process looks like, from the high level concept, to on the ground data collection, public engagement, comment periods and so on, that I thought it offered the perfect opportunity to give a “real-world” application for the many statistical and substantive ideas that are discussed on this blog. This project is currently ongoing, so there will be more to write about as time goes on. For now, we’ll focus on the background leading up to this meeting, the proposed changes to the neighborhood’s streets and the plan for implementing these changes in the years to come.\n\n\n\nFigure 1: Proposed Bike Network from Pittsburgh’s Bike+ Plan. Figure taken from pittsburghpa.gov\n\n\n\nOverview\nThis meeting comes amid a larger effort by the city to expand and improve the city bike network’s1 access and safety. The high level overview of this plan is contained in the city’s Bike+ Plan (See Figure 1) which provides a long term vision of how the city hopes to expand the bike network. This meeting specifically focused on the “Neighborhood Connector” connecting the East Liberty and Shadyside neighborhoods. While several different routes were considered for this “Connector”, survey results pointed to Ellsworth Avenue as the preferred target for improving cycling safety.\n\nThe city of Pittsburgh also recently announced a 50 year mobility plan which includes all sorts of eyebrow raising ideas like gondolas, hyperloops, as well as good’ol fashioned bike lanes.\n\n\n\n\nFigure 2: Shadyside neighborhood and Ellsworth Street. Neighborhood highlighted in grey, street in blue. Connector in Green. Data from wprdc.org\n\n\n\nGoals and Plan\nThe goals for the connector plan are as follows (taken from their slides):\nImprove bike mobility and comfort\nCar Speeds < 25mph\nVehicle Volumes < 3000\n\nImproves pedestrian comfort\nCrossing Improvements\n\nSupports and enhances transit access and comfort\nPrioritizes pedestrian movements\nSupports transit movements\n\nReduces amount and severity of crashes\nIncreases safety for all users including motorists\nMaintains vehicular access and parking\n\nEach of these goals offers a number of opportunities for statistical innovations. I hope to cover these ideas in a future blog post, but one point that came to mind was how far the effect a given change might extend down the road; if we place one speed bump on a stretch of road, what is the expected decrease in traffic volume that we might expect at the point where the bump is added and how does that effect diminish further down the road.\nFinally, while these goals are laudable, they may not be achievable: It was admitted in the course of the presentation that at least one of the more quantitative goals — reducing vehicle volumes to below 3000 — was likely not attainable with the changes that were being planned.\n\n\n\n\nFigure 3: Traffic and accidents on Ellsworth Ave. Traffic counts from 2021, injuries from 2018-2019. Posted speed limit on this street is 25 miles per hour.\n\n\n\nThe proposed changes or “treatments”2 consist of a number of street shape alterations ranging from “rounding out” the corners at stop signs (See Figure 4), adding street narrowing concrete planters and roundabouts. The last of these recognize the realities of how many cars and bikes actually use stop signs — they don’t.\n\n\n\nFigure 4: Example Treatment used to ‘round out’ Stop Sign areas. Figure taken meeting slides linked above.\n\n\n\nWhat Lies Ahead?\nThe changes will occur in three phases, moving from west to east with phase one changes occurring on the stretch of Ellsworth west of Aiken, the second occurring between Aiken and Negley, and the final phase extending from Negley to Shady. Phase 1 is expected to occur in the final months of this year with subsequent changes rolled out in the years to come. In bullet form:\nOctober 2021 / Spring 2022\nInitial Installation\n\n2022\nInstall traffic circles\n\n2023\nPotential material upgrades at key locations\n\n2025\nSignal upgrades\n\nFinal Thoughts\nI enjoyed this meeting and the “pop-up” meeting that followed shortly after. I plan to return to this topic again in the weeks and months to come, both to provide a perspective in evaluating the proposed treatments — pending data access — and to discuss the various social and political dynamics that undercut these meetings.\nOn that note, while I’m very happy to say that the meeting was conducted in a friendly and civil manner, due in no small part to the professionalism of the DOMI, MoveForward, and BikePGH staff, there was an underlying tension between those who predominantly drive and those who predominantly walk or bike. While not necessarily the case across the neighborhood at large, this did seem to manifest across a generational gap; I recall hearing frustration on the part of the younger people on the call that the progress of bike friendly infrastructure wasn’t happening quickly enough and concern on the part of older individuals at to what exactly might happen and how it might affect their parking. Though I also think it is fair to say that even amidst their concern or impatience, everyone was generally very supportive.\nWhether young or old, everyone deserves to use streets safely and I am excited to see how the community works together as this project progresses.\nDisclaimer\nI live near Shadyside and bike in this neighborhood and on Ellsworth regularly. While I’d like to think I can still offer a dispassionate view of this topic, I would be remiss if I didn’t mention this point to you, dear reader, so that you might judge my opinions accordingly.\n\nAn all encompassing term, including dedicated bike lanes as well as streets without dedicated lanes where cyclists (should) feel safe riding↩︎\nA term I love for framing traffic, accidents, etc. as public health ills.↩︎\n",
    "preview": "posts/2021-10-10-Shadyside-Connector/proposed.jpeg",
    "last_modified": "2021-10-10T09:55:55-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-08-26-spatial-models/",
    "title": "Spatial Models",
    "description": "Have spatial data? You may need a spatial model!",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-10-02",
    "categories": [
      "Big Picture",
      "Technical"
    ],
    "contents": "\nIn studying the built environment and furthering our understanding of how to build better urban spaces, we’re often forced to study data that are spatially indexed — that is, the measurement’s spatial location is relevant to the project of interest. In order to handle this class of data we consequently need models that are specifically built to handle that spatial component: a spatial model.\nWhat’s a spatial model and how does it differ from a “non-spatial” model? In this post I’ll give an answer to these questions and more by providing a brief introduction to the three most common classes of spatial data structures and the models most often used with them. While I’ll do my best to build these up from the standard linear model commonly used across many quantitative disciplines, this post is no substitute for the more rigorous presentations offered elsewhere. See (Casella and Berger 2021; Gelman, Hill, and Vehtari 2020) or(Fitzmaurice et al. 2008) for a more thorough introduction to standard regression models, mixed effects models and (Banerjee, Carlin, and Gelfand 2003; Diggle 2006) for a more thorough introduction to spatial models.\nThe Ordinary Linear Model\nOne of the very first models introduced in basic statistics curriculum is the “ordinary linear model” shown below with three unknown variables: \\(\\alpha,\\beta\\) and \\(\\sigma^2\\):\n\\[\ny_i = \\alpha + \\beta x_i + \\epsilon_i\\\\\n\\epsilon_i \\stackrel{iid}{\\sim} N(0,\\sigma^2), \\quad i=1,...,n.\n\\]\n\nYou may also remember this as \\(y = mx+b\\) from high school. While not exactly the same, they’re both getting at the same idea - a line!\nThis is one of the cornerstone models in applied statistics and for good reason, a lot of relationships are linear, or at least approximately linear, and it offers an interpretable way to understand and test scientific hypotheses about reality.\n\n\n\nFigure 1: Scatter plot with true linear model overlaid.\n\n\n\nOrdinary linear models are great, I love and use them all the time. However, there is a key assumption when writing that cute little “iid” in the \\(\\epsilon \\stackrel{iid}{\\sim} N(0,\\sigma^2)\\) that can cause us all sorts of problems.\niid stands for independent and identically distributed.\nAssuming Independence\nBy writing those three little letters on top of that little squiggly line, we’re making a strong assumption about how we think those data are generated. In effect, we’re saying that each \\(y_i\\) does not in anyway depend on any other \\(y_i'\\), or more formally, for any \\(i\\neq i'\\), \\(P(y_i|y_{i'}) = P(y_i)\\): the probability of \\(y_i\\) being equal to some value is the same whether we observe \\(y_{i'}\\) or not!\nAs you can imagine, this is often not the case! In the context of the built environment especially, where we may be concerned with estimating the rate of crime, traffic, human health outcomes, economic productivity, etc., we’d often expect to find that the measurements in one area are very similar to the rates in an adjacent area. This idea is so well established, that in the field of geography it has been given high status as a “law.”\n\n“everything is related to everything else, but near things are more related than distant things.” - Waldo Tobler’s First Law of Geography\n\nStill, even after all this exposition, you may find yourself asking a particularly titular question.\n\n\n\nSpatial Models\nSpatial models, as well as many other classes of models, remove the independence assumption by assuming some structural form of dependence between observations. Accounting for this is not only crucial to conducting valid inference — our ability to credibly identify the effect of some exposure or intervention of interest — it also helps us to better predict measures in areas where we might not otherwise be able to collect data. The manner in which this dependence or correlation between observations is formed depends on both the system under study as well as the data collected.\nSpatial Surfaces\nAir pollution, tree cover and carbon dioxide levels. Each of these represent a kind of continuous surface across space that one may be interested in modeling but would likely need to account for spatial dependency in so doing. A common method for modeling this class of data is the Gaussian Process (GP), used as a spatial random effect, analogous to a typical random effect, as described in (Fitzmaurice et al. 2008), but now explicitly modeling the spatial dependence, or covariance between two observations, \\(\\Sigma_{i,i'}\\),1 through a covariance function \\(\\Sigma_{i,i'} = \\kappa(\\mathbf{s}_{i},\\mathbf{s}_{i'})\\), where \\(\\mathbf{s}_{i}, \\mathbf{s}_{i'}\\) represent two different spatial locations:\n\\[\ny_i = \\alpha + \\beta x_i + b_i + \\epsilon_i \\\\ \n\\mathbf{b} \\sim MVN_n(\\mathbf{0},\\Sigma) \\\\ \n\\epsilon_i \\sim N(0,\\sigma^2).\n\\]\n\none common \\(\\kappa(\\cdot,\\cdot)\\) is: \\(\\kappa(\\cdot,\\cdot|\\alpha,\\rho) = \\alpha\\exp \\left \\{ \\frac{ \\mid \\mid \\mathbf{s}_{i} - \\mathbf{s}_{i'} \\mid \\mid^2}{\\rho} \\right \\}\\).\nFor example, suppose we look at the EPA’s ozone measurements over Allegheny county for the month of August, 2021, shown in Figure 2.\n\n\n\n\nFigure 2: Visualization of average ozone air quality data across Pittsburgh monitors during August 2021. Data taken from the EPA.\n\n\n\nEven though we only observe specific points, we understand that the ozone levels could be continuously observed across the entire county. Fitting a GP model allows us to estimate that underlying spatial dependence and use the few points we observed to interpolate across the wider space: Two \\(b_i\\), \\(b_{i'}\\) terms will be more similar the smaller the distance is between the two points’ spatial locations.\nLooking at Figure 3, you can see this point illustrated. While we only had a small number of points available, we can now see the estimated surface across all the neighborhoods of Pittsburgh.\n\n\n\nFigure 3: Estimated Ozone Surface across PGH using Neighborhood Centroids as prediction points for each Neighborhood’s surface.\n\n\n\nAreal Spatial Networks\nIn contrast to points that we know are surfaces, we can also observe measures at an areal level: census tracts, neighborhoods, city streets, etc. where the spatial correlation isn’t understood in terms of the distance between two points, but rather the adjacency of the two observed units in space.\nFor example, in Figure 4, we can see the median income across the different census tracts of Allegheny county. Each tract is adjacent to several others. In modeling the median income across space, we might expect those tracts adjacent to one another to have similar median incomes.\n\n\n\nFigure 4: Distribution of Median Income Across Allegheny County, PA Census Tracts.\n\n\n\nOne way we can try to capture this notion of network dependency is through the Conditional Autoregressive, or CAR model shown below:\n\\[\ny_i = \\alpha + \\beta x_i + b_i + \\epsilon_i \\\\ \n\\mathbf{b} \\sim MVN_n(\\mathbf{0},\\Sigma) \\\\ \n\\Sigma = \\tau D(I-\\alpha \\mathbf{A}).\n\\]\n\nWhat are all those \\(\\tau\\)’s and \\(\\alpha\\)’s doing? It’s not important for this post to know exactly what they do, but conceptually they can be understood as tuning the strength of the spatial correlation across neighboring observations.\nWhere before the correlation between two points, \\(\\Sigma_{i,i'}\\), was a function of the distance between those points, now it is a function of the adjacency matrix \\(\\mathbf{A}\\) which has a 1 in row \\(i\\) and column \\(i\\)’ if the \\(i\\)th and \\(i\\)’th observation are adjacent and 0 otherwise.\nSimilar to how we could use the \\(\\kappa(\\cdot,\\cdot)\\) function in the GP to learn the correlation of observations across space, the CAR model uses the adjacency matrix and associated parameters to learn the how measures may be correlated across the spatial network of observations.\nSpatial Point Processes\nLast, but certainly not least, we have spatial point processes. While you may be thinking, “Wait, didn’t we already talk about points?” you’d be half right. In discussing spatial surfaces we observe points, but we model the points as a continuous surface. Spatial Point processes are not only observed as points, they are also modeled as points.\nConsider the locations of your favorite nearby fast food restaurants (FFRs). These can be plotted as points, as in Figure 5, and modeled as realizations from a point process.\n\n\n\n\nFigure 5: Fast Food Restaurants (FFRs) and Schools across Los Angeles.\n\n\n\nQuestions surrounding point processes may once again involve examining how the points are spatially correlated across space, identifying which points in space are most likely to produce the points of interest, or even simply using the points as data to condition on in some other model of interest.\nFor example, in the FFR example above, we may be interested in how the FFRs are distributed across space from the schools. In this setting one could model the set of distances, \\(\\{d\\}_{i=1}^{n}\\), of the FFRs from the schools as arising from an Inhomogeneous Poisson Process (IPP), estimating the spatial intensity function, \\(\\Lambda(d)\\), of how likely a FFR is to be located at distance \\(d\\) from a school.\n\\[\n\\{d\\}_{i=1}^{n}|\\Lambda(d) \\sim \\text{IPP}(\\Lambda(d))\n\\]\n\nSee here for more on this idea.\nConclusion\nThis has been a whirlwind tour that I hope has given a taste of what spatial models look like and how they can be used. These models will likely come up again and again throughout the course of this blog, as so many objects in the built environment are studied across space, so they are worth understanding early-on conceptually before they start to pop up in a “real-world” setting.\nAcknowledgements\nThanks to Kevin Putschko and Robert Svoboda for reading and offering comments on this article.\nUpdates\nI added a footnote on 10/26/21 to clarify notation for the spatial process model.\n\n\n\nBanerjee, Sudipto, Bradley P Carlin, and Alan E Gelfand. 2003. Hierarchical Modeling and Analysis for Spatial Data. Chapman; Hall/CRC.\n\n\nCasella, George, and Roger L Berger. 2021. Statistical Inference. Cengage Learning.\n\n\nDiggle, Peter J. 2006. “Spatio-Temporal Point Processes: Methods and Applications.” Monographs on Statistics and Applied Probability 107: 1.\n\n\nFitzmaurice, Garrett, Marie Davidian, Geert Verbeke, and Geert Molenberghs. 2008. Longitudinal Data Analysis. CRC press.\n\n\nGelman, Andrew, Jennifer Hill, and Aki Vehtari. 2020. Regression and Other Stories. Cambridge University Press.\n\n\nNote here that I am slightly abusing notation. Since we said that we are modeling \\(y_i\\) as a function of space, we might indicate this by denoting the the covariance as \\(\\Sigma(\\mathbf{s}_i,\\mathbf{s}_i)\\), outcome as \\(y(s_i)\\) and other spatially indexed variables equivalently. I have omitted these details for the sake of exposition so that the similarities between the different models may be more easily understood.↩︎\n",
    "preview": "posts/2021-08-26-spatial-models/spatial-models_files/figure-html5/ozonevis2-1.png",
    "last_modified": "2021-11-07T11:26:35-05:00",
    "input_file": {},
    "preview_width": 2688,
    "preview_height": 1536
  },
  {
    "path": "posts/2021-09-12-causal-inference-in-the-built-environment/",
    "title": "Causal Inference in the Built Environment",
    "description": "How can we know how to best change our environment?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-09-12",
    "categories": [
      "Big Picture"
    ],
    "contents": "\nIf we change the zoning rules on a region of land from exclusively allowing single family houses to permitting mixed-use apartments and retail, will this increase the number of cars on nearby roads? If an individual moves to an apartment where they have a greater number of grocery store options to choose from, will they weigh less in 2 months than if they stayed at their current location surrounded by fast food? These are the kinds of causal questions asked by those interested in understanding the built environment.\nI’ve written on this subject more broadly elsewhere, but want to return to it now in a setting where the complexities of working with built environment data can be more explicitly highlighted. Note that if you’re not familiar with causal inference concepts already you may want to read the previous post series linked and/or check out one of the numerous references I cite at the end of this post to get fully up to speed.\n1. Difficulties with Randomization\nThere are a number of obstacles that built environment data typically involve when an investigator sets out to study causal relationships. The first is that, typically, it is impossible to randomize the exposure — e.g. grocery stores — of interest. Whereas vaccines, drugs, and even some government programs can be randomly assigned to individuals, it isn’t possible to randomly assign a park to a neighborhood or a certain kind of business to a specific storefront. These kinds of decisions are extremely expensive and will often involve a substantial amount of political decision making, rendering any attempt to introduce randomness a doomed prospect from the start. As the reader may be aware, randomization is key to ensuring that the units of analysis - individuals, streets, etc. - are comparable. That is, there is no reason to think that those who have been treated or exposed are any different from those in the control group, the unexposed.\n\nIf you want to see one interesting case where an environmental exposure is randomized … and the subsequent difficulty they had — see here. This paper will be discussed soon!\nThis is obviously not the case in the built environment. We observe differences in the underlying populations associated with certain built environment exposures constantly. For example, dense walkable neighborhoods tend to be much more expensive than their suburban counterparts. Wealth is correlated with education, as well as number of other factors and so one might expect a wide range of different health outcomes between those in walkable neighborhoods and their more rural counterparts that are not due to the built environment at all, but rather the wealth and/or education with which they are correlated. Adjusting for these factors in order to create as comparable a comparison as possible is crucial, if one is to trust the resulting causal estimate.\n\n\n\nFigure 1: Distribution of Median Income Across Allegheny County, PA Census Tracts. Note the correlation in wealth across space.\n\n\n\n2. Interference\nEven if one were able to randomize exposure to some built environment feature1 (BEF), one then has to consider the effects of interference. Interference is the name given to the phenomenon when an intervention or treatment on one entity affects the outcome of another. A violation of the commonly held Stable Unit Treatment Value Assumption or SUTVA, interference rears its heads often in the built environment.\nConsider our example with upzoning. Changing the zoning on a plot of land will likely affect not only the number of cars on the street immediately in front of it but also other nearby streets. These streets traffic levels can “interfere” with one another, making a simple causal estimate more difficult to derive. Decomposing these effects across related units typically requires assumptions and/or prior understanding of the system under study. As such, interference can represent a major obstacle to making progress in this space.\n\n\n\nFigure 2: Observed 15 minute traffic rate on selected street blocks in Rittenhouse, Philadelphia from 2015-2020. Traffic rate is proportional to point size.\n\n\n\n3. Homogeneity, Additivity and More\nStill more problems await! In trying to understand how certain BEFs may affect human health or other aspects of the built environment, we’ll likely have to make even further assumptions. In our example with grocery stores, we’ll likely need to make some assumption that say, Kroger and Meier are equivalent grocery stores. This could be more justified than saying that the local farmer’s market could also merit the label of a “grocery store.” Assuming homogeneity in this manner greatly simplifies our modeling, and potentially increases our ability to detect an effect, but also runs us into conflicting with an assumption of consistency at the heart of causal inference.\nAdditivity is another such assumption that simplifies the mathematical tools required to estimate the causal estimand2 of interest. However, just as with assuming homogeneity, the simplicity that additivity enables in our mathematical modeling may not be justified by our principled understanding of the causal system under study. For example, does each fast food restaurant one lives near add some appreciable weight that they wouldn’t have otherwise? Probably not - otherwise those individuals living in dense mixed-use areas like New York City and other big cities would be huge! The exposure effect is more likely to be log additive, but this can be more difficult to model mathematically.\n\nSee (Peterson, Hirsch, and Sanchez 2021) for an example of where these ideas are put into practice.\nEven now, after listing all these challenges, I don’t want to leave you with the impression that we’ve covered everything. Other obstacles may still rear their head!\n\n\n\nFigure 3: Differences in hypothetical exposures for additive vs. non-additive models.\n\n\n\nSolutions\nAt this point, it may seem as though there is no way we can ever hope to understand the built environment amidst the many correlated and interfering forces at work. Fear not, there are still some things we can do. Though we’ll likely never have the same level of confidence in our results as we would in a randomized control trial, we can try to incorporate more information through regression, narrow our focus with difference in difference estimators, model the interference associated with interventions, and allow for heterogeneous treatment effects in our model estimates. All this and more will be discussed as a part of blog posts to come but if you’re interested in learning more of the theory behind these ideas, I’d suggest you check out the statistics references linked to on this site’s reference page and cited here (Hernán and Robins 2010; Gelman, Hill, and Vehtari 2020; Angrist and Pischke 2014; Morgan and Winship 2015).\nAcknowledgements\nThanks to Robert Svoboda for reading and offering comments on this article.\n\n\n\nAngrist, Joshua D, and Jörn-Steffen Pischke. 2014. Mastering’metrics: The Path from Cause to Effect. Princeton university press.\n\n\nGelman, Andrew, Jennifer Hill, and Aki Vehtari. 2020. Regression and Other Stories. Cambridge University Press.\n\n\nHernán, Miguel A, and James M Robins. 2010. “Causal Inference.” CRC Boca Raton, FL.\n\n\nMorgan, Stephen L, and Christopher Winship. 2015. Counterfactuals and Causal Inference. Cambridge University Press.\n\n\nPeterson, Adam, Jana Hirsch, and Brisa Sanchez. 2021. “Spatial Temporal Aggregated Predictors to Examine Built Environment Health Effects.” http://arxiv.org/abs/2105.10565.\n\n\nCatch-all term referring to any amenity or structure in the built environment. Examples include sidewalk availability, grocery stores or tree cover.↩︎\nan estimand is the thing one wishes to estimate.↩︎\n",
    "preview": "posts/2021-09-12-causal-inference-in-the-built-environment/causal-inference-in-the-built-environment_files/figure-html5/wealthvis-1.png",
    "last_modified": "2021-09-25T13:04:17-04:00",
    "input_file": {},
    "preview_width": 2304,
    "preview_height": 1536
  },
  {
    "path": "posts/motivation/",
    "title": "Motivation",
    "description": "Urban spaces are more important than ever: Three reasons why and a highlight\nof what's to come.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-08-07",
    "categories": [
      "Big Picture"
    ],
    "contents": "\nOf all the things to talk about, why talk about the places where we live? Whether a city, town, suburb, or remote rural residence, the environments we live in define our lives. They constrain – or enable – the things we do, the people we see, the food we eat … you get the picture. But still – who cares? And why write about them right now?\nIn this post I’m going to try and convince you that, barring any commitments you may have made to a myopic nihilism, you care about the built environment, and urban spaces1 more generally, for at least 3 broad reasons, that will motivate much of the writing to follow. Here I’ll appeal to intuition, cite news articles, and be generally “un-academic” or imprecise, but this will likely change in subsequent posts. For now I hope to convince you, in broad strokes, that these environments are one of humanity’s most important inventions and that innovation in this space is especially important right now. Here’s why.\n#1. Social Cohesion: Can we get along?\nProtests. Riots. Mobs raging in the street. The past two years have shown us more than ever how we struggle to get along at a societal level. And that’s even before we start talking about the difficulties of getting along with family at Thanksgiving dinner or the comments on the latest NextDoor post.\nLike many things, it is easy to take for granted, but getting along with one another is important, not only to reinforce a feeling of safety in where one lives, but to also provide a sense of belonging and social community.\nIf any neighborhood, town or city is going to have real staying power it will be because people want to live there. How to accomplish this is another matter. Amidst all the social strife that exists in our modern age, how do we go about creating communities that flourish?\n#2. Efficiency: Cheaper, Faster, Farther\nHow can we do more with less? In an age of increasing income inequality and tight budgets, you’d think we would spend more time thinking about ways to stretch the money we have. Whether in terms of housing, transit, professional opportunities, or more, the increased density a city possesses should offer immense efficiency for its residents in how they spend their money. After all, this is one of the key reasons humans began gathering together in primitive towns all those many years ago. Easier to be near the specialized skills – healers, farmers, house builders, etc. Easier to get to work or play by way of well-established roads. And so on. Cities are fundamentally an economic bargain and you should be better off living in a city in terms of time and money spent than you would be elsewhere. How can cities help us to do more with less?\n#3. Climate Change: Life or Death\nFloods in China and Germany, wildfires, drought and heatwaves throughout the American mountain west. While I can remember a time when doubt about the perils of climate change was boasted with pride – not too long ago unfortunately – the evidence that the climate is changing and we are the cause only continues to climb with a increasing financial and human cost(Coninck 2018). But where do cities come into play?\nSPM.1: Figure 1 of the Summary for Policymakers of the IPCC’s Special Report on Global Warming of 1.5°C.Of the five biggest sources of greenhouse gas (GHG) emissions at least three can be reduced by improving urban spaces. I’ll give a brief example for each.\nElectricity:\nA typical suburban home has, on average, 9 rooms to light, heat and cool each day. In contrast, an old school row home will typically have 4-5 rooms, and a proportionately smaller electric GHG footprint as a result.\n\nTransportation:\nLiving closer to other people should mean you don’t have to drive as far to work, or that there’s easier options through biking and/or public transit instead.\n\nManufacturing:\nIf you’re living in a smaller space, you don’t need or want as much stuff. Far more importantly, you also don’t need to build as many roads, pipes, or other infrastructure because you’re getting more use out of the infrastructure you already have in place.\n\nAs we look to the future and marshall what hope we have to meet the challenge a changing climate presents, how can we leverage our cities to be more resilient and help us stave off the worst possibilities climate change may present to humanity?\nThe Reality\nIt’s easy to see in the U.S.2, whether through suburban sprawl, traffic jammed highways, increasing cost of living or crime and safety issues, our cities fail to live up to the full promise that urban spaces ought to offer. Identifying the nature of these failings explicitly, as well as the solutions that may address them, will form much of the substance of this blog.\nAcknowledgements\nThis post was updated on 9/11/2012 with minor editorial changes.\n\n\n\nConinck, Heleen C de. 2018. “IPCC Sr15: Summary for Policymakers.” In IPCC Special Report Global Warming of 1.5 c. Intergovernmental Panel on Climate Change.\n\n\nurban spaces is a term I will use interchangeably with cities to refer to any space in which humans live within close proximity to one another. It is not intended to be used with great precision here.↩︎\nThe U.S. will be the primary, though not exclusive focus of this blog.↩︎\n",
    "preview": "posts/motivation/spm1.png",
    "last_modified": "2021-09-11T19:26:56-04:00",
    "input_file": {},
    "preview_width": 900,
    "preview_height": 600
  }
]
