[
  {
    "path": "posts/2021-09-12-causal-inference-in-the-built-environment/",
    "title": "Causal Inference in the Built Environment",
    "description": "How can we know how to best change our environment?",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-09-12",
    "categories": [
      "Big Picture"
    ],
    "contents": "\nIf we change the zoning rules on a region of land from exclusively allowing single family houses to permitting mixed-use apartments and retail, will this increase the number of cars on nearby roads? If an individual moves to an apartment where they have a greater number of grocery store options to choose from, will they weigh less in 2 months than if they stayed at their current location surrounded by fast food? These are the kinds of causal questions asked by those interested in understanding the built environment.\nI’ve written on this subject more broadly elsewhere, but want to return to it now in a setting where the complexities of working with built environment data can be more explicitly highlighted. Note that if you’re not familiar with causal inference concepts already you may want to read the previous post series linked and/or check out one of the numerous references I cite at the end of this post to get fully up to speed.\n1. Difficulties with Randomization\nThere are a number of obstacles that built environment data typically involve when an investigator sets out to study causal relationships. The first is that, typically, it is impossible to randomize the exposure — e.g. grocery stores — of interest. Whereas vaccines, drugs, and even some government programs can be randomly assigned to individuals, it isn’t possible to randomly assign a park to a neighborhood or a certain kind of business to a specific storefront. These kinds of decisions are extremely expensive and will often involve a substantial amount of political decision making, rendering any attempt to introduce randomness a doomed prospect from the start. As the reader may be aware, randomization is key to ensuring that the units of analysis - individuals, streets, etc. - are comparable. That is, there is no reason to think that those who have been treated or exposed are any different from those in the control group, the unexposed.\n\nIf you want to see one interesting case where an environmental exposure is randomized … and the subsequent difficulty they had — see here. This paper will be discussed soon!\nThis is obviously not the case in the built environment. We observe differences in the underlying populations associated with certain built environment exposures constantly. For example, dense walkable neighborhoods tend to be much more expensive than their suburban counterparts. Wealth is correlated with education, as well as number of other factors and so one might expect a wide range of different health outcomes between those in walkable neighborhoods and their more rural counterparts that are not due to the built environment at all, but rather the wealth and/or education with which they are correlated. Adjusting for these factors in order to create as comparable a comparison as possible is crucial, if one is to trust the resulting causal estimate.\n\n\n\nFigure 1: Distribution of Median Income Across Allegheny County, PA Census Tracts. Note the correlation in wealth across space.\n\n\n\n2. Interference\nEven if one were able to randomize exposure to some built environment feature1 (BEF), one then has to consider the effects of interference. Interference is the name given to the phenomenon when an intervention or treatment on one entity affects the outcome of another. A violation of the commonly held Stable Unit Treatment Value Assumption or SUTVA, interference rears its heads often in the built environment.\nConsider our example with upzoning. Changing the zoning on a plot of land will likely affect not only the number of cars on the street immediately in front of it but also other nearby streets. These streets traffic levels can “interfere” with one another, making a simple causal estimate more difficult to derive. Decomposing these effects across related units typically requires assumptions and/or prior understanding of the system under study. As such, interference can represent a major obstacle to making progress in this space.\n\n\n\nFigure 2: Observed 15 minute traffic rate on selected street blocks in Rittenhouse, Philadelphia from 2015-2020. Traffic rate is proportional to point size.\n\n\n\n3. Homogeneity, Additivity and More\nStill more problems await! In trying to understand how certain BEFs may affect human health or other aspects of the built environment, we’ll likely have to make even further assumptions. In our example with grocery stores, we’ll likely need to make some assumption that say, Kroger and Meier are equivalent grocery stores. This could be more justified than saying that the local farmer’s market could also merit the label of a “grocery store.” Assuming homogeneity in this manner greatly simplifies our modeling, and potentially increases our ability to detect an effect, but also runs us into conflicting with an assumption of consistency at the heart of causal inference.\nAdditivity is another such assumption that simplifies the mathematical tools required to estimate the causal estimand2 of interest. However, just as with assuming homogeneity, the simplicity that additivity enables in our mathematical modeling may not be justified by our principled understanding of the causal system under study. For example, does each fast food restaurant one lives near add some appreciable weight that they wouldn’t have otherwise? Probably not - otherwise those individuals living in dense mixed-use areas like New York City and other big cities would be huge! The exposure effect is more likely to be log additive, but this can be more difficult to model mathematically.\n\nSee (Peterson, Hirsch, and Sanchez 2021) for an example of where these ideas are put into practice.\nEven now, after listing all these challenges, I don’t want to leave you with the impression that we’ve covered everything. Other obstacles may still rear their head!\n\n\n\nFigure 3: Differences in hypothetical exposures for additive vs. non-additive models.\n\n\n\nSolutions\nAt this point, it may seem as though there is no way we can ever hope to understand the built environment amidst the many correlated and interfering forces at work. Fear not, there are still some things we can do. Though we’ll likely never have the same level of confidence in our results as we would in a randomized control trial, we can try to incorporate more information through regression, narrow our focus with difference in difference estimators, model the interference associated with interventions, and allow for heterogeneous treatment effects in our model estimates. All this and more will be discussed as a part of blog posts to come but if you’re interested in learning more of the theory behind these ideas, I’d suggest you check out the statistics references linked to on this site’s reference page and cited here (Hernán and Robins 2010; Gelman, Hill, and Vehtari 2020; Angrist and Pischke 2014; Morgan and Winship 2015).\nAcknowledgements\nThanks to Robert Svoboda for reading and offering comments on this article.\n\n\n\nAngrist, Joshua D, and Jörn-Steffen Pischke. 2014. Mastering’metrics: The Path from Cause to Effect. Princeton university press.\n\n\nGelman, Andrew, Jennifer Hill, and Aki Vehtari. 2020. Regression and Other Stories. Cambridge University Press.\n\n\nHernán, Miguel A, and James M Robins. 2010. “Causal Inference.” CRC Boca Raton, FL.\n\n\nMorgan, Stephen L, and Christopher Winship. 2015. Counterfactuals and Causal Inference. Cambridge University Press.\n\n\nPeterson, Adam, Jana Hirsch, and Brisa Sanchez. 2021. “Spatial Temporal Aggregated Predictors to Examine Built Environment Health Effects.” http://arxiv.org/abs/2105.10565.\n\n\nCatch-all term referring to any amenity or structure in the built environment. Examples include sidewalk availability, grocery stores or tree cover.↩︎\nan estimand is the thing one wishes to estimate.↩︎\n",
    "preview": "posts/2021-09-12-causal-inference-in-the-built-environment/causal-inference-in-the-built-environment_files/figure-html5/wealthvis-1.png",
    "last_modified": "2021-09-12T09:03:17-04:00",
    "input_file": {},
    "preview_width": 2304,
    "preview_height": 1536
  },
  {
    "path": "posts/motivation/",
    "title": "Motivation",
    "description": "Urban spaces are more important than ever: Three reasons why and a highlight\nof what's to come.",
    "author": [
      {
        "name": "Adam Peterson",
        "url": "https://apetersonsite.org"
      }
    ],
    "date": "2021-08-07",
    "categories": [
      "Big Picture"
    ],
    "contents": "\nOf all the things to talk about, why talk about the places where we live? Whether a city, town, suburb, or remote rural residence, the environments we live in define our lives. They constrain – or enable – the things we do, the people we see, the food we eat … you get the picture. But still – who cares? And why write about them right now?\nIn this post I’m going to try and convince you that, barring any commitments you may have made to a myopic nihilism, you care about the built environment, and urban spaces1 more generally, for at least 3 broad reasons, that will motivate much of the writing to follow. Here I’ll appeal to intuition, cite news articles, and be generally “un-academic” or imprecise, but this will likely change in subsequent posts. For now I hope to convince you, in broad strokes, that these environments are one of humanity’s most important inventions and that innovation in this space is especially important right now. Here’s why.\n#1. Social Cohesion: Can we get along?\nProtests. Riots. Mobs raging in the street. The past two years have shown us more than ever how we struggle to get along at a societal level. And that’s even before we start talking about the difficulties of getting along with family at Thanksgiving dinner or the comments on the latest NextDoor post.\nLike many things, it is easy to take for granted, but getting along with one another is important, not only to reinforce a feeling of safety in where one lives, but to also provide a sense of belonging and social community.\nIf any neighborhood, town or city is going to have real staying power it will be because people want to live there. How to accomplish this is another matter. Amidst all the social strife that exists in our modern age, how do we go about creating communities that flourish?\n#2. Efficiency: Cheaper, Faster, Farther\nHow can we do more with less? In an age of increasing income inequality and tight budgets, you’d think we would spend more time thinking about ways to stretch the money we have. Whether in terms of housing, transit, professional opportunities, or more, the increased density a city possesses should offer immense efficiency for its residents in how they spend their money. After all, this is one of the key reasons humans began gathering together in primitive towns all those many years ago. Easier to be near the specialized skills – healers, farmers, house builders, etc. Easier to get to work or play by way of well-established roads. And so on. Cities are fundamentally an economic bargain and you should be better off living in a city in terms of time and money spent than you would be elsewhere. How can cities help us to do more with less?\n#3. Climate Change: Life or Death\nFloods in China and Germany, wildfires, drought and heatwaves throughout the American mountain west. While I can remember a time when doubt about the perils of climate change was boasted with pride – not too long ago unfortunately – the evidence that the climate is changing and we are the cause only continues to climb with a increasing financial and human cost(Coninck 2018). But where do cities come into play?\nSPM.1: Figure 1 of the Summary for Policymakers of the IPCC’s Special Report on Global Warming of 1.5°C.Of the five biggest sources of greenhouse gas (GHG) emissions at least three can be reduced by improving urban spaces. I’ll give a brief example for each.\nElectricity:\nA typical suburban home has, on average, 9 rooms to light, heat and cool each day. In contrast, an old school row home will typically have 4-5 rooms, and a proportionately smaller electric GHG footprint as a result.\n\nTransportation:\nLiving closer to other people should mean you don’t have to drive as far to work, or that there’s easier options through biking and/or public transit instead.\n\nManufacturing:\nIf you’re living in a smaller space, you don’t need or want as much stuff. Far more importantly, you also don’t need to build as many roads, pipes, or other infrastructure because you’re getting more use out of the infrastructure you already have in place.\n\nAs we look to the future and marshall what hope we have to meet the challenge a changing climate presents, how can we leverage our cities to be more resilient and help us stave off the worst possibilities climate change may present to humanity?\nThe Reality\nIt’s easy to see in the U.S.2, whether through suburban sprawl, traffic jammed highways, increasing cost of living or crime and safety issues, our cities fail to live up to the full promise that urban spaces ought to offer. Identifying the nature of these failings explicitly, as well as the solutions that may address them, will form much of the substance of this blog.\nAcknowledgements\nThis post was updated on 9/11/2012 with minor editorial changes.\n\n\n\nConinck, Heleen C de. 2018. “IPCC Sr15: Summary for Policymakers.” In IPCC Special Report Global Warming of 1.5 c. Intergovernmental Panel on Climate Change.\n\n\nurban spaces is a term I will use interchangeably with cities to refer to any space in which humans live within close proximity to one another. It is not intended to be used with great precision here.↩︎\nThe U.S. will be the primary, though not exclusive focus of this blog.↩︎\n",
    "preview": "posts/motivation/spm1.png",
    "last_modified": "2021-09-11T19:26:56-04:00",
    "input_file": {},
    "preview_width": 900,
    "preview_height": 600
  }
]
